[{"Page_url": "https://rewardsforjustice.net/rewards/seka-musa-baluku/", "Title": "Seka Musa Baluku – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2023/02/baluku-300x300.jpg", "date_of_birth": "\n\t\t\t\t\t\t\tEstimated 1975 or 1976\t\t\t\t\t\t", "associated_organisation": null, "associated_location": "Democratic Republic of the Congo", "about": "Rewards for Justice is offering a reward of up to $5 million for information on ISIS-DRC leader Seka Musa Baluku.,Under Seka Musa Baluku’s leadership, ISIS-DRC targets, kills, maims, rapes, and commits other sexual violence and engages in abduction of civilians, including children. The group also recruits and uses children during attacks and for forced labor in the DRC’s Beni territory. ISIS-DRC, also known as the Allied Democratic Forces (ADF) and Madina at Tauheed Wau Mujahedeen, among other names, has unleashed brutal violence against Congolese citizens and regional military forces across North Kivu and Ituri Provinces in Eastern DRC. The group killed more than 849 civilians in 2020 alone, according to the UN Security Council.,In March 2021, the Department of State designated Baluku as a Specially Designated Global Terrorist (SDGT). At the same time, the Department also designated ISIS-DRC as a Foreign Terrorist Organizations and as a SDGT.,As a result of these designations, among other consequences, all property and interests in property of those designated that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with them. Foreign financial institutions that knowingly conduct or facilitate any significant transaction on behalf of Baluku or ISIS-DRC could be subject to U.S. correspondent account or payable-through account sanctions. Additionally, it is a crime to knowingly provide material support or resources to ISIS-DRC or to attempt or conspire to do so.,The ADF was previously sanctioned by the U.S. Department of the Treasury and the United Nations under the UN Security Council’s DRC sanctions regime in 2014 for its violence and atrocities. The U.S. Department of the Treasury also sanctioned Baluku and five other ADF members in 2019 under the Global Magnitsky sanctions program for their roles in serious human rights abuse. In 2020, the UN designated Baluku for additional sanctions under its DRC sanctions program."}, {"Page_url": "https://rewardsforjustice.net/rewards/moro-national-liberation-front-mnlf/", "Title": "Moro National Liberation Front (MNLF) – Rewards For Justice", "Reward_amount": null, "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/08/MNLF.png", "date_of_birth": null, "associated_organisation": null, "associated_location": "", "about": "The Moro National Liberation Front (MNLF) was founded in the Philippines in 1972. It started as a splinter group of the Muslim Independence Movement. The MNLF was the leading organization among Moro separatists for nearly two decades beginning from the 1970s. In the early 1990s, several MNLF members broke off to form the Abu Sayyaf Group (ASG), one of the most violent terrorist groups in the Philippines.,In 1996, the MNLF signed a landmark peace agreement with the Philippine government, creating the Special Zone of Peace and Development (SZOPAD). MNLF chairman Nur Misuari was named the governor of the Autonomous Region of Muslim Mindanao (ARMM), an area composed of two mainland provinces and three island provinces in which the predominantly Muslim population was granted a degree of self-rule. Occasional clashes between extremist rebels and government security forces continued in Mindanao, and many of the region’s residents called for the creation of a workable framework for meaningful autonomy and development in Muslim Mindanao.,On September 29, 2009 on Jolo Island, Philippines, an MNLF-placed explosive device blew up a convoy of military vehicles. The blast killed two U.S. Army soldiers and an Armed Forces of the Philippines (AFP) soldier, who were part of a humanitarian mission to construct a school in the area.,In 2013, rogue elements of the MNLF conducted a violent three-week siege of Zamboanga City that killed dozens of Philippine Security Force members and displaced thousands.,Today, the MNLF consists of many factions, some of which supported negotiations between the Philippine government and the splinter group Moro Islamic Liberation front (MILF). Those negotiations led to the 2018 passing of the Bangsamoro Organic Law (BOL) and the 2019 creation of the Bangsamoro Autonomous Region of Muslim Mindanao (BARMM)."}, {"Page_url": "https://rewardsforjustice.net/rewards/movement-for-unity-and-jihad-in-west-africa-mujwa/", "Title": "Movement for Unity and Jihad in West Africa (MUJWA) – Rewards For Justice", "Reward_amount": null, "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/h-300x217.jpg", "date_of_birth": null, "associated_organisation": null, "associated_location": "", "about": "Movement for Unity and Jihad in West Africa (MUJWA) appeared in West Africa in 2011 after splitting off from al-Qa’ida in the Islamic Maghreb. In 2013, the group merged with al-Mourabitoun, which was then subsequently incorporated into Jama’at Nusrat al-Islam wal-Muslimin (JNIM).,The U.S. Department of State named JNIM a Foreign Terrorist Organization under the Immigration and Nationality Act (as amended) on September 6, 2018."}, {"Page_url": "https://rewardsforjustice.net/rewards/revolutionary-organization-17-november-17n/", "Title": "Revolutionary Organization 17 November (17N) – Rewards For Justice", "Reward_amount": null, "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/08/17N-300x187.png", "date_of_birth": null, "associated_organisation": null, "associated_location": "", "about": "Revolutionary Organization 17 November (17N) was established in 1975 as a radical leftist group. The group sought the ouster of U.S. bases from Greece, the removal of Turkish military forces from Cyprus, and the severing of Greece’s ties to NATO and the European Union. 17N was responsible for numerous acts of terror in Greece, including shootings, rocket attacks, and car bombs. The group’s campaign of terror resulted in the deaths of four Americans: William Nordeen, Ronald Stewart, George Tsantes, and Richard Welch. An offshoot of 17N claimed responsibility for the January 12, 2007 rocket-propelled grenade attack on the U.S. Embassy in Athens.,On October 8, 1997, the U.S. Department of State designated 17N as a Foreign Terrorist Organization (FTO) under section 219 of the Immigration and Nationality Act, as amended. On September 3, 2015, the Department of State revoked 17N’s designation as an FTO."}, {"Page_url": "https://rewardsforjustice.net/rewards/islamic-states-khorasan-province-isis-k/", "Title": "Islamic State’s Khorasan Province (ISIS-K) – Rewards For Justice", "Reward_amount": null, "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/isis-k.png", "date_of_birth": null, "associated_organisation": null, "associated_location": "", "about": "Islamic State’s Khorasan Province (ISIS-K) is an Afghanistan-based terrorist group that conducts operations in Afghanistan and Pakistan. Composed primarily of former members of Tehrik-e Taliban Pakistan, the Afghan Taliban, and the Islamic Movement of Uzbekistan, ISIS-K pledged allegiance to ISIS in 2015. ISIS-K is responsible for the July 2016 bombing at a peaceful protest in Kabul that killed nearly 80 people and wounded another 230. In August 2016, the group claimed responsibility for a shooting and suicide bombing at a hospital in Quetta, Pakistan, which killed 94. ISIS-K also claimed responsibility for the May 2020 attack at a Kabul maternity hospital that killed 24 people, including newborn babies and their mothers.,On January 14, 2016, the U.S. Department of State designated ISIS-K as a Foreign Terrorist Organization under section 219 of the Immigration and Nationality Act, as amended. Previously, on September 29, 2015, the Department of State designated ISIS-K as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result, all of ISIS-K’s property, and interests in property, subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with ISIS-K. It is a crime to knowingly provide, or to attempt or conspire to provide, material support or resources to ISIS-K."}, {"Page_url": "https://rewardsforjustice.net/rewards/lashkar-e-tayyiba-let/", "Title": "Lashkar-e Tayyiba (LeT) – Rewards For Justice", "Reward_amount": null, "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/Lashkar-e_Tayyiba.png", "date_of_birth": null, "associated_organisation": null, "associated_location": "", "about": "Lashkar-e Tayyiba (LeT), also known as the Army of the Righteous, is a Pakistan-based terrorist group that was formed in the 1980s. LeT has conducted operations, including several high-profile attacks, against Indian troops and civilian targets since 1993. The group also has attacked Coalition Forces in Afghanistan. LeT was responsible for the November 2008 terrorist attacks in Mumbai, India that killed 166 people–including six U.S. citizens–and injured more than 300.,On December 26, 2001, the U.S. Department of State designated LeT as a Foreign Terrorist Organization under section 219 of the Immigration and Nationality Act, as amended. Previously, on December 20, 2001, the Department of State designated LeT as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result, all of LeT’s property, and interests in property, subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with LeT. It is a crime to knowingly provide, or to attempt or conspire to provide, material support or resources to LeT."}, {"Page_url": "https://rewardsforjustice.net/rewards/islamic-state-in-iraq-and-syria-isis/", "Title": "Islamic State in Iraq and Syria (ISIS) – Rewards For Justice", "Reward_amount": null, "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/AQTN-300x225.png,https://rewardsforjustice.net/wp-content/uploads/2021/08/ISIS-1-300x222.jpeg", "date_of_birth": null, "associated_organisation": null, "associated_location": "", "about": "The Islamic State in Iraq and Syria (ISIS) emerged from the remnants of al-Qa’ida in Iraq (AQI). The group adopted the moniker ISIS to express its regional ambitions as it expanded operations to include the Syrian conflict. ISIS was led by Abu Bakr al-Baghdadi, who declared the establishment of an Islamic caliphate in June 2014. He was killed on October 27, 2019 during a U.S. military operation to capture him. ISIS exploited the conflict in Syria and sectarian tensions in Iraq, which allowed it to gain control of territory in both countries. In 2019, the Global Coalition to Defeat ISIS — consisting of several partner nations and international institutions — liberated all territory controlled by ISIS in Syria and Iraq. Efforts against the group in Iraq, Syria, and other countries continue.,In November 2015, ISIS carried out a series of coordinated attacks in Paris that killed nearly 130 people, including an American, and wounded more than 350 others. In March 2016, ISIS directed two simultaneous attacks in Brussels that killed 32 people, including four U.S. citizens, and injured more than 250 people. In June 2016, a gunman who pledged allegiance to ISIS killed 49 individuals and injured 53 others at the Pulse nightclub in Orlando, Florida. In July 2016, ISIS claimed an attack in which a terrorist driving a cargo truck attacked a crowd in Nice, France during Bastille Day celebrations, resulting in 86 deaths, including three U.S. citizens. In January 2019, ISIS claimed responsibility for the suicide bombing of a restaurant in Manbij, Syria, that killed 19 people, including four Americans. On Easter Sunday 2019 in Sri Lanka, more than 250 people were killed, including five U.S. citizens, when ISIS-inspired terrorists carried out coordinated suicide bombings at multiple churches and hotels.,On December 17, 2004, the U.S. Department of State designated AQI (now known as ISIS) as a Foreign Terrorist Organization under section 219 of the Immigration and Nationality Act, as amended. Previously, on October 15, 2004, the Department of State designated AQI as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result, all of ISIS’s property, and interests in property, subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with ISIS. It is a crime to knowingly provide, or to attempt or conspire to provide, material support or resources to ISIS."}, {"Page_url": "https://rewardsforjustice.net/rewards/jamaat-nusrat-al-islam-wal-muslimin-jnim/", "Title": "Jama’at Nusrat al-Islam wal-Muslimin (JNIM) – Rewards For Justice", "Reward_amount": null, "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/JNIM_new.jpg", "date_of_birth": null, "associated_organisation": null, "associated_location": "", "about": "Jama’at Nusrat al-Islam wal-Muslimin (JNIM) has described itself as al-Qa’ida’s official branch in Mali. In 2017, the Sahara Branch of al-Qa’ida in the Islamic Maghreb, al-Murabitoun, Ansar al-Dine, and the Macina Liberation Front came together to form JNIM. Operating in Mali, Niger, and Burkina Faso, JNIM is responsible for numerous attacks and kidnappings. In June 2017, JNIM carried out an attack at a resort frequented by Westerners outside of Bamako and was responsible for the large-scale coordinated attacks in Ouagadougou on March 2, 2018. In September, JNIM detonated a landmine under a passenger bus in central Mali, killing 14 civilians and injuring another 24.,On September 6, 2018, the U.S. Department of State designated JNIM as a Foreign Terrorist Organization under section 219 of the Immigration and Nationality Act, as amended. Previously, on September 5, 2018, the Department of State designated JNIM as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result, all of JNIM’s property, and interests in property, subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with JNIM. It is a crime to knowingly provide, or to attempt or conspire to provide, material support or resources to JNIM."}, {"Page_url": "https://rewardsforjustice.net/rewards/islamic-state-west-africa-province-isis-wa/", "Title": "Islamic State West Africa Province (ISIS-WA) – Rewards For Justice", "Reward_amount": null, "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/isis-west.png", "date_of_birth": null, "associated_organisation": null, "associated_location": "", "about": "ISIS West Africa (ISIS-WA), a faction of terrorist group Boko Haram, was created when ISIS-WA pledged allegiance to ISIS in March 2015. ISIS accepted the group’s pledge, and the group began calling itself ISIS-West Africa. Active primarily in northeast Nigeria and the greater Lake Chad region, ISIS-WA has carried out numerous terrorist attacks since 2016. In November 2018, ISIS-WA claimed responsibility for five attacks in Chad and Nigeria that resulted in 118 deaths. In May 2019, ISIS-WA claimed responsibility for two attacks in western Niger, which killed 29 soldiers. In July 2019, ISIS-WA fighters killed 20 Nigerian and five Chadian soldiers during an attack on a military base near Baga, Nigeria.,On February 28, 2018, the U.S. Department of State designated ISIS-WA as a Foreign Terrorist Organization under section 219 of the Immigration and Nationality Act, as amended. Previously, on February 27, 2018, the Department of State designated ISIS-WA as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result, all of ISIS-WA’s property, and interests in property, subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with ISIS-WA. It is a crime to knowingly provide, or to attempt or conspire to provide, material support or resources to ISIS-WA."}, {"Page_url": "https://rewardsforjustice.net/rewards/kurdistan-workers-party-pkk/", "Title": "Kurdistan Workers Party (PKK) – Rewards For Justice", "Reward_amount": null, "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/08/PKK-300x200.png", "date_of_birth": null, "associated_organisation": null, "associated_location": "", "about": "The Kurdistan Workers’ Party (PKK) is a Kurdish separatist group primarily active in northern Iraq and southeastern Turkey. The group, composed primarily of Turkish Kurds, launched a campaign of violence in 1984. The PKK’s original goal was to establish an independent Kurdish state in southeastern Turkey. In the early 1990s, the PKK moved beyond rural-based insurgent activities to engage in urban terrorism.,The PKK foreswore violence from 1999 until June 2004, when its hardline militant wing took control and renounced the self-imposed cease-fire. In 2009, the Turkish government and the PKK resumed peace negotiations. However, talks broke down after the PKK carried out an attack in July 2011 that killed 13 Turkish soldiers. PKK and Turkish forces clashed repeatedly in 2011 and 2012, including an attack in October 2011 that killed 24 Turkish troops and was the deadliest incident since 1993. In 2018, numerous attacks by the PKK were reported against Turkey’s security forces, including an attack claimed by the PKK in November against a Turkish army base that resulted in dozens of casualties.,On October 8, 1997, the U.S. Department of State designated the PKK as a Foreign Terrorist Organization under section 219 of the Immigration and Nationality Act, as amended. Later, on October 31, 2001, the Department of State designated the PKK as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result, all of the PKK’s property, and interests in property, subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with the PKK. It is a crime to knowingly provide, or to attempt or conspire to provide, material support or resources to the PKK."}, {"Page_url": "https://rewardsforjustice.net/rewards/revolutionary-peoples-liberation-party-front-dhkp-c/", "Title": "Revolutionary People’s Liberation Party/Front (DHKP/C) – Rewards For Justice", "Reward_amount": null, "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/08/DHKP_C-300x200.png", "date_of_birth": null, "associated_organisation": null, "associated_location": "", "about": "The Revolutionary People’s Liberation Party/Front (DHKP/C) was founded in 1978 in Turkey. DHKP/C advocates a Marxist-Leninist ideology and opposes the United States, NATO, and the Turkish establishment. The group has targeted U.S. interests, including U.S. military and diplomatic personnel and facilities, NATO personnel and facilities, and Turkish targets since the 1990s. In February 2013, a DHKP/C operative exploded a suicide vest at the U.S. Embassy in Ankara. The explosion killed a Turkish guard and seriously wounded a Turkish journalist. In March 2013, three members of the group attacked the Ministry of Justice and the Ankara headquarters of the Turkish Justice and Development political party using grenades and rocket launchers.,On October 8, 1997, the U.S. Department of State designated DHKP/C as a Foreign Terrorist Organization under section 219 of the Immigration and Nationality Act, as amended. On October 31, 2001, the Department of State designated DHKP/C as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result, all of DHKP/C’s property, and interests in property, subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with DHKP/C. It is a crime to knowingly provide, or to attempt or conspire to provide, material support or resources to DHKP/C."}, {"Page_url": "https://rewardsforjustice.net/rewards/islamic-revolutionary-guard-corps-qods-force-irgc-qf/", "Title": "Islamic Revolutionary Guard Corps-Qods Force (IRGC-QF) – Rewards For Justice", "Reward_amount": null, "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/08/IRGC-QF-282x300.png", "date_of_birth": null, "associated_organisation": null, "associated_location": "", "about": "The Islamic Revolutionary Guard Corps-Qods Force (IRGC-QF), a branch of the IRGC, is Iran’s primary mechanism for cultivating and supporting terrorist groups abroad. Iran uses the IRGC-QF to implement its foreign policy goals, provide cover for intelligence operations, and create instability in the Middle East. In 2011, the IRGC-QF plotted to assassinate the Saudi Ambassador to the United States in Washington D.C. In 2012, IRGC-QF operatives were arrested in Turkey and Kenya for plotting attacks. In January 2018, Germany uncovered 10 IRGC operatives involved in a terrorist plot in Germany.,On April 15, 2019, the U.S. Department of State designated the IRGC, including the IRGC-QF, as a Foreign Terrorist Organization under Section 219 of the Immigration and Nationality Act, as amended. In 2017, the U.S. Department of the Treasury designated the IRGC as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended, for its activities in support of the IRGC-QF. As a result, all of the IRGC’s property, and interests in property, subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with the IRGC. It is a crime to knowingly provide, or to attempt or conspire to provide, material support or resources to the IRGC."}, {"Page_url": "https://rewardsforjustice.net/rewards/revolutionary-struggle-rs/", "Title": "Revolutionary Struggle (RS) – Rewards For Justice", "Reward_amount": null, "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/H-2-300x217.jpg", "date_of_birth": null, "associated_organisation": null, "associated_location": "", "about": "Revolutionary Struggle (RS) emerged in 2003 following the arrests of members of two other Greek Marxist groups, 17 November and Revolutionary People’s Struggle. A radical Marxist extremist group, RS has conducted attacks against both Greek and U.S. targets in Greece. RS first gained notoriety when it claimed responsibility for the September 5, 2003 bombings at the Athens Courthouse during the trials of 17 November members. RS claimed responsibility for the January 2007 rocket-propelled grenade attack on the U.S. Embassy in Athens and the March 2009 bombing of a Citibank branch in Athens.,On May 18, 2009, the U.S. Department of State designated RS as a Foreign Terrorist Organization under section 219 of the Immigration and Nationality Act, as amended. Later, on September 17, 2009, the Department of State designated RS as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result, all of RS’s property, and interests in property, subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with RS. It is a crime to knowingly provide, or to attempt or conspire to provide, material support or resources to RS."}, {"Page_url": "https://rewardsforjustice.net/rewards/tehrik-e-taliban-pakistan-ttp/", "Title": "Tehrik-e Taliban Pakistan (TTP) – Rewards For Justice", "Reward_amount": null, "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/ttp.png", "date_of_birth": null, "associated_organisation": null, "associated_location": "", "about": "Tehrik-e Taliban Pakistan (TTP) is a Pakistan and Afghanistan-based terrorist organization formed in 2007. TTP aims to push the Pakistani government out of Khyber Pakhtunkwa province (formally known as the Federally Administered Tribal Areas) and establish Sharia law through acts of terrorism. TTP draws ideological guidance from al-Qa’ida (AQ), while elements of AQ rely in part on TTP for safe haven in areas along the Afghanistan-Pakistan border. This arrangement has given TTP access to both AQ’s global terrorist network and its members’ operational expertise.,TTP has carried out and claimed responsibility for numerous terrorist acts against Pakistani and U.S. interests, including the December 2009 suicide attack on a U.S. military base in Khost, Afghanistan that killed seven U.S. citizens, as well as the April 2010 suicide bombing against the U.S. Consulate in Peshawar, Pakistan that killed six Pakistani citizens. TTP is suspected of involvement in the 2007 assassination of former Pakistani Prime Minister Benazir Bhutto. TTP directed and facilitated Faisal Shahzad’s failed attempt to detonate an explosive device in New York City’s Times Square on May 1, 2010.,On September 1, 2010, the U.S. Department of State designated TTP as a Foreign Terrorist Organization under section 219 of the Immigration and Nationality Act, as amended, and as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result, all of TTP’s property and interests in property subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with TTP. It is a crime to knowingly provide, or to attempt or conspire to provide, material support or resources to TTP."}, {"Page_url": "https://rewardsforjustice.net/rewards/abu-huzeifa/", "Title": "Abu Huzeifa – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/08/Abou-Houzeifa--229x300.jpg", "date_of_birth": null, "associated_organisation": "ISIS in the Greater Sahara (ISIS-GS)", "associated_location": "Burkina Faso , Mali , Niger", "about": "Rewards for Justice is offering a reward of up to $5 million for information on Abu Huzeifa, also known as Higgo, for his participation in the 2017 Tongo Tongo, Niger attack. Abu Huzeifa is an ISIS-Greater Sahara (ISIS-GS) commander.,On October 4, 2017, near the village of Tongo Tongo, Niger, ISIS-GS-linked militants attacked members of a U.S. Special Forces team tasked with training, advising, and assisting Nigerien forces in fighting terrorism. The attack resulted in the deaths of four U.S. and four Nigerien soldiers. Two additional Americans and eight Nigeriens were wounded in the encounter. On January 12, 2018, ISIS-GS leader Adnan Abu Walid al-Sahrawi claimed responsibility for the attack."}, {"Page_url": "https://rewardsforjustice.net/rewards/ibrahim-ousmane/", "Title": "Ibrahim Ousmane – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/08/Ibrahim-Ousmane-229x300.jpg", "date_of_birth": null, "associated_organisation": "ISIS in the Greater Sahara (ISIS-GS)", "associated_location": "Burkina Faso , Mali , Niger", "about": "Rewards for Justice is offering a reward of up to $5 million for information on Ibrahim Ousmane, also known as Dandou Cheffou, for his participation in the 2017 Tongo Tongo, Niger attack. Ibrahim Ousmane is an ISIS-Greater Sahara (ISIS-GS) commander.,On October 4, 2017, near the village of Tongo Tongo, Niger, ISIS-GS-linked militants attacked members of a U.S. Special Forces team tasked with training, advising, and assisting Nigerien forces in fighting terrorism. The attack resulted in the deaths of four U.S. and four Nigerien soldiers. Two additional Americans and eight Nigeriens were wounded in the encounter. On January 12, 2018, ISIS-GS leader Adnan Abu Walid al-Sahrawi claimed responsibility for the attack."}, {"Page_url": "https://rewardsforjustice.net/rewards/abdelbasit-alhaj-alhassan-haj-hamad/", "Title": "Abdelbasit Alhaj Alhassan Haj Hamad – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/10/Sub-Saharan-Africa_Abdelbasit_Alhaj_Alhassan_Haj_Hamad.jpg", "date_of_birth": "\n\t\t\t\t\t\t\t1979; 1983\t\t\t\t\t\t", "associated_organisation": null, "associated_location": "Somalia , Sudan", "about": "Rewards for Justice is offering a reward of up to $5 million for information on Abdelbasit Alhaj Alhassan Haj Hamad. Abdelbasit is wanted for his role as one of the gunmen in the murders of U.S. Agency for International Development (USAID) employees John Granville and Abdelrahman Abbas Rahama in Khartoum on January 1, 2008. ,A Sudanese court tried, convicted, and sentenced Abdelbasit to death in 2009 for his involvement in the murders. However, Abdelbasit escaped from prison on June 10, 2010, before his sentence could be carried out. He remains at large and is believed to be in Somalia.,On January 8, 2013, the U.S. Department of State designated Abdelbasit as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result of this designation, among other consequences, all property, and interests in property, of Abdelbasit that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with Abdelbasit."}, {"Page_url": "https://rewardsforjustice.net/rewards/wadoud-muhammad-hafiz-al-turki/", "Title": "Wadoud Muhammad Hafiz Al-Turki – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/10/Al-Turki-without-Beard-Final-217x300.jpg,https://rewardsforjustice.net/wp-content/uploads/2020/10/wadoud_al_turki.jpg", "date_of_birth": "\n\t\t\t\t\t\t\tJune 21, 1955\t\t\t\t\t\t", "associated_organisation": "Abu Nidal Organization (ANO)", "associated_location": "", "about": "Rewards for Justice is offering a reward of up to $5 million for information on Wadoud Muhammad Hafiz al-Turki, also known as Sliman Ali Ahmad el-Turki and Bou Baker Muhammad. Al-Turki, an alleged member of the Abu Nidal Organization terrorist group, is wanted for his role in the September 5, 1986 hijacking of Pan Am Flight 73 in Karachi, Pakistan. After holding 379 passengers and crew hostage for nearly 16 hours, the hijackers began shooting indiscriminately. Twenty people, including two Americans, were killed and more than 100 were injured.,For his role in the hijacking, al-Turki was indicted by a U.S. federal grand jury and is on the FBI’s Most Wanted Terrorists List. A heavy smoker who has worked as a civil engineer, al-Turki likely resides in the Middle East."}, {"Page_url": "https://rewardsforjustice.net/rewards/ahlam-ahmad-al-tamimi/", "Title": "Ahlam Ahmad al-Tamimi – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/11/Middle-East-and-North-Africa_Ahlam_Ahmad_al_Tamimi_Sbarros_Image-300x193.jpg,https://rewardsforjustice.net/wp-content/uploads/2020/11/Middle-East-and-North-Africa_Ahlam_Ahmad_al_Tamimi_Image_2-1-249x300.png,https://rewardsforjustice.net/wp-content/uploads/2021/03/Tamimi-241x300.png", "date_of_birth": "\n\t\t\t\t\t\t\tOctober 20, 1980; November 20, 1980; January 1, 1980; January 20, 1980\t\t\t\t\t\t", "associated_organisation": "Harakat al-Muqawama al-Islamiya (HAMAS)", "associated_location": "Jordan", "about": "Rewards for Justice is offering a reward of up to $5 million for information on Ahlam Ahmad al-Tamimi, also known as “Khalti” and “Halati,” as part of its 1993 Violence in Opposition to the Middle East Peace Negotiations reward offer.,On August 9, 2001, al-Tamimi transported a bomb and a Hamas suicide bomber to a crowded Jerusalem Sbarro pizzeria, where the bomber detonated the explosives. The blast killed 15 people, including seven children. Americans Judith Shoshana Greenbaum, a pregnant 31-year-old school teacher, and 15-year-old Malka Chana Roth were among those killed. More than 120 others were injured, including four Americans. Hamas claimed responsibility for the bombing.,A former student working as a television journalist, al-Tamimi drove the bomber to the target after pledging to carry out attacks on behalf of Hamas’ military wing, the Izzedine al-Qassam Brigades, according to the FBI. Al-Tamimi, who planned and engineered the Sbarro attack, chose the location because it was a busy restaurant. To reduce suspicion, she and the suicide bomber dressed as Israelis, and she personally transported the bomb, concealed inside a guitar case, from a West Bank town into Jerusalem. Al-Tamimi also admitted to detonating a small improvised explosive device in a Jerusalem grocery store prior to the attack as a test run.,In 2003, al-Tamimi pleaded guilty in an Israeli court to participating in the attack and was sentenced to 16 life terms in Israel for assisting the bomber. She was released in October 2011 as part of a prisoner exchange between Hamas and Israel. On March 14, 2017, the U.S. Department of Justice unsealed a criminal complaint and an arrest warrant for al-Tamimi. The FBI also added al-Tamimi to its Most Wanted Terrorists List."}, {"Page_url": "https://rewardsforjustice.net/rewards/ahadon-adak/", "Title": "Ahadon Adak – Rewards For Justice", "Reward_amount": null, "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/11/East_Asia_and_Pacific_Ahadon_Adak_Image.jpg", "date_of_birth": null, "associated_organisation": "Moro National Liberation Front (MNLF)", "associated_location": "Philippines", "about": "Rewards for Justice is offering a reward of up to $250,000 for information on Ahadon Adak, a commander in the Moro National Liberation Front (MNLF). ,On September 29, 2009, on Jolo Island, Philippines, an MNLF-placed explosive device blew up a convoy of military vehicles. The blast killed two U.S. Army soldiers and an Armed Forces of the Philippines soldier. The victims were part of a humanitarian mission to construct a school. On May 21, 2010, the Philippine 9th Judicial Region issued a warrant for Adak’s arrest in connection with the attack."}, {"Page_url": "https://rewardsforjustice.net/rewards/abu-ubaidah-direye/", "Title": "Abu Ubaidah (Diriye) – Rewards For Justice", "Reward_amount": "Up to $10 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/11/Sub_Saharan_Africa_Abu_Ubaidah_Image.jpg", "date_of_birth": "\n\t\t\t\t\t\t\t1972\t\t\t\t\t\t", "associated_organisation": "Al-Shabaab", "associated_location": "Somalia", "about": "Rewards for Justice is offering a reward of up to $10 million for information on Ahmed Diriye, also known as Ahmed Umar and Abu Ubaidah. Abu Ubaidah serves as the leader of al-Shabaab—a position he has occupied since the death of former al-Shabaab leader Ahmed Abdi Godane. Abu Ubaidah was part of Godane’s inner circle at the time of Godane’s death.,Prior to replacing Godane, Abu Ubaidah served in several positions within al-Shabaab, including as Godane’s assistant, the deputy governor of the Lower Juba region of Somalia in 2008, and al-Shabaab’s governor of the Bay and Bakool regions of Somalia in 2009. By 2013, he was a senior adviser to Godane, and served in al-Shabaab’s “Interior Department,” where he oversaw the group’s domestic activity. He shares Godane’s vision for al-Shabaab’s terrorist attacks in Somalia as an element of al-Qa’ida’s greater global aspirations.,On April 21, 2015, the U.S. Department of State designated Abu Ubaidah as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result of this designation, among other consequences, all property and interests in property of Abu Ubaidah that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with Abu Ubaidah. In addition, it is a crime to knowingly provide, or attempt or conspire to provide, material support or resources to al-Shabaab, a U.S.-designated Foreign Terrorist Organization."}, {"Page_url": "https://rewardsforjustice.net/rewards/abu-abd-al-karim-al-masri/", "Title": "Abu ‘Abd al-Karim al-Masri – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/11/abuthumbnail.jpg", "date_of_birth": null, "associated_organisation": "Al-Nusrah Front (ANF)", "associated_location": "", "about": "Rewards for Justice is offering a reward of up to $5 million for information on Abu ‘Abd al-Karim al-Masri, also known as Karim. Al-Masri is a veteran member of al-Qa’ida (AQ) and a senior leader of Hurras al-Din (HAD), an AQ-affiliated jihadist group. In 2018, al-Masri was a member of HAD’s shura council, the group’s senior decision-making body, and served as a mediator between HAD and Hay’at Tahrir al-Sham, an AQ-linked umbrella group from which HAD had broken away."}, {"Page_url": "https://rewardsforjustice.net/rewards/abdullahi-yare/", "Title": "Abdullahi Yare – Rewards For Justice", "Reward_amount": "Up to $3 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/11/Sub-Saharan_Africa_Abdullahi_Yare_Image.jpg", "date_of_birth": null, "associated_organisation": "Al-Shabaab", "associated_location": "", "about": "Rewards for Justice is offering a reward of up to $3 million for information on Abdullahi Yare, also known as Abdullahi Yarisow and Ubeyd. Yare plays a prominent religious role within al-Shabaab, a U.S.-designated Foreign Terrorist Organization. Previously, Yare served as al-Shabaab’s head of media."}, {"Page_url": "https://rewardsforjustice.net/rewards/abdullah-nowbahar/", "Title": "Abdullah Nowbahar – Rewards For Justice", "Reward_amount": "Up to $2 million ", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/11/South_and_Central_Asia_Abdullah_Nowbahar_Image.jpg", "date_of_birth": "\n\t\t\t\t\t\t\t1984 to 1986\t\t\t\t\t\t", "associated_organisation": null, "associated_location": "Afghanistan", "about": "Rewards for Justice is offering a reward of up to $2 million for information on Abdullah Nowbahar. Nowbahar is an explosives expert associated with Hezb-e Islami Gulbuddin (HIG) and is a member of HIG bombmaker Abdul Saboor’s attack network. Nowbahar and Saboor were key participants in the September 18, 2012 car bomb attack against a bus carrying foreign employees of Kabul International Airport in Afghanistan. The blast killed 12 people.,On March 10, 2016, The U.S. Department of State designated Nowbahar as a Specially Designated Global Terrorist pursuant to Executive Order 13224. As a result of this designation, among other consequences, all property and interests in property of Nowbahar that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with Nowbahar."}, {"Page_url": "https://rewardsforjustice.net/rewards/abdul-wali/", "Title": "Abdul Wali – Rewards For Justice", "Reward_amount": "Up to $3 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/03/abdul_wali.jpeg", "date_of_birth": null, "associated_organisation": "Jamaat-ul-Ahrar (JuA)", "associated_location": "Pakistan", "about": "Rewards for Justice is offering a reward of up to $3 million for information on Abdul Wali, also known as Omar Khalid Khorasani. Wali is the leader of Jamaat ul-Ahrar (JuA), a militant faction affiliated with Tehrik-e Taliban Pakistan (TTP), a U.S.-designated Foreign Terrorist Organization. Under Wali’s leadership, JuA has been one of the most operationally active TTP networks in Punjab Province, Pakistan and has claimed responsibility for multiple attacks throughout Pakistan.,Wali reportedly operates from Afghanistan’s Nangarhar and Kunar Provinces. Wali was born in Mohmand Agency, Pakistan. He is a former journalist and poet and studied at several madrasas in Karachi, Pakistan."}, {"Page_url": "https://rewardsforjustice.net/rewards/abdul-saboor/", "Title": "Abdul Saboor – Rewards For Justice", "Reward_amount": "Up to $3 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/10/South-and-Central-Asia_Abdul_Saboor_Image.jpg", "date_of_birth": "\n\t\t\t\t\t\t\t1986\t\t\t\t\t\t", "associated_organisation": null, "associated_location": "", "about": "Rewards for Justice is offering a reward of up to $3 million for information on Abdul Saboor. Saboor is an explosives expert associated with Hezb-e Islami Gulbuddin (HIG). He is responsible for the May 16, 2013 suicide vehicle-borne improvised explosive device (SVBIED) attack in Kabul, Afghanistan. The attack killed two U.S. soldiers and four U.S. contractors. The blast also killed eight Afghans — including two children, injured 37 others, and destroyed a U.S. armored vehicle.,Saboor and HIG explosives expert Abdullah Nowbahar were key participants in the September 18, 2012 SVBIED attack against a bus transporting foreign employees of Kabul International Airport in Afghanistan. The blast killed 12 people.,On March 10, 2016, the U.S. Department of State designated Saboor as a Specially Designated Global Terrorist pursuant to Executive Order 13224. As a result of this designation, among other consequences, all property and interests in property of Saboor that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with Saboor."}, {"Page_url": "https://rewardsforjustice.net/rewards/abdul-rahman-yasin/", "Title": "Abdul Rahman Yasin – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/10/Middle-East-and-North-Africa_Abdul_Rahman_Yasin_Image_1.jpg,https://rewardsforjustice.net/wp-content/uploads/2020/10/abdul_yasin2_sm.jpg", "date_of_birth": "\n\t\t\t\t\t\t\tApril 10, 1960\t\t\t\t\t\t", "associated_organisation": "Al-Qa’ida (AQ)", "associated_location": "", "about": "Rewards for Justice is offering a reward of up to $5 million for information on Abdul Rahman Yasin, also known as Abdul Rahman Said Yasin and Aboud Yasin. Yasin directly assisted terrorist mastermind Ramzi Yousef in carrying out the February 1993 World Trade Center bombing in New York City.,On February 26, 1993, Yasin accompanied Yousef to the World Trade Center in a truck full of explosives, which they left in the Center’s underground parking lot. Upon detonation, the blast killed six people, wounded more than 1,000 others, and caused hundreds of millions of dollars in damages. Yasin fled the United States for Iraq to avoid capture. For his participation in the attack, Yasin was indicted on numerous charges in the United States.,Yasin was born in the United States, moved to Iraq during the 1960s, and returned to the United States in 1992. He possesses a U.S. passport. He is on the FBI’s Most Wanted Terrorists List."}, {"Page_url": "https://rewardsforjustice.net/rewards/abdikadir-mohamed-abdikadir/", "Title": "Abdikadir Mohamed Abdikadir – Rewards For Justice", "Reward_amount": "Up to $3 million ", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/10/Sub-Saharan-Africa_Abdikadir_Mohamed_Abdikadir_Image.jpg", "date_of_birth": "\n\t\t\t\t\t\t\t1979; 1985\t\t\t\t\t\t", "associated_organisation": "Al-Shabaab", "associated_location": "Somalia", "about": "Rewards for Justice is offering a reward of up to $3 million for information on Abdikadir Mohamed Abdikadir, also known as Ikrima.  Abdikadir is an al-Shabaab senior leader and has served as the Head of Operations and Logistics. Abdikadir also has directed previous attack planning for al-Shabaab. He has coordinated the recruitment of Kenyan youth into al-Shabaab and commanded a force of al-Shabaab’s Kenyan fighters in Somalia.,On August 6, 2021, the U.S. Department of State designated Abdikadir as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result of this designation, among other consequences, all property, and interests in property, of Abdikadir that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with Abdikadir. In addition, it is a crime to knowingly provide, or attempt or conspire to provide, material support or resources to al-Shabaab, a U.S.-designated Foreign Terrorist Organization."}, {"Page_url": "https://rewardsforjustice.net/rewards/abdelkarim-hussein-mohamed-al-nasser/", "Title": "Abdelkarim Hussein Mohamed al-Nasser – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/10/Middle_East_and_North_Africa_Abdelkarim_Hussein_Mohamed_al_Nasser_Image.jpg", "date_of_birth": null, "associated_organisation": "Saudi Hizballah", "associated_location": "", "about": "Rewards for Justice is offering a reward of up to $5 million for information on Abdelkarim Hussein Mohamed al-Nasser. Al-Nasser, an alleged leader of the Saudi Hizballah terrorist organization, is wanted for his role in the 1996 bombing of Khobar Towers near Dhahran, Saudi Arabia.,On June 25, 1996, members of Saudi Hizballah detonated a tanker truck containing plastic explosives in the parking lot of Khobar Towers, a residential complex used to house U.S. military personnel. The blast all but destroyed the nearest building, killed 19 U.S. service members and one Saudi citizen, and wounded hundreds of individuals from various nations.,On June 21, 2001, a U.S. federal grand jury indicted al-Nasser and 13 other individuals connected to the attack.,On October 12, 2001, the U.S. Department of State designated al-Nasser as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result of this designation, among other consequences, all property, and interests in property, of al-Nasser that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with al-Nasser. He also is on the FBI’s Most Wanted Terrorists List."}, {"Page_url": "https://rewardsforjustice.net/rewards/abderraouf-ben-habib-jdey/", "Title": "Abderraouf Ben Habib Jdey – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/10/Middle_East_and_North_Africa_Abderraouf_Ben_Habib_Jdey_Image_3.jpg,https://rewardsforjustice.net/wp-content/uploads/2020/10/Middle_East_and_North_Africa_Abderraouf_Ben_Habib_Jdey_Image_2.jpg", "date_of_birth": "\n\t\t\t\t\t\t\tMay 30, 1965\t\t\t\t\t\t", "associated_organisation": "Al-Qa’ida (AQ)", "associated_location": "", "about": "Rewards for Justice is offering a reward of up to $5 million for information on Abderraouf Ben Habib Jdey, also known as Farouq al-Tunisi. Jdey has been closely linked to al-Qa’ida (AQ) operatives and involved in plans to hijack airliners and other terrorist operations. Jdey is an associate of terrorist suspect Faker Ben Abdelaziz Boussora, and the two may have traveled together.,Jdey was born in Tunisia in 1965. He emigrated to Montreal, Canada in 1991 and became a Canadian citizen in 1995. In 1999, Jdey left Canada for Afghanistan, where he received terrorist training and combat experience. He fought against the Afghan Northern Alliance and authored a letter stating his intention to become a martyr for jihad. During this time, he also appeared in a martyrdom video found in an AQ leader’s house in 2001.,Jdey returned to the Montreal area in 2001. After consorting with other extremists about joining the jihad, he left Canada. Authorities are concerned that he may return to Canada or the United States to plan or participate in an attack."}, {"Page_url": "https://rewardsforjustice.net/rewards/ali-atwa/", "Title": "Ali Atwa – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/11/Middle-East-and-North-Africa_Ali_Atwa_Image.jpg", "date_of_birth": "\n\t\t\t\t\t\t\tApproximately 1960\t\t\t\t\t\t", "associated_organisation": "Hizballah", "associated_location": "Lebanon", "about": "Rewards for Justice is offering a reward of up to $5 million for information on Ali Atwa, also known as Ammar Mansour Bouslim and Hassan Rostom Salim. Atwa, an alleged member of Hizballah, is wanted for his role in the 1985 hijacking of TWA Flight 847. ,On June 14, 1985, terrorists hijacked TWA Flight 847 during a flight from Athens to Rome. Over 17 days, the plane was forced to crisscross the Mediterranean with 153 passengers and crew members, from Beirut to Algiers and back again, landing in Beirut three times. During the first stop in Beirut, the hijackers severely beat, and then shot and killed, U.S. Navy diver Robert Stethem.,On November 14, 1985, Atwa was indicted for his role and participation in the hijacking. On October 12, 2001, the U.S. Department of State designated Atwa as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result of this designation, among other consequences, all property and interests in property of Atwa that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with Atwa. In addition, it is a crime to knowingly provide, or attempt or conspire to provide, material support or resources to Hizballah, a U.S.-designated Foreign Terrorist Organization. Atwa is on the FBI’s Most Wanted Terrorists List. He is believed to be in Lebanon."}, {"Page_url": "https://rewardsforjustice.net/rewards/ahmed-iman-ali/", "Title": "Ahmed Iman Ali – Rewards For Justice", "Reward_amount": "Up to $3 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/11/Sub-Saharan-Africa_Ahmed_Iman_Ali_Image.jpg", "date_of_birth": "\n\t\t\t\t\t\t\t1972 to 1975\t\t\t\t\t\t", "associated_organisation": "Al-Shabaab", "associated_location": "Kenya , Somalia", "about": "Rewards for Justice is offering a reward of up to $3 million for information on Ahmed Iman Ali. Ali is a prominent commander of al-Shabaab, a U.S.-designated Foreign Terrorist Organization (FTO), who has served as the group’s leader in Kenya since 2012. He directs the group’s anti-Kenyan operations, which have targeted Kenyan African Union Mission in Somalia (AMISOM) troops in Somalia. One such attack in January 2016 in El Adde, Somalia, routed an entire garrison from a military base and left more than 140 Kenyan AMISOM troops dead.,Ali is also responsible for al-Shabaab propaganda targeting the Kenyan government and civilians, such as a July 2017 video in which he threatened Muslims serving in Kenya’s security forces. Ali has also served as an al-Shabaab recruiter, focusing on poor youth in Nairobi, and has raised funds at mosques to support al-Shabaab’s activities.,On March 8, 2018, the U.S. Department of State designated Ali as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result of this designation, among other consequences, all property and interests in property of Ali that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with Ali. In addition, it is a crime to knowingly provide, or attempt or conspire to provide material support or resources to the FTO al-Shabaab."}, {"Page_url": "https://rewardsforjustice.net/rewards/faker-ben-abdelaziz-boussora/", "Title": "Faker Ben Abdelaziz Boussora – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/11/Middle-East-and-North-Africa_Faker_Ben_Abdelaziz_Boussora_Image.jpg", "date_of_birth": "\n\t\t\t\t\t\t\tMarch 22, 1964\t\t\t\t\t\t", "associated_organisation": "Al-Qa’ida (AQ)", "associated_location": "", "about": "Rewards for Justice is offering a reward of up to $5 million for information on Faker Ben Abdelaziz Boussora, also known as Abu Yusif al-Tunisi or Fakeroun. Boussoura is an al-Qaida (AQ)-trained operative with declared intentions of becoming a suicide bomber. He has extensive connections to radical Islamic extremists and is an associate of Tunisian AQ terror suspect ,.,Boussora left his native Tunisia in 1988 and moved to France. He departed France in 1991 and immigrated to Montreal, Canada, traveling back and forth from Canada to Tunisia frequently during the 1990s. Boussora gained Canadian citizenship in 1999. That same year, Boussora departed Canada for Afghanistan, where he received terrorist training from AQ. Boussora subsequently returned to Canada. His whereabouts are currently unknown.,Authorities remain concerned that Boussora may return to Canada or the United States to plan or participate in a terrorist attack. He may suffer from a serious illness and could be in extremely poor health, resulting in weight loss and altered physical appearance."}, {"Page_url": "https://rewardsforjustice.net/rewards/ahmad-ibrahim-al-mughassil/", "Title": "Ahmad Ibrahim al-Mughassil – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/11/Middle-East-and-North-Africa_Ahmad_Ibrahim_il_Mughassil_Image.jpg", "date_of_birth": "\n\t\t\t\t\t\t\tJune 26, 1967\t\t\t\t\t\t", "associated_organisation": "Saudi Hizballah", "associated_location": "", "about": "Rewards for Justice is offering a reward of up to $5 million for information on Ahmad Ibrahim al-Mughassil, also known as Abu Omran. Al-Mughassil, the alleged head of the terrorist organization Saudi Hizballah’s military wing, is wanted for his role in the 1996 bombing of Khobar Towers near Dhahran, Saudi Arabia.,On June 25, 1996, members of Saudi Hizballah detonated a tanker truck containing plastic explosives in the parking lot of Khobar Towers, a residential complex used to house U.S. military personnel. The blast all but destroyed the nearest building, killed 19 U.S. service members and one Saudi citizen and wounded hundreds of individuals from various nations.,On June 21, 2001, a U.S. federal grand jury indicted al-Mughassil and 13 other individuals connected to the attack.,On October 12, 2001, the U.S. Department of State designated al-Mughassil as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result of this designation, among other consequences, all property and interests in property of al-Mughassil that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with al-Mughassil. He is on the FBI’s Most Wanted Terrorists List."}, {"Page_url": "https://rewardsforjustice.net/rewards/sayf-al-adl/", "Title": "Sayf al-Adl – Rewards For Justice", "Reward_amount": "Up to $10 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/03/saif_al_adel.jpeg", "date_of_birth": "\n\t\t\t\t\t\t\tApril 11, 1963; April 11, 1960\t\t\t\t\t\t", "associated_organisation": "Al-Qa’ida (AQ)", "associated_location": "Iran", "about": "Rewards for Justice is offering a reward of up to $10 million for information on Sayf al-Adl. Al-Adl is an Iran-based al-Qa’ida (AQ) senior leader and a member of AQ’s senior leadership council, the Majlis al-Shura. Al-Adl also heads AQ’s military committee.,Al-Adl was indicted and charged by a U.S. federal grand jury in November 1998 for his role in the August 7, 1998 bombings of the U.S. embassies in Dar es Salaam, Tanzania, and Nairobi, Kenya. The attacks killed 224 civilians and wounded more than 5,000 others.,After the 1998 U.S. Embassy bombings, al-Adl moved to southeastern Iran and lived under the protection of Iran’s Islamic Revolutionary Guard Corps. In April 2003, Iranian authorities placed him and other AQ leaders under house arrest.,In September 2015, al-Adl and four other senior AQ leaders were released from Iranian custody in exchange for an Iranian diplomat kidnapped by AQ in Yemen.,Al-Adl was a senior lieutenant to Abu Musab al-Zarqawi, founder of AQ in Iraq, which later became the Islamic State of Iraq and Syria (ISIS).,As early as 1990, al-Adl and other AQ operatives provided military and intelligence training in various countries, including Afghanistan, Pakistan, and Sudan, to members of AQ and its affiliated groups, including the Egyptian Islamic Jihad.,In 1992 and 1993, he provided military training to AQ operatives and Somali tribesmen who fought against U.S. forces in Mogadishu during Operation Restore Hope.,As a lieutenant colonel in Egypt’s special forces in the mid-1980s, he became involved in efforts to overthrow the Egyptian government. In 1987, he was arrested along with thousands of other anti-government militants after an assassination attempt against the Egyptian Interior Minister. Authorities released and then demoted al-Adl, who in 1989 traveled to Afghanistan where he became a trainer for the nascent AQ.,On September 23, 2001, al-Adl was listed in the Annex to Executive Order 13224, and consequently, he is subject to sanctions under it as a Specially Designated Global Terrorist. As a result of this designation, among other consequences, all property and interests in property of al-Adl that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with al-Adl. In addition, it is a crime to knowingly provide, or attempt or conspire to provide material support or resources to the FTO AQ. Al-Adl is on the FBI’s Most Wanted Terrorists List."}, {"Page_url": "https://rewardsforjustice.net/rewards/radullan-sahiron/", "Title": "Radullan Sahiron – Rewards For Justice", "Reward_amount": "Up to $1 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/11/East_Asia_and_Pacific_Radullan_Sahiron_Image.jpg", "date_of_birth": "\n\t\t\t\t\t\t\t1955; circa 1952\t\t\t\t\t\t", "associated_organisation": "Abu Sayyaf Group (ASG)", "associated_location": "Philippines", "about": "Rewards for Justice is offering a reward of up to $1 million for information on Radullan Sahiron, also known as Commander Putol. Since 2005, Sahiron has been the overall leader of the Philippines-based Abu Sayyaf Group (ASG), a U.S.-designated Foreign Terrorist Organization (FTO).,Sahiron has perpetrated several acts of terrorism involving bombings of civilians and kidnappings of U.S. and foreign nationals.,– Sahiron ordered bombings on Jolo Island in 2004, killing 11 Filipino civilians and a U.S. serviceman and wounding more than 200 others. The improvised explosive devices used in the bombings were initially assembled at Sahiron’s headquarters, Camp Tubig Tuh-Tuh, on Jolo Island, Philippines.,– Sahiron played a role in the May 2001 Dos Palmas kidnapping of three U.S. citizens and 17 Filipinos from a tourist resort in Palawan, Philippines. Several of the hostages, including U.S. citizen Guillermo Sobero, were murdered.,– Sahiron was considered the key leader of the April 2000 kidnapping from a resort in Sipadan, Malaysia. Sahiron and four other ASG members abducted 21 foreign tourists and resort employees, including Westerners, Malaysians, and Filipinos.,Sahiron has held several senior positions within the ASG. As early as 1999, he was one of 14 members of the ASG’s Majlis Shura (consultative council). In mid-2002, he served as an advisor to ASG leader Khadaffy Janjalani.  Additionally, Sahiron has held several leadership positions over ASG fighters in the Sulu Archipelago area of the southern Philippines.,From 2000 through 2003, Sahiron held various ASG leadership roles, including as the leader of the ASG’s Putol group, composed of an estimated 100 members operating on Jolo Island in the Sulu area of the southern Philippines; as the head of the Sulu-based ASG consisting of 18 armed groups; as the ASG Chief of Staff in Sulu; and as the overall ASG commander on Jolo Island with an estimated 1,000 fully-armed followers.,Sahiron may be hiding in southern Mindanao or Patikul Jolo, Sulu, Philippines.,On February 27, 2007, Sahiron was indicted in U.S. federal court and charged with hostage taking. U.S. authorities issued an arrest warrant for him on the same date. Sahiron is on the FBI’s Most Wanted Terrorists List.,On November 30, 2005, the U.S. Department of the Treasury designated Sahiron as a Specially Designated Global Terrorist under Executive Order 13224. As a result of this designation, among other consequences, all property and interests in property of Sahiron that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with Sahiron. In addition, it is a crime to knowingly provide, or attempt or conspire to provide, material support or resources to the FTO ASG."}, {"Page_url": "https://rewardsforjustice.net/rewards/fuad-shukr/", "Title": "Fuad Shukr – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/03/fuad_shukr.jpeg", "date_of_birth": "\n\t\t\t\t\t\t\tApril 15, 1961; 1962\t\t\t\t\t\t", "associated_organisation": "Hizballah", "associated_location": "Lebanon , Syria", "about": "Rewards for Justice is offering a reward of up to $5 million for information on Fuad Shukr, also known as al-Hajj Mohsin. Shukr is a senior advisor on military affairs to Hasan Nasrallah, secretary-general of the U.S.-designated Foreign Terrorist Organization (FTO) Hizballah. Shukr serves on Hizballah’s highest military body, the Jihad Council, and has aided Hizballah fighters and pro-Syrian regime troops in Hizballah’s military campaign against Syrian opposition forces in Syria.,Shukr was a close associate of now-deceased Hizballah commander Imad Mughniyah. Shukr played a central role in the October 23, 1983 bombing of the U.S. Marine Corps Barracks in Beirut which killed 241 U.S. military personnel and wounded 128 others.,On September 10, 2019, the U.S. Department of State designated Shukr as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. Previously, on July 21, 2015, the U.S. Department of the Treasury designated Shukr pursuant to Executive Order 13582 for acting for or on behalf of Hizballah. As a result of these designations, among other consequences, all property and interests in property of Shukr that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with Shukr. In addition, it is a crime to knowingly provide, or attempt or conspire to provide, material support or resources to FTO Hizballah."}, {"Page_url": "https://rewardsforjustice.net/rewards/murat-karayilan/", "Title": "Murat Karayilan – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/03/Karayilan.jpeg", "date_of_birth": "\n\t\t\t\t\t\t\tJune 5, 1954; 1950; 1956\t\t\t\t\t\t", "associated_organisation": "Kurdistan Workers Party (PKK)", "associated_location": "Turkey", "about": "Rewards for Justice is offering a reward of up to $5 million for information on Murat Karayilan, also known as Cemal. Karayilan is a senior leader within the Kurdistan Workers Party (PKK) and the head of the PKK’s People’s Defense Forces, the group’s military wing. The PKK is a U.S.-designated Foreign Terrorist Organization.,On October 14, 2009, the U.S. Department of the Treasury designated Karayilan as a Significant Foreign Narcotics Trafficker pursuant to the Foreign Narcotics Kingpin Designation Act (Kingpin Act). As a result of this designation, any assets Karayilan has under U.S. jurisdiction are frozen, and U.S. persons are prohibited from conducting financial or commercial transactions with Karayilan. "}, {"Page_url": "https://rewardsforjustice.net/rewards/fuad-mohamed-khalaf/", "Title": "Fuad Mohamed Khalaf – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/11/Sub-Saharan-Africa_Fuad_Mohamed_Khalaf_Image.jpg", "date_of_birth": null, "associated_organisation": "Al-Shabaab", "associated_location": "Somalia", "about": "Rewards for Justice is offering a reward of up to $5 million for information on Fuad Mohamed Khalaf, also known as Fuad Shongale. Khalaf is a leader of al-Shabaab and has facilitated financial support for this U.S.-designated Foreign Terrorist Organization (FTO).,In April 2008, Khalaf and several other individuals directed vehicle-borne explosive device attacks on Ethiopian bases and Transitional Federal Government elements in Mogadishu, Somalia. In May 2008, Khalaf and a group of fighters attacked and captured a police station in Mogadishu, killing and wounding several soldiers. That same month, Khalaf held two fundraising events for al-Shabaab at mosques in Kismaayo, Somalia.,On April 13, 2010, the U.S. Department of the Treasury designated Khalaf as a Specially Designated National pursuant to Executive Order 13536 for contributing to the violence and deterioration of security in Somalia. As a result of this designation, among other consequences, all property and interests in property of Khalaf that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with Khalaf. In addition, it is a crime to knowingly provide, or attempt or conspire to provide, material support to al-Shabaab, a designated FTO."}, {"Page_url": "https://rewardsforjustice.net/rewards/faruq-al-suri/", "Title": "Faruq al-Suri – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/03/AlSurithumbnail-1.jpeg", "date_of_birth": "\n\t\t\t\t\t\t\t1977\t\t\t\t\t\t", "associated_organisation": "Al-Nusrah Front (ANF)", "associated_location": "Syria", "about": "Rewards for Justice is offering a reward of up to $5 million for information on Faruq al-Suri, also known as Samir Hijazi or Abu Hammam al-Shami. Al-Suri is the leader of the terrorist organization Hurras al-Din (HAD) and a veteran member of al-Qa’ida (AQ).,Al-Suri was a senior paramilitary trainer with AQ senior leader Sayf al-Adl in Afghanistan in the 1990s, and he also trained AQ fighters in Iraq from 2003 to 2005. Al-Suri was previously detained in Lebanon from 2009 to 2013 and later became the military commander of the al-Nusrah Front (ANF). He left ANF in 2016.,On September 10, 2019, the U.S. Department of State designated al-Suri as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result of this designation, among other consequences, all property and interests in property of al-Suri that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with al-Suri."}, {"Page_url": "https://rewardsforjustice.net/rewards/duran-kalkan/", "Title": "Duran Kalkan – Rewards For Justice", "Reward_amount": "Up to $3 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/03/duran-kalkan.jpeg", "date_of_birth": "\n\t\t\t\t\t\t\t1954, 1958\t\t\t\t\t\t", "associated_organisation": "Kurdistan Workers Party (PKK)", "associated_location": "Turkey", "about": "Rewards for Justice is offering a reward of up to $3 million for information on Duran Kalkan, a senior leader of the Kurdistan Workers Party (PKK), also known as the Kongra-Gel. The PKK is a U.S.-designated Foreign Terrorist Organization (FTO). Kalkan is an Executive Committee Member of the PKK and was responsible for an attack that killed seven Turkish soldiers in December 2009.,The U.S. Department of the Treasury designated Kalkan as a Specially Designated Narcotics Trafficker (SDNK) pursuant to the Foreign Narcotics Kingpin Designation Act (Kingpin Act) on April 20, 2011."}, {"Page_url": "https://rewardsforjustice.net/rewards/cemil-bayik/", "Title": "Cemil Bayik – Rewards For Justice", "Reward_amount": "Up to $4 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/03/cemil-bayik.jpeg", "date_of_birth": "\n\t\t\t\t\t\t\tFebruary 26, 1955; 1954; 1951\t\t\t\t\t\t", "associated_organisation": "Kurdistan Workers Party (PKK)", "associated_location": "Turkey", "about": "Rewards for Justice is offering a reward of up to $4 million for information on Cemil Bayik. Bayik is an Executive Committee Member, senior leader, and founding member of the Kurdistan Workers Party (PKK), also known as the Kongra-Gel. The PKK is a U.S.-designated Foreign Terrorist Organization (FTO).,The U.S. Department of the Treasury designated Bayik as a Specially Designated Narcotics Trafficker (SDNK) pursuant to the Foreign Narcotics Kingpin Designation Act (Kingpin Act) on April 20, 2011."}, {"Page_url": "https://rewardsforjustice.net/rewards/aziz-haqqani/", "Title": "Aziz Haqqani – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/11/Middle-East-and-North-Africa_Aziz_Haqqani_Image.jpg", "date_of_birth": "\n\t\t\t\t\t\t\t1987 to 1989\t\t\t\t\t\t", "associated_organisation": "Haqqani Network (HQN)", "associated_location": "Afghanistan , Pakistan", "about": "Rewards for Justice is offering a reward of up to $5 million for information on Aziz Haqqani, also known as Abdul Aziz Haqqani. Aziz is a key leader of the Haqqani Network (HQN), a U.S.-designated Foreign Terrorist Organization (FTO), and brother to HQN leader and Taliban deputy leader ,. ,Aziz has been involved in planning and carrying out improvised explosive device attacks against Afghan government targets, and assumed responsibility for all major HQN attacks after the death of his brother, Badruddin Haqqani. Aziz has been intimately involved in logistical operations and command decisions in HQN attacks against Afghan and Coalition forces along the Afghanistan-Pakistan border. Furthermore, he has served as the primary HQN conduit for operations in Kabul and high-profile attacks throughout Afghanistan.,On August 25, 2015, the U.S. Department of State designated Aziz Haqqani as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result of this designation, among other consequences, all property and interests in property of Aziz Haqqani that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with Aziz Haqqani. In addition, it is a crime to knowingly provide, or attempt or conspire to provide material support or resources to the FTO HQN."}, {"Page_url": "https://rewardsforjustice.net/rewards/ali-saed-bin-ali-el-hoorie/", "Title": "Ali Saed bin Ali el-Hoorie – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/11/Middle-East-and-North-Africa_Ali_Saed-bin_Ali_el_Hoorie_Image.jpg", "date_of_birth": "\n\t\t\t\t\t\t\tJuly 10, 1965; July 11, 1965\t\t\t\t\t\t", "associated_organisation": "Saudi Hizballah", "associated_location": "", "about": "Rewards for Justice is offering a reward of up to $5 million for information on Ali Saed bin Ali el-Hoorie, also known as Ali Saed bin Ali al-Houri. El-Hoorie, an alleged member of the Saudi Hizballah terrorist organization, is wanted for his role in the 1996 bombing of Khobar Towers near Dhahran, Saudi Arabia.,On June 25, 1996, members of Saudi Hizballah detonated a tanker truck containing plastic explosives in the parking lot of Khobar Towers, a residential complex used to house U.S. military personnel. The blast all but destroyed the nearest building, killed 19 U.S. service members and one Saudi citizen, and wounded hundreds of individuals from various nations.,On June 21, 2001, a U.S. federal grand jury indicted el-Hoorie and 13 other individuals connected to the attack.,On October 12, 2001, the U.S. Department of State designated el-Hoorie as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result of this designation, among other consequences, all property, and interests in property, of el-Hoorie that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with el-Hoorie. He is on the FBI’s Most Wanted Terrorists List."}, {"Page_url": "https://rewardsforjustice.net/rewards/hafiz-saeed/", "Title": "Hafiz Saeed – Rewards For Justice", "Reward_amount": "Up to $10 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/11/hafiz_saeed-1.jpg", "date_of_birth": "\n\t\t\t\t\t\t\tJune 5, 1950\t\t\t\t\t\t", "associated_organisation": "Lashkar-e Tayyiba (LeT)", "associated_location": "Pakistan", "about": "Rewards for Justice is offering a reward of up to $10 million for information on Hafiz Saeed, the founder and leader of Lashkar-e Tayyiba (LeT), a U.S.-designated Foreign Terrorist Organization (FTO). Saeed participated in the planning of the 4-day-long terrorist assault on Mumbai, India in November 2008 that left 166 individuals dead, including six Americans.,In 2020, a Pakistani anti-terrorism court convicted Saeed on multiple counts of terrorism financing and sentenced him to prison. The United States continues to seek information on Saeed because the Pakistani judicial system has released convicted LeT leaders and operatives in the past. ,On May 27, 2008, the U.S. Department of the Treasury designated Saeed as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result of this designation, among other consequences, all property, and interests in property, of Saeed that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with Saeed. In addition, it is a crime to knowingly provide, or attempt or conspire to provide, material support or resources to the FTO LeT. On December 10, 2008, Saeed was listed at the United Nations 1267/1989 al-Qa’ida Sanctions Committee as an individual associated with the al-Qa’ida terrorist organization and, thus, subject to international sanctions."}, {"Page_url": "https://rewardsforjustice.net/rewards/hafiz-abdul-rahman-makki/", "Title": "Hafiz Abdul Rahman Makki – Rewards For Justice", "Reward_amount": "Up to $2 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/11/hafiz_makki.jpg", "date_of_birth": "\n\t\t\t\t\t\t\tDecember 10, 1954; 1948\t\t\t\t\t\t", "associated_organisation": "Lashkar-e Tayyiba (LeT)", "associated_location": "Pakistan", "about": "Rewards for Justice is offering a reward of up to $2 million for information on Hafiz Abdul Rahman Makki, also known as Abdulrahman Maki. Makki has occupied various leadership roles within Lashkar-e-Tayyiba (LeT), a U.S.-designated Foreign Terrorist Organization (FTO). He has also played a role in raising funds for LeT operations. ,In 2020, a Pakistani anti-terrorism court convicted Makki on one count of terrorism financing and sentenced him to prison. The United States continues to seek information on Makki because the Pakistani judicial system has released convicted LeT leaders and operatives in the past. ,On November 4, 2010, the U.S. Department of the Treasury designated Makki as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result of this designation, among other consequences, all property, and interests in property, of Makki that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with Makki. In addition, it is a crime to knowingly provide, or attempt or conspire to provide, material support or resources to the FTO LeT."}, {"Page_url": "https://rewardsforjustice.net/rewards/ali-sayyid-muhamed-mustafa-al-bakri/", "Title": "Ali Sayyid Muhamed Mustafa al-Bakri – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/03/AAM_for-RFJ-217x300.png", "date_of_birth": "\n\t\t\t\t\t\t\tApril 18, 1966\t\t\t\t\t\t", "associated_organisation": "Al-Qa’ida (AQ)", "associated_location": "Iran", "about": "Rewards for Justice is offering a reward of up to $5 million for information on Ali Sayyid Muhamed Mustafa al-Bakri, also known as Abd al-Aziz al-Masri. Al-Bakri is a member of the al-Qai’da (AQ) shura council, the group’s decision-making body, and is a close associate of AQ leader Sayf al-Adl. Al-Bakri is an explosives and chemical weapons expert. ,Prior to joining AQ, al-Bakri was a member of the Egyptian Islamic Jihad terrorist group under the direction of al-Zawahiri. He served as an instructor in AQ camps in Afghanistan, training terrorist recruits in the use of explosives and chemical weapons. Al-Bakri also attempted to hijack a Pakistani Air passenger flight in December 2000. It is likely that he continues to train AQ terrorists and other extremists.,Al-Bakri is settled with his family in Iran.,On October 3, 2005, the U.S. Department of the Treasury designated al-Bakri as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result of this designation, among other consequences, all property and interests in property of al-Bakri that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with al-Bakri. In addition, it is a crime to knowingly provide, or attempt or conspire to provide, material support or resources to AQ, a U.S.-designated Foreign Terrorist Organization."}, {"Page_url": "https://rewardsforjustice.net/rewards/zerrin-sari/", "Title": "Zerrin Sari – Rewards For Justice", "Reward_amount": "Up to $3 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/11/zerrin_sari2_sm.jpg,https://rewardsforjustice.net/wp-content/uploads/2020/11/zerrin_sari3_sm.jpg,https://rewardsforjustice.net/wp-content/uploads/2021/03/zerrin_sari.jpeg", "date_of_birth": "\n\t\t\t\t\t\t\tSeptember 20, 1963; September 15, 1964\t\t\t\t\t\t", "associated_organisation": "Revolutionary People’s Liberation Party/Front (DHKP/C)", "associated_location": "Turkey", "about": "Rewards for Justice is offering a reward of up to $3 million for information on Zerrin Sari, also known as Fatma Gulten and Hale Melis. Sari is a key leader in the Revolutionary People’s Liberation Party/Front (DHKP/C), a U.S.-designated Foreign Terrorist Organization that has attacked Turkish government facilities and personnel as well as U.S. military and diplomatic facilities in Turkey since the 1990s. DHKP/C’s goal is to expel the U.S. and NATO presence from Turkey and establish a socialist state.,Although Sari was imprisoned for her activities, she was released in 2008 after the death of her husband, Dursun Karatas, a founding member of DHKP/C. She is believed to have played significant roles in the March 2013 attacks on the Justice and Development Party (AKP) headquarters and the Turkish Ministry of Justice in Ankara, which injured one person, and the September 20, 2013, attacks on Turkish police headquarters and a police housing complex in Ankara."}, {"Page_url": "https://rewardsforjustice.net/rewards/khalid-saeed-al-batarfi/", "Title": "Khalid Saeed al-Batarfi – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/11/Batarfi_thumbnail.jpg", "date_of_birth": "\n\t\t\t\t\t\t\t1978 to 1980\t\t\t\t\t\t", "associated_organisation": "Al-Qa’ida in the Arabian Peninsula (AQAP)", "associated_location": "Yemen", "about": "Rewards for Justice is offering a reward of up to $5 million for information on Khalid al-Batarfi, also known as Abu Miqdad and Abu al-Miqdad al-Kindi. Al-Batarfi became al-Qa’ida in the Arabian Peninsula’s (AQAP) emir in February 2020, following former AQAP leader Qasim al-Rimi’s death. Al-Batarfi had previously served as a religious judge and AQAP’s chief spokesperson.,After the United States announced that it would recognize Jerusalem as the capital of Israel, al-Batarfi appeared in an AQAP video in January 2018, threatening the United States and Jewish people. Following the death of AQAP leader Nasir al-Wuhayshi in a June 2016 U.S. military strike, al-Batarfi issued a statement warning that al-Qa’ida would destroy the U.S. economy and attack other U.S. interests. In April 2015, al-Batarfi was released from the Central Prison of al-Mukalla in Yemen when AQAP militants attacked the prison.,In 1999, he traveled to Afghanistan, where he trained at al-Qa’ida’s al-Farouq camp. In 2001, he fought alongside the Taliban against U.S. forces and the Northern Alliance. In 2010, al-Batarfi joined AQAP in Yemen, led AQAP fighters in taking over Yemen’s Abyan Province, and was named AQAP’s emir of Abyan.,On January 23, 2018, the U.S. Department of State designated al-Batarfi as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result of this designation, among other consequences, all property, and interests in property, of al-Batarfi that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with al-Batarfi. In addition, it is a crime to knowingly provide, or attempt or conspire to provide, material support or resources to AQAP, a U.S.-designated Foreign Terrorist Organization."}, {"Page_url": "https://rewardsforjustice.net/rewards/tahil-sali/", "Title": "Tahil Sali – Rewards For Justice", "Reward_amount": null, "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/03/Sali.jpeg", "date_of_birth": null, "associated_organisation": "Moro National Liberation Front (MNLF)", "associated_location": "Philippines", "about": "Rewards for Justice is offering a reward of up to $500,000 for information on Tahil Sali, a commander in the Moro National Liberation Front (MNLF), which has conducted terrorist attacks.  ,On September 29, 2009, an MNLF-placed explosive device blew up a convoy of military vehicles on Jolo Island, Philippines. The blast killed two U.S. Army soldiers and an Armed Forces of the Philippines soldier who were part of a humanitarian mission to construct a school in the area. On May 21, 2010, the Philippine 9th Judicial Region issued a warrant of arrest for Tahil Sali for his role in the attack."}, {"Page_url": "https://rewardsforjustice.net/rewards/seher-demir-sen/", "Title": "Seher Demir Sen – Rewards For Justice", "Reward_amount": "Up to $3 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/11/seher_demir_sen2_sm.jpg,https://rewardsforjustice.net/wp-content/uploads/2020/11/Europe_Seher_Demir_Sen_Image.jpg", "date_of_birth": "\n\t\t\t\t\t\t\tJuly 8, 1959; January 3, 1965\t\t\t\t\t\t", "associated_organisation": "Revolutionary People’s Liberation Party/Front (DHKP/C)", "associated_location": "Greece , Turkey", "about": "Rewards for Justice is offering a reward of up to $3 million for information on Seher Demir Sen, also known as Munever Koz or Alba, a key leader in the Revolutionary People’s Liberation Party/Front (DHKP/C), a U.S.-designated Foreign Terrorist Organization. The DHKP/C has conducted attacks against U.S. interests inside of Turkey.,Sen joined the Devrimci Sol (Dev Sol) organization in 1980 and remained a member until 1994 when she joined the DHKP/C after Dev Sol split apart. She rose to a prominent DHKP/C leadership position in Greece, reportedly serving as the head of the group’s office in Athens. Sen is a member of the DHKP/C Central Committee, the group’s top decision-making body."}, {"Page_url": "https://rewardsforjustice.net/rewards/jamal-saeed-abdul-rahim/", "Title": "Jamal Saeed Abdul Rahim – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/11/jamal_rahim.jpg,https://rewardsforjustice.net/wp-content/uploads/2020/11/Rahim-Final-222x300.jpg", "date_of_birth": "\n\t\t\t\t\t\t\tSeptember 5, 1965\t\t\t\t\t\t", "associated_organisation": "Abu Nidal Organization (ANO)", "associated_location": "", "about": "Rewards for Justice is offering a reward of up to $5 million for information on Jamal Saeed Abdul Rahim, also known as Ali Al Jassem Fahd and Ismael. Rahim, an alleged member of the Abu Nidal Organization terrorist group, is wanted for his role in the September 5, 1986 hijacking of Pan Am Flight 73 in Karachi, Pakistan. After holding 379 passengers and crew hostage for nearly 16 hours, the hijackers began shooting indiscriminately. Twenty people, including two Americans, were killed and more than 100 were injured.,For his role in the hijacking, Rahim was indicted by a U.S. federal grand jury and is on the FBI’s Most Wanted Terrorists List. Rahim likely resides in the Middle East."}, {"Page_url": "https://rewardsforjustice.net/rewards/jafar/", "Title": "Jafar – Rewards For Justice", "Reward_amount": "Up to $3 million", "image_urls": "", "date_of_birth": null, "associated_organisation": "Al-Shabaab", "associated_location": "Somalia", "about": "Rewards for Justice is offering a reward of up to $3 million for information on Jafar, also known as Amar. Jafar is an al-Shabaab facilitator and operational planner, who has served as a deputy to Abdikadir Mohamed Abdikadir, also known as Ikrima. Jafar also serves as al-Shabaab’s chief of explosives and is responsible for attack operations in Mogadishu."}, {"Page_url": "https://rewardsforjustice.net/rewards/jehad-serwan-mostafa/", "Title": "Jehad Serwan Mostafa – Rewards For Justice", "Reward_amount": "Up to $10 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/11/jehad_mostafa.jpg", "date_of_birth": "\n\t\t\t\t\t\t\tDecember 28, 1981\t\t\t\t\t\t", "associated_organisation": "Al-Shabaab", "associated_location": "Ethiopia , Kenya , Somalia , Yemen", "about": "Rewards for Justice is offering a reward of up to $10 million for information on Jehad Serwan Mostafa, also known as Ahmed Gurey, Anwar al-Amriki, and Emir Anwa. Mostafa is a U.S. citizen and former resident of California, who has held leadership positions with al-Shabaab, a U.S.-designated Foreign Terrorist Organization. He is believed to be the highest-ranking U.S. citizen fighting overseas with a terrorist organization.,Mostafa lived and graduated from college in San Diego, California, before moving to Somalia in 2005. It is believed he participated in attacks against Ethiopian forces before joining al-Shabaab in approximately 2008. With al-Shabaab, Mostafa has functioned in many critical capacities, including serving as a military instructor at the group’s training camps, leading foreign fighters, operating in the group’s media wing, acting as an intermediary between al-Shabaab and other terrorist organizations, and leading the group’s use of explosives in terrorist attacks. Mostafa is believed to continue to play a critical role in planning operations directed against the Somali government and internationally-supported African Union forces in Somalia and East Africa. As a result, Mostafa continues to pose a direct threat to U.S. forces, civilians, and interests.,On October 9, 2009, Mostafa was indicted in the Southern District of California on charges of conspiring to provide material support to terrorists, conspiring to provide material support to al-Shabaab, and providing material support to al-Shabaab. On December 2, 2019, a superseding indictment unsealed in U.S. federal court charged Mostafa with terrorism-related offenses. Mostafa is on the FBI’s Most Wanted Terrorists List."}, {"Page_url": "https://rewardsforjustice.net/rewards/ibrahim-salih-mohammed-al-yacoub/", "Title": "Ibrahim Salih Mohammed al-Yacoub – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/11/ibrahim_al_yacoub2_sm.jpg,https://rewardsforjustice.net/wp-content/uploads/2020/11/ibrahim_al_yacoub1.jpg", "date_of_birth": "\n\t\t\t\t\t\t\tOctober 16, 1966\t\t\t\t\t\t", "associated_organisation": "Saudi Hizballah", "associated_location": "", "about": "Rewards for Justice is offering a reward of up to $5 million for information on Ibrahim Salih Mohammed al-Yacoub. Al-Yacoub, an alleged member of the Saudi Hizballah terrorist organization, is wanted for his role in the 1996 bombing of Khobar Towers near Dhahran, Saudi Arabia.,On June 25, 1996, members of Saudi Hizballah detonated a tanker truck containing plastic explosives in the parking lot of Khobar Towers, a residential complex used to house U.S. military personnel. The blast all but destroyed the nearest building, killed 19 U.S. service members and one Saudi citizen, and wounded hundreds of individuals from various nations.,On June 21, 2001, a U.S. federal grand jury indicted al-Yacoub and 13 other individuals connected to the attack.,On October 12, 2001, the U.S. Department of State designated al-Yacoub as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result of this designation, among other consequences, all property and interests in property of al-Yacoub that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with al-Yacoub. He is on the FBI’s Most Wanted Terrorists List."}, {"Page_url": "https://rewardsforjustice.net/rewards/jaber-a-elbaneh/", "Title": "Jaber A. Elbaneh – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/11/jaber_elbaneh2_sm.jpg,https://rewardsforjustice.net/wp-content/uploads/2020/11/jaber_elbaneh1.jpg", "date_of_birth": "\n\t\t\t\t\t\t\tSeptember 9, 1966\t\t\t\t\t\t", "associated_organisation": "Al-Qa’ida (AQ)", "associated_location": "Yemen", "about": "Rewards for Justice is offering a reward of up to $5 million for information on Jaber A. Elbaneh, also known as Jaben A. Elbanelt and Abu Jubaer. Elbaneh is charged in the United States with providing, and conspiring to provide, material support to al-Qa’ida, a U.S.-designated Foreign Terrorist Organization. Elbaneh was last known to be in Yemen. He is on the FBI’s Most Wanted Terrorists List."}, {"Page_url": "https://rewardsforjustice.net/rewards/ibrahim-ahmed-mahmoud-al-qosi/", "Title": "Ibrahim Ahmed Mahmoud al-Qosi – Rewards For Justice", "Reward_amount": "Up to $4 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/03/al_Qosithumbnail-1.jpeg", "date_of_birth": "\n\t\t\t\t\t\t\tJuly 1960\t\t\t\t\t\t", "associated_organisation": "Al-Qa’ida (AQ)", "associated_location": "Sudan , Yemen", "about": "Rewards for Justice is offering a reward of up to $4 million for information on Ibrahim Ahmed Mahmoud al-Qosi, also known as Sheikh Khubayb al-Sudani and Mohammad Salah Ahmad. Al-Qosi is a senior leader of al-Qa’ida in the Arabian Peninsula (AQAP), a U.S.-designated Foreign Terrorist Organization.,Al-Qosi joined AQAP in 2014, but has long been active in al-Qa’ida (AQ) and worked directly for now-deceased AQ leader Usama bin Ladin for many years. Al-Qosi was captured in Pakistan in December 2001 before being transferred to Guantanamo Bay. He pleaded guilty in 2010 before a military commission to conspiring with AQ and providing material support to terrorism. The United States released al-Qosi and returned him to Sudan in 2012 pursuant to a pretrial agreement.,Since 2015, al-Qosi has appeared in AQAP recruiting materials and encouraged lone-wolf attacks against the United States in online propaganda. He served as part of the leadership team that assisted now-deceased former AQAP emir Qasim al-Rimi."}, {"Page_url": "https://rewardsforjustice.net/rewards/ibrahim-al-banna/", "Title": "Ibrahim al-Banna – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/03/Ibrahim-al-Banna-Updated-Photo-300x217.jpg", "date_of_birth": "\n\t\t\t\t\t\t\t1965\t\t\t\t\t\t", "associated_organisation": "Al-Qa’ida in the Arabian Peninsula (AQAP)", "associated_location": "Yemen", "about": "Rewards for Justice is offering a reward of up to $5 million for information on Ibrahim al-Banna, also known as Abu Ayman al-Masri. Al-Banna is a senior leader of al-Qa’ida in the Arabian Peninsula (AQAP), a U.S.-designated Foreign Terrorist Organization (FTO). He was a founding member of AQAP, has served as the group’s chief of security, and has provided military and security guidance to AQAP leadership. Al-Banna is the last of AQAP’s founding members.,In a 2010 article for AQAP’s English-language online magazine, Inspire, al-Banna described the September 11, 2001 terrorist attacks on the United States as virtuous and threatened to target Americans worldwide in response to U.S. actions overseas. Prior to his membership with AQAP, al-Banna was a leader of the Egyptian Islamic Jihad in Yemen from 1996 to 1998 and subsequently was in charge of the group’s training and intelligence sectors.,On June 5, 2017, the U.S. Department of State designated al-Banna as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result of this designation, among other consequences, all property and interests in property of al-Banna that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with al-Banna. In addition, it is a crime to knowingly provide, or attempt or conspire to provide, material support or resources to the FTO AQAP."}, {"Page_url": "https://rewardsforjustice.net/rewards/husayn-muhammed-al-umari/", "Title": "Husayn Muhammed al-Umari – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/11/husayn_al_umari1.jpg", "date_of_birth": "\n\t\t\t\t\t\t\t1936\t\t\t\t\t\t", "associated_organisation": "15 May Organization", "associated_location": "", "about": "Rewards for Justice is offering a reward of up to $5 million for information on Husayn Muhammed al-Umari, also known as Hussein Mohammed al-Umari and Abu Ibrahim. Al-Umari is wanted for his role in the 1982 bombing of Pan Am Flight 830. Al-Umari is an expert bomb maker and a one-time leader of the 15 May Organization terrorist group.,On August 11, 1982, a bomb, believed to have been designed and built by al-Umari, exploded on Pan Am Flight 830 with 267 passengers and crew on board as it was in flight from Tokyo, Japan, to Honolulu, Hawaii. The blast killed a 16-year-old passenger and wounded 16 others. Al-Umari was indicted in the United States along with two others in connection to the bombing. The French government also indicted al-Umari for the 1985 bombings of the Marks & Spencer department store and the Leumi Bank.,Al-Umari possesses a Lebanese passport and may be residing in Iraq or Lebanon. He is on the FBI’s Most Wanted Terrorists List. The U.S. Department of Defense is also offering a reward of up to $200,000 for information leading to his capture."}, {"Page_url": "https://rewardsforjustice.net/rewards/haytham-ali-tabatabai/", "Title": "Haytham ‘Ali Tabataba’i – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/11/aliTabatabaithumbnail.jpg", "date_of_birth": "\n\t\t\t\t\t\t\t1968\t\t\t\t\t\t", "associated_organisation": "Hizballah", "associated_location": "Syria , Yemen", "about": "Rewards for Justice is offering a reward of up to $5 million for information on Haytham ‘Ali Tabataba’i, also known as Abu Ali Tabatabai. Tabataba’i is a key Hizballah military leader who has commanded the group’s special forces in both Syria and Yemen. Tabataba’i’s actions in Syria and Yemen are part of a larger Hizballah effort to provide training, materiel, and personnel in support of its destabilizing regional activities.,On October 26, 2016, the U.S. Department of State designated Tabataba’i as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result of this designation, among other consequences, all property and interests in property of Tabataba’i that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with Tabataba’i. In addition, it is a crime to knowingly provide, or attempt or conspire to provide, material support or resources to Hizballah, a U.S.-designated Foreign Terrorist Organization."}, {"Page_url": "https://rewardsforjustice.net/rewards/hassan-afgooye/", "Title": "Hassan Afgooye – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "", "date_of_birth": null, "associated_organisation": "Al-Shabaab", "associated_location": "", "about": "Rewards for Justice is offering a reward of up to $5 million for information on Hassan Afgooye, a key leader of the terrorist group al-Shabaab. Afgooye oversees a complex financial network whose activities range from fake charities and fundraising to racketeering and kidnapping in support of U.S.-designated Foreign Terrorist Organization al-Shabaab. Afgooye is considered critical to the group’s continuing operations."}, {"Page_url": "https://rewardsforjustice.net/rewards/hasan-izz-al-din/", "Title": "Hasan Izz-al-Din – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/11/hasan_izz_al_din.jpg", "date_of_birth": "\n\t\t\t\t\t\t\t1963\t\t\t\t\t\t", "associated_organisation": "Hizballah", "associated_location": "Lebanon", "about": "Rewards for Justice is offering a reward of up to $5 million for information on Hasan Izz-al-Din, also known as Ahmed Garbaya and Samir Salwwan. Izz-al-Din, an alleged member of Hizballah, is wanted for his role in the 1985 hijacking of TWA Flight 847.,On June 14, 1985, terrorists hijacked TWA Flight 847 during a flight from Athens to Rome. Over 17 days, the plane was forced to crisscross the Mediterranean with 153 passengers and crew members, from Beirut to Algiers and back again, landing in Beirut three times. During the first stop in Beirut, the hijackers severely beat, and then shot and killed, U.S. Navy diver Robert Stethem.,On November 14, 1985, Izz-al-Din was indicted for his role in planning and participating in the hijacking. On October 12, 2001, the U.S. Department of State designated Izz-al-Din as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result of this designation, among other consequences, all property and interests in property of Izz-al-Din that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with Izz-al-Din. In addition, it is a crime to knowingly provide, or attempt or conspire to provide, material support or resources to Hizballah, a U.S.-designated Foreign Terrorist Organization. Izz-al-Din is on the FBI’s Most Wanted Terrorists List. He is believed to be in Lebanon."}, {"Page_url": "https://rewardsforjustice.net/rewards/hamad-el-khairy/", "Title": "Hamad el Khairy – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/11/hamad_el_khairy-1.jpg", "date_of_birth": "\n\t\t\t\t\t\t\t1970\t\t\t\t\t\t", "associated_organisation": "Al-Qa’ida in the Islamic Maghreb (AQIM)", "associated_location": "", "about": "Rewards for Justice is offering a reward of up to $5 million for information on Hamad el Khairy, also known as Amada Ould Kheirou or Abou Qumqum, for his role as a founding leader of the terrorist group Movement for Unity and Jihad in West Africa (MUJWA).,Under Khairy’s leadership, MUJWA members conducted terrorist attacks and abductions of foreign diplomats and other individuals.  Khairy claimed responsibility for the April 2012 kidnapping of seven Algerian diplomats in Mali, and appeared in MUJWA videos making threats against those who opposed the organization.  In January 2012, Khairy stated that MUJWA’s goal was to “impose sharia law across the whole of West Africa.”,Prior to his leadership role in MUJWA, Khairy was a member of al-Qa’ida in the Islamic Maghreb and planned terrorist operations against Mauritania. In October 2011, Khairy ordered the kidnapping of three European aid workers in Algeria, leaving two wounded by gunfire.,On December 7, 2012, the U.S. Department of State designated Khairy as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result of this designation, among other consequences, all property, and interests in property, of Khairy that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with Khairy. "}, {"Page_url": "https://rewardsforjustice.net/rewards/muhammad-ahmed-al-munawar/", "Title": "Muhammad Ahmed al-Munawar – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/11/muhammad_al_munawar.jpg,https://rewardsforjustice.net/wp-content/uploads/2020/11/Al-Munawar-Final-228x300.jpg", "date_of_birth": "\n\t\t\t\t\t\t\tMay 21, 1965\t\t\t\t\t\t", "associated_organisation": "Abu Nidal Organization (ANO)", "associated_location": "", "about": "Rewards for Justice is offering a reward of up to $5 million for information on Muhammad Ahmed al-Munawar, also known as Abdarahman al-Rashid Mansour and Ashraf Naeem Mansour. Al-Munawar, an alleged member of the Abu Nidal Organization terrorist group, is wanted for his role in the September 5, 1986 hijacking of Pan Am Flight 73 in Karachi, Pakistan. After holding 379 passengers and crew hostage for nearly 16 hours, the hijackers began shooting indiscriminately. Twenty people, including two Americans, were killed and more than 100 were injured.,For his role in the hijacking, al-Munawar was indicted by a U.S. federal grand jury and is on the FBI’s Most Wanted Terrorists List. Al-Munawar likely resides in the Middle East."}, {"Page_url": "https://rewardsforjustice.net/rewards/muhammad-abdullah-khalil-hussain-ar-rahayyal/", "Title": "Muhammad Abdullah Khalil Hussain ar-Rahayyal – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/11/muhammad_ar_rahayyal.jpg,https://rewardsforjustice.net/wp-content/uploads/2020/11/Rahayyal-Final-226x300.jpg", "date_of_birth": "\n\t\t\t\t\t\t\tNovember 27, 1965\t\t\t\t\t\t", "associated_organisation": "Abu Nidal Organization (ANO)", "associated_location": "", "about": "Rewards for Justice is offering a reward of up to $5 million for information on Muhammad Abdullah Khalil Hussain ar-Rahayyal, also known as Khalil Antwan Iwan and Khalil Alid. Ar-Rahayyal, an alleged member of the Abu Nidal Organization terrorist group, is wanted for his role in the September 5, 1986 hijacking of Pan Am Flight 73 in Karachi, Pakistan. After holding 379 passengers and crew hostage for nearly 16 hours, the hijackers began shooting indiscriminately. Twenty people, including two Americans, were killed and more than 100 were injured.,For his role in the hijacking, ar-Rahayyal was indicted by a U.S. federal grand jury and is on the FBI’s Most Wanted Terrorists List. Ar-Rahayyal likely resides in the Middle East."}, {"Page_url": "https://rewardsforjustice.net/rewards/malik-abou-abdelkarim/", "Title": "Malik Abou Abdelkarim – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "", "date_of_birth": "\n\t\t\t\t\t\t\t1972\t\t\t\t\t\t", "associated_organisation": "Al-Qa’ida in the Islamic Maghreb (AQIM)", "associated_location": "", "about": "Rewards for Justice is offering a reward of up to $5 million for information on Malik Abou Abdelkarim, also known as Abd al-Karim or Abu Abd al-Karim al-Tariqi. Abdelkarim is a senior leader of a company of fighters within al-Qa’ida in the Islamic Maghreb (AQIM), a U.S.-designated Foreign Terrorist Organization. ,Under Abdelkarim’s command, his company acquired weapons and conducted kidnappings and small-scale terrorist attacks across North and West Africa. Abdelkarim was reportedly responsible for killing an elderly French hostage in Niger in July 2010. An attack in June 2010 carried out by Abdelkarim’s company resulted in the death of 11 Algerian gendarmes."}, {"Page_url": "https://rewardsforjustice.net/rewards/khalil-haqqani/", "Title": "Khalil al-Rahman Haqqani – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/11/khalil_haqqani3_sm.jpg,https://rewardsforjustice.net/wp-content/uploads/2020/11/khalil_haqqani2_sm.jpg,https://rewardsforjustice.net/wp-content/uploads/2020/11/khalil_haqqani.jpg", "date_of_birth": "\n\t\t\t\t\t\t\t1966; 1958 to 1964\t\t\t\t\t\t", "associated_organisation": "Haqqani Network (HQN)", "associated_location": "Afghanistan , Pakistan", "about": "Rewards for Justice is offering a reward of up to $5 million for information on Khalil al-Rahman Haqqani, also known as Khalil Haqqani or Khalil Ahmad Haqqani. Khalil serves as a key leader of the Haqqani Network (HQN), a U.S.-designated Foreign Terrorist Organization (FTO). ,Khalil engages in fundraising activities on behalf of the Taliban and provides support to the Taliban operating in Afghanistan. As of early 2010, he provided funds to Taliban cells in Logar Province, Afghanistan. In 2009, Khalil was one of several people responsible for the detention of individuals captured by the Taliban and the HQN. Khalil has conducted operations for the Taliban on orders from his nephew, Sirajuddin Haqqani, the overall HQN leader and deputy leader of the Taliban. Khalil has also acted on behalf of al-Qa’ida (AQ) and has been linked to AQ terrorist operations. In 2002, he deployed fighters to reinforce AQ elements in Paktia Province, Afghanistan.,On February 9, 2011, the U.S. Department of the Treasury designated Khalil Haqqani as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result of this designation, among other consequences, all property and interests in property of Khalil Haqqani that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with Khalil Haqqani. In addition, it is a crime to knowingly provide, or attempt or conspire to provide, material support or resources to the FTO HQN."}, {"Page_url": "https://rewardsforjustice.net/rewards/mahad-karate/", "Title": "Mahad Karate – Rewards For Justice", "Reward_amount": "Up to $10 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/11/mahad_karate.jpg", "date_of_birth": "\n\t\t\t\t\t\t\t1957 to 1962\t\t\t\t\t\t", "associated_organisation": "Al-Shabaab", "associated_location": "Somalia", "about": "Rewards for Justice is offering a reward of up to $10 million for information on Mahad Karate, also known as Abdirahman Mohamed Warsame. Karate serves as al-Shabaab’s shadow deputy leader. Karate has some command responsibility over the Amniyat, al-Shabaab’s intelligence and security wing, as well as the group’s finances.,The Amniyat plays a key role in the execution of suicide attacks and assassinations in Somalia, Kenya and other countries in the region, and provides logistical support for al-Shabaab’s terrorist activities. The Amniyat was responsible for the April 2015 attack on Garissa University College in Kenya that killed nearly 150 people, mostly students.,On April 10, 2015, the U.S. Department of State designated Karate as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result of this designation, among other consequences, all property, and interests in property, of Karate that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with Karate. In addition, it is a crime to knowingly provide, or attempt or conspire to provide, material support or resources to al-Shabaab, a U.S.-designated Foreign Terrorist Organization."}, {"Page_url": "https://rewardsforjustice.net/rewards/maalim-salman/", "Title": "Maalim Salman – Rewards For Justice", "Reward_amount": "Up to $3 million", "image_urls": "", "date_of_birth": "\n\t\t\t\t\t\t\t1978 to 1980\t\t\t\t\t\t", "associated_organisation": "Al-Shabaab", "associated_location": "Somalia", "about": "Rewards for Justice is offering a reward of up to $3 million for information on Maalim Salman, a key leader of al-Shabaab, a U.S.-designated Foreign Terrorist Organization (FTO). Deceased al-Shabaab leader Ahmed Abdi Godane chose Salman to lead al-Shabaab’s African foreign terrorist fighters. Also known as Maalim Salman Ali and Ameer Salman, Salman has been involved in Africa-based operations targeting tourists, entertainment establishments, and churches. Although focused mainly on operations outside Somalia, Salman is known to reside in Somalia, where he trains foreign fighters for dispatch elsewhere.,On September 24, 2014, the U.S. Department of State designated Salman as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result of this designation, among other consequences, all property and interests in property of Salman that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with Salman. In addition, it is a crime to knowingly provide, or attempt or conspire to provide, material support or resources to the FTO al-Shabaab."}, {"Page_url": "https://rewardsforjustice.net/rewards/saad-bin-atef-al-awlaki/", "Title": "Sa’ad bin Atef al-Awlaki – Rewards For Justice", "Reward_amount": "Up to $6 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/11/al_awlakithumbnail.jpg", "date_of_birth": "\n\t\t\t\t\t\t\t1978; 1981 to 1983\t\t\t\t\t\t", "associated_organisation": "Al-Qa’ida in the Arabian Peninsula (AQAP)", "associated_location": "Yemen", "about": "Rewards for Justice is offering a reward of up to $6 million for information on Sa’ad bin Atef al-Awlaki, also known as Sa’d Muhammad Atif. Al-Awlaki is a member of al-Qa’ida in the Arabian Peninsula’s shura. He has publicly called for attacks against the United States and its allies."}, {"Page_url": "https://rewardsforjustice.net/rewards/khalil-yusif-harb/", "Title": "Khalil Yusif Harb – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/11/Harb_thumbnail.jpg", "date_of_birth": "\n\t\t\t\t\t\t\tOctober 9, 1958\t\t\t\t\t\t", "associated_organisation": "Hizballah", "associated_location": "Syria , Yemen", "about": "Rewards for Justice is offering a reward of up to $5 million for information on Khalil Yusif Harb, also known as Sayyid Ahmad and Abu Mustafa. Harb is a close adviser to Hassan Nasrallah, leader of U.S.-designated Foreign Terrorist Organization (FTO) Hizballah, and has served as the group’s chief military liaison to Iranian and Palestinian terrorist organizations. Harb has commanded and supervised Hizballah’s military operations in the Palestinian Territories and several countries throughout the Middle East. Since 2012, Harb has been involved in the movement of large amounts of currency to Hizballah’s political allies in Yemen.,On August 22, 2013, the U.S. Department of the Treasury designated Harb as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result of this designation, among other consequences, all property, and interests in property, of Harb that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with Harb. In addition, it is a crime to knowingly provide, or attempt or conspire to provide, material support or resources to the FTO Hizballah."}, {"Page_url": "https://rewardsforjustice.net/rewards/sami-jasim-muhammad-al-jaburi/", "Title": "Sami Jasim Muhammad al-Jaburi – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/11/ISIS-Deputies-Jaburi2_thumbnail.jpg", "date_of_birth": "\n\t\t\t\t\t\t\t1973; 1970\t\t\t\t\t\t", "associated_organisation": "Islamic State in Iraq and Syria (ISIS)", "associated_location": "", "about": "Rewards for Justice is offering a reward of up to $5 million for information on Sami Jasim Muhammad al-Jaburi, also known as Hajji Hamid and Sami Jasim Muhammad al-’Ajuz. Al-Jaburi is a senior leader of the Islamic State of Iraq and Syria (ISIS) and a legacy member of ISIS’s predecessor organization, al-Qa’ida in Iraq. Al-Jaburi has been instrumental in managing finances for ISIS’s terrorist operations.,While serving as ISIS deputy in southern Mosul in 2014, he reportedly served as the equivalent of ISIS’s finance minister, supervising the group’s revenue-generating operations from illicit sales of oil, gas, antiquities, and minerals.,On September 29, 2015, the U.S. Department of the Treasury designated al-Jaburi as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result of this designation, among other consequences, all property and interests in property of al-Jaburi that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with al-Jaburi. In addition, it is a crime to knowingly provide, or attempt or conspire to provide, material support or resources to ISIS, a U.S.-designated Foreign Terrorist Organization."}, {"Page_url": "https://rewardsforjustice.net/rewards/salih-al-aruri/", "Title": "Salih al-Aruri – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/03/AlArurithumbnail-1.jpeg", "date_of_birth": "\n\t\t\t\t\t\t\tAugust 19, 1966\t\t\t\t\t\t", "associated_organisation": "Harakat al-Muqawama al-Islamiya (HAMAS)", "associated_location": "", "about": "Rewards for Justice is offering a reward of up to $5 million for information on Salih al-Aruri, also known as Salih Muhammad Sulayman al-Aruri and Salih Suleiman. Al-Aruri is one of the founders of the Izzedine al-Qassam Brigades, Hamas’ military wing. In October 2017, he was elected deputy leader of the Hamas Political Bureau.,Al-Aruri funds and directs Hamas’ military operations in the West Bank and has been linked to several terrorist attacks, hijackings, and kidnappings. In 2014, al-Aruri announced Hamas’ responsibility for the June 12, 2014 terrorist attack that kidnapped and killed three Israeli teenagers in the West Bank, including dual U.S.–Israeli citizen Naftali Fraenkel. He publicly praised the murders as a “heroic operation.”,On September 10, 2015, the U.S. Department of the Treasury designated al-Aruri as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result of this designation, among other consequences, all property and interests in property of al-Aruri that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with al-Aruri. In addition, it is a crime to knowingly provide, or attempt or conspire to provide material support or resources to Hamas,,a U.S.-designated Foreign Terrorist Organization."}, {"Page_url": "https://rewardsforjustice.net/rewards/sami-al-uraydi/", "Title": "Sami al-Uraydi – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/11/aluraydithumbnail.jpg", "date_of_birth": "\n\t\t\t\t\t\t\t1973\t\t\t\t\t\t", "associated_organisation": "Al-Nusrah Front (ANF)", "associated_location": "", "about": "Rewards for Justice is offering a reward of up to $5 million for information on Sami al-Uraydi, also known as Abu Mahmud al-Shami. Al-Uraydi previously was involved in terrorist plots against the United States and Israel. Al-Uraydi is a senior sharia official for al-Qa’ida-affiliated Hurras al-Din and a member of its shura, the group’s senior decision-making body. Al-Uraydi was also al-Nusrah Front’s senior sharia official from 2014 to 2016 and left the group in 2016."}, {"Page_url": "https://rewardsforjustice.net/rewards/talal-hamiyah/", "Title": "Talal Hamiyah – Rewards For Justice", "Reward_amount": "Up to $7 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/11/talal_hamiyah.jpg", "date_of_birth": "\n\t\t\t\t\t\t\tNovember 27, 1952; March 5, 1958; December 8, 1958; March 18, 1960\t\t\t\t\t\t", "associated_organisation": "Hizballah", "associated_location": "", "about": "Rewards for Justice is offering a reward of up to $7 million for information on Talal Hamiyah, also known as Ismat Mezarani. Hamiyah is the head of Hizballah’s External Security Organization (ESO), which maintains organized cells worldwide. The ESO is the Hizballah element responsible for the planning, coordination, and execution of terrorist attacks outside of Lebanon. The attacks have primarily targeted Israelis and Americans.,On September 13, 2012, the U.S. Department of the Treasury designated Hamiyah as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended, for providing support to Hizballah’s terrorist activities in the Middle East and around the world. As a result of this designation, among other consequences, all property and interests in property of Hamiyah that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with Hamiyah. In addition, it is a crime to knowingly provide, or attempt or conspire to provide, material support or resources to Hizballah, a U.S.-designated Foreign Terrorist Organization."}, {"Page_url": "https://rewardsforjustice.net/rewards/yasin-kilwe/", "Title": "Yasin Kilwe – Rewards For Justice", "Reward_amount": "Up to $3 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/11/yasin_kilwe.jpg", "date_of_birth": "\n\t\t\t\t\t\t\t1981\t\t\t\t\t\t", "associated_organisation": "Al-Shabaab", "associated_location": "Somalia", "about": "Rewards for Justice is offering a reward of up to $3 million for information on Yasin Kilwe, a regional leader of al-Shabaab, a U.S.-designated Foreign Terrorist Organization (FTO). Also known as Yasin Usman Kilwe and Yasin Khalid Osman, Kilwe is al-Shabaab’s emir for Puntland in northern Somalia and has been accused of planning attacks targeting Puntland officials.,Prior to joining al-Shabaab, Kilwe was the leader of a local militia in the Galgala Hills of northern Somalia. The militia reportedly seized territory in the Hills and launched a deadly attack against a local military base.,In 2012, Kilwe’s militia formally joined al-Shabaab, which pledged loyalty to al-Qa’ida (AQ) that same month. This merger granted al-Shabaab, and by extension AQ, access to a powerful fighting force."}, {"Page_url": "https://rewardsforjustice.net/rewards/yasin-al-suri/", "Title": "Yasin al-Suri – Rewards For Justice", "Reward_amount": "Up to $3 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/11/yasin_al_suri_sm.jpg,https://rewardsforjustice.net/wp-content/uploads/2020/11/yasin_al_suri_new.jpg", "date_of_birth": "\n\t\t\t\t\t\t\t1982\t\t\t\t\t\t", "associated_organisation": "Al-Qa’ida (AQ)", "associated_location": "Iran", "about": "Rewards for Justice is offering a reward of up to $3 million for information on Ezedin Abdel Aziz Khalil, more commonly known as Yasin al-Suri.,Al-Suri is an al-Qa’ida (AQ) facilitator based in Iran. Al-Suri has moved money and recruits from across the Middle East into Iran, and then on to Pakistan, to support AQ’s senior leadership. Iranian authorities maintain a relationship with al-Suri and have permitted him to operate within Iran’s borders since 2005. Al-Suri was previously arrested by Iranian authorities in December 2011 after the announcement of a Rewards for Justice reward offer seeking information about him.,On July 28, 2011, the U.S. Department of the Treasury designated al-Suri as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result of this designation, among other consequences, all property, and interests in property, of al-Suri that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with al-Suri. In addition, it is a crime to knowingly provide, or attempt or conspire to provide, material support or resources to AQ, a U.S.-designated Foreign Terrorist Organization."}, {"Page_url": "https://rewardsforjustice.net/rewards/yahya-haqqani/", "Title": "Yahya Haqqani – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/11/yahya_haqqani3_sm.jpg,https://rewardsforjustice.net/wp-content/uploads/2020/11/yahya_haqqani2_sm.jpg,https://rewardsforjustice.net/wp-content/uploads/2020/11/yahya_haqqani.jpg", "date_of_birth": "\n\t\t\t\t\t\t\t1982; 1978\t\t\t\t\t\t", "associated_organisation": "Haqqani Network (HQN)", "associated_location": "Pakistan", "about": "Rewards for Justice is offering a reward of up to $5 million for information on Yahya Haqqani, also known as Haroon. Yahya Haqqani is a key leader of the Haqqani Network (HQN), a U.S.-designated Foreign Terrorist Organization (FTO).,Yahya has been closely involved in HQN’s terrorist, financial, and propaganda activities. Yahya has acted as the group’s de facto head when its senior-most HQN leaders, Sirajuddin Haqqani (Yahya’s brother-in-law) and Khalil Haqqani, were absent. Yahya has provided significant support for HQN attacks. Yahya has also conducted and managed HQN and Taliban media and propaganda activities. Yahya sometimes serves as a liaison between the HQN and al-Qa’ida (AQ), and he has maintained ties with AQ since at least mid-2009. In this role, Yahya has provided money to AQ members in the region for their personal expenses.,On February 5, 2014, the U.S. Department of the Treasury designated Yahya Haqqani as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result of this designation, among other consequences, all property, and interests in property, of Yahya Haqqani that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with Yahya Haqqani. In addition, it is a crime to knowingly provide, or attempt or conspire to provide, material support or resources to the FTO HQN."}, {"Page_url": "https://rewardsforjustice.net/rewards/sirajuddin-haqqani/", "Title": "Sirajuddin Haqqani – Rewards For Justice", "Reward_amount": "Up to $10 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/11/sirajuddun_haqqani3_sm.jpg,https://rewardsforjustice.net/wp-content/uploads/2020/11/sirajuddun_haqqani1.jpg", "date_of_birth": "\n\t\t\t\t\t\t\t1970; 1973; 1977; 1978\t\t\t\t\t\t", "associated_organisation": "Haqqani Network (HQN)", "associated_location": "Afghanistan , Pakistan", "about": "Rewards for Justice is offering a reward of up to $10 million for information on Sirajuddin Haqqani, also known as Siraj Haqqani and Khalifa. Sirajuddin leads the Haqqani Network (HQN), a U.S-designated Foreign Terrorist Organization (FTO). Under his leadership, HQN has planned and conducted numerous significant kidnappings and attacks against U.S. and Coalition Forces in Afghanistan, the Afghan government, and civilian targets. In 2015, Sirajuddin was appointed deputy leader of the Taliban, cementing the alliance between HQN and the Taliban.,During an interview with an American news organization, Sirajuddin admitted to planning the January 14, 2008 attack against the Serena Hotel in Kabul, Afghanistan, which killed six people, including U.S. citizen Thor David Hesla. Sirajuddin also admitted to having planned the April 2008 assassination attempt on Afghan President Hamid Karzai.,On March 11, 2008, the U.S. Department of State designated Sirajuddin Haqqani as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result of this designation, among other consequences, all property and interests in property of Sirajuddin that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with Sirajuddin. In addition, it is a crime to knowingly provide, or attempt or conspire to provide, material support or resources to the FTO HQN."}, {"Page_url": "https://rewardsforjustice.net/rewards/salman-raouf-salman/", "Title": "Salman Raouf Salman – Rewards For Justice", "Reward_amount": "Up to $7 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/11/Samuel-Salman-El-Reda-204x300.jpg,https://rewardsforjustice.net/wp-content/uploads/2020/11/SRS-239x300.jpg", "date_of_birth": "\n\t\t\t\t\t\t\tJune 5, 1963; 1965\t\t\t\t\t\t", "associated_organisation": "Hizballah", "associated_location": "Lebanon", "about": "Rewards for Justice is offering a reward of up to $7 million for information on Salman Raouf Salman, also known as Samuel Salman El Reda and Salman Remal. Salman directs and supports Hizballah’s terrorist activities in the Western Hemisphere. A leader in Hizballah’s External Security Organization (ESO), Salman has also been involved in plots worldwide. The ESO is the Hizballah element responsible for the planning, coordination, and execution of terrorist attacks outside Lebanon. The attacks have primarily targeted Israelis and Americans.,Salman is assessed to have served as the on-the-ground coordinator for the July 18, 1994 bombing of the Argentine Jewish Mutual Aid Society, a Jewish community center in Buenos Aires. The explosion from a vehicle-borne improvised explosive device killed 85 people and injured more than 300.,On July 19, 2019, the U.S. Department of the Treasury designated Salman as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result of this designation, among other consequences, all property and interests in property of Salman that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with Salman. In addition, it is a crime to knowingly provide, or attempt or conspire to provide, material support or resources to Hizballah, a U.S.-designated Foreign Terrorist Organization."}, {"Page_url": "https://rewardsforjustice.net/rewards/muhammad-al-jawlani/", "Title": "Muhammad al-Jawlani – Rewards For Justice", "Reward_amount": "Up to $10 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/11/Jawlani-Photo-300x240.png,https://rewardsforjustice.net/wp-content/uploads/2020/11/muhammad_al_jawlani2_sm.jpg", "date_of_birth": "\n\t\t\t\t\t\t\tBetween 1975 and 1979\t\t\t\t\t\t", "associated_organisation": "Al-Nusrah Front (ANF)", "associated_location": "Syria", "about": "Rewards for Justice is offering a reward of up to $10 million for information on Muhammad al-Jawlani, also known as Abu Muhammad al-Golani and Muhammad al-Julani. Al-Jawlani leads the al-Nusrah Front (ANF), al-Qa’ida’s (AQ) affiliate in Syria. In January 2017, ANF merged with several other hardline opposition groups to form Hayat Tahrir al-Sham (HTS). While al-Jawlani is not the leader of HTS, he remains the leader of AQ-affiliated ANF, which is at the core of HTS.,Under al-Jawlani’s leadership, ANF has carried out multiple terrorist attacks throughout Syria, often targeting civilians. In April 2015, ANF reportedly kidnapped, and later released, approximately 300 Kurdish civilians from a checkpoint in Syria. In June 2015, ANF claimed responsibility for the massacre of 20 residents in the Druze village of Qalb Lawzeh in Idlib province, Syria.,In April 2013, al-Jawlani pledged allegiance to AQ and its leader Ayman al-Zawahiri. In July 2016, al-Jawlani praised AQ and al-Zawahiri in an online video and claimed the ANF was changing its name to Jabhat Fath Al Sham (“Conquest of the Levant Front”).,On May 16, 2013, the U.S. Department of State designated al-Jawlani as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result of this designation, among other consequences, all property and interests in property of al-Jawlani that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with al-Jawlani. In addition, it is a crime to knowingly provide, or attempt or conspire to provide, material support or resources to ANF, a U.S.-designated Foreign Terrorist Organization."}, {"Page_url": "https://rewardsforjustice.net/rewards/mohamed-makawi-ibrahim-mohamed/", "Title": "Mohamed Makawi Ibrahim Mohamed – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/11/mohamed_makawi.jpg", "date_of_birth": "\n\t\t\t\t\t\t\t1984\t\t\t\t\t\t", "associated_organisation": "Al-Qa’ida in the Lands of the Two Niles (AQTN)", "associated_location": "Somalia , Sudan", "about": "Rewards for Justice is offering a reward of up to $5 million for information on Mohamed Makawi Ibrahim Mohamed. He was the leader of the attack that killed U.S. Agency for International Development (USAID) employees John Granville and Abdelrahman Abbas Rahama in Khartoum on January 1, 2008. Makawi had ties to a group in Sudan called al-Qa’ida in the Land of the Two Niles, which had plotted to attack U.S., Western, and Sudanese interests.,A Sudanese court tried, convicted, and sentenced Makawi to death in 2009 for his involvement in the murders. However, Makawi escaped from prison on June 10, 2010, before his sentence could be carried out. He remains at large and is believed to be in Somalia.,On January 8, 2013, the U.S. Department of State designated Makawi as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result of this designation, among other consequences, all property, and interests in property, of Makawi that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with Makawi."}, {"Page_url": "https://rewardsforjustice.net/rewards/mohammed-ali-hamadei/", "Title": "Mohammed Ali Hamadei – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/11/mohammed_hamadei1.jpg,https://rewardsforjustice.net/wp-content/uploads/2020/11/mohammed_hamadei2_sm.jpg", "date_of_birth": "\n\t\t\t\t\t\t\tJune 13, 1964\t\t\t\t\t\t", "associated_organisation": "Hizballah", "associated_location": "Germany , Lebanon", "about": "Rewards for Justice is offering a reward of up to $5 million for information on Mohammed Ali Hamadei, also known as Ali Hamadei and Castro. Hamadei, an alleged member of Hizballah, is wanted for his role in the 1985 hijacking of TWA Flight 847. ,On June 14, 1985, terrorists hijacked TWA Flight 847 during a flight from Athens to Rome. Over 17 days, the plane was forced to crisscross the Mediterranean with 153 passengers and crew members, from Beirut to Algiers and back again, landing in Beirut three times. During the first stop in Beirut, the hijackers severely beat, and then shot and killed, U.S. Navy diver Robert Stethem.,On November 14, 1985, Hamadei was indicted for his role and participation in the hijacking. He was arrested in the Frankfurt Airport on January 13, 1987. The United States sought extradition, but the Federal Republic of Germany decided to prosecute Hamadei in Germany and, in May 1989, convicted him of murder, hostage-taking, assault, and hijacking. Hamadei was sentenced to life in prison. On December 15, 2005, however, he was released from custody. Hamadei returned to Beirut, where he is believed to be located.,On October 12, 2001, the U.S. Department of State designated Hamadei as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result of this designation, among other consequences, all property and interests in property of Hamadei that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with Hamadei. In addition, it is a crime to knowingly provide, or attempt or conspire to provide, material support or resources to Hizballah, a U.S.-designated Foreign Terrorist Organization. Hamadei is on the FBI’s Most Wanted Terrorists List. "}, {"Page_url": "https://rewardsforjustice.net/rewards/junzo-okudaira/", "Title": "Junzō Okudaira – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/05/Okudaira_aged.png,https://rewardsforjustice.net/wp-content/uploads/2021/05/Okudaira.png", "date_of_birth": null, "associated_organisation": "Japanese Red Army (JRA)", "associated_location": "", "about": "Rewards for Justice is offering a reward of up to $5 million for information on Junzō Okudaira for the April 14, 1988 USO Club bombing in Naples, Italy. The blast killed five people, including a U.S. servicewoman, and wounded 15 others, including four U.S. servicemen.  Okudaira, a member of the Japanese Red Army terrorist group, was indicted in the United States on April 9, 1993 for the USO Club attack. He is also a suspect in a June 1987 car bombing and mortar attack against the U.S. Embassy in Rome."}, {"Page_url": "https://rewardsforjustice.net/rewards/abd-al-rahman-al-maghrebi/", "Title": "Abd al-Rahman al-Maghrebi – Rewards For Justice", "Reward_amount": "Up to $7 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/06/al-Maghrebi-1-1-244x300.png", "date_of_birth": "\n\t\t\t\t\t\t\t1970; January 7, 1970; July 1, 1970; November 26, 1975\t\t\t\t\t\t", "associated_organisation": "Al-Qa’ida (AQ)", "associated_location": "Iran", "about": "Rewards for Justice is offering a reward of up to $7 million for information on Muhammad Abbatay, better known as Abd al-Rahman al-Maghrebi. Al-Maghrebi is an Iran-based key leader of al-Qa’ida (AQ). He is the longtime director of AQ’s media arm, al-Sahab, and is the son-in-law and senior advisor to AQ leader Ayman al-Zawahiri.,Documents recovered during the 2011 military operation against now-deceased former AQ leader Usama bin Ladin indicate al-Maghrebi has been a rising star in AQ for many years. Al-Maghrebi has served as AQ’s general manager in Afghanistan and Pakistan since 2012. Following years of international counterterrorism pressure, he relocated to Iran, where he has continued to oversee AQ activities worldwide. As head of AQ’s External Communications Office, al-Maghrebi coordinates activities with AQ affiliates.,On January 12, 2021, the U.S. Department of State designated al-Maghrebi as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result of this designation, among other consequences, all property and interests in property of al-Maghrebi that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with al-Maghrebi. In addition, it is a crime to knowingly provide, or attempt or conspire to provide, material support or resources to AQ, a U.S.-designated Foreign Terrorist Organization."}, {"Page_url": "https://rewardsforjustice.net/rewards/muhammad-qasim-al-bazzal/", "Title": "Muhammad Qasim al-Bazzal – Rewards For Justice", "Reward_amount": "Up to $10 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/Al_Bazzal-1-224x300.png,https://rewardsforjustice.net/wp-content/uploads/2021/07/LH-Tenacity-Vertical-al-Bazzal-1-225x300.jpeg", "date_of_birth": "\n\t\t\t\t\t\t\tAugust 26, 1984\t\t\t\t\t\t", "associated_organisation": "Hizballah", "associated_location": "", "about": "Rewards for Justice is offering a reward of up to $10 million for information that leads to the disruption of the financial mechanisms of Hizballah. Muhammad Qasim al-Bazzal, also known as Mohamad Bazzal and Mu’In, is a key Hizballah official whose responsibilities include balancing the financial accounting between Hizballah and the Islamic Revolutionary Guard Corps-Qods Force (IRGC-QF).,Al-Bazzal is a co-founder of the Syria-based front company Talaqi Group and oversees other terrorist-financing enterprises, such as Hokoul S.A.L. Offshore and Nagham Al Hayat. As chairman of Talaqi Group’s board of directors, al-Bazzal oversees the company’s finances, procedures, administration, and contracts. Since late 2018, al-Bazzal has used the Talaqi Group and his other companies to finance, coordinate, and obscure various illicit IRGC-QF-linked oil shipments. Al-Bazzal also has overseen Talaqi Group’s partnership with Lebanon-based ALUMIX for aluminum shipments to Iran. ,On November 20, 2018, the U.S. Department of the Treasury designated al-Bazzal as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result of this designation, among other consequences, all property and interests in property of al-Bazzal that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with al-Bazzal. In addition, it is a crime to knowingly provide, or attempt or conspire to provide, material support or resources to Hizballah, a U.S.-designated Foreign Terrorist Organization. On September 4, 2019, the Department of the Treasury also designated Hokoul S.A.L. Offshore, Talaqi Group, Nagham Al Hayat, and ALUMIX for being owned or controlled by al-Bazzal."}, {"Page_url": "https://rewardsforjustice.net/rewards/muhammad-jafar-qasir/", "Title": "Muhammad Ja’far Qasir – Rewards For Justice", "Reward_amount": "Up to $10 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/muhammad_qasir-1.jpeg", "date_of_birth": "\n\t\t\t\t\t\t\tFebruary 12, 1967\t\t\t\t\t\t", "associated_organisation": "Hizballah", "associated_location": "Syria", "about": "Rewards for Justice is offering a reward of up to $10 million for information leading to the disruption of the financial mechanisms of Hizballah. Muhammad Ja’far Qasir, also known as Shaykh Salah and Hossein Gholi, is a key Hizballah financier, who provides funding for Hizballah operations through a number of illegal smuggling and procurement activities and other criminal enterprises. ,Qasir is also a critical conduit for financial disbursements from Iran’s Islamic Revolutionary Guard Corps-Qods Force (IRGC-QF) that are used to fund Hizballah’s activities. He helps to oversee several front companies used to mask the IRGC-QF’s role in the sale of oil and other extractives, a crucial source of income for Hizballah, IRGC-QF, the brutal regime of Syrian President Bashar al-Assad, and other illicit actors. In addition, Qasir leads Hizballah’s Unit 108, which coordinates closely with the IRGC-QF to facilitate the transfer of weapons, technology, and other support from Syria to Lebanon.,On May 15, 2018, the U.S. Department of the Treasury designated Qasir as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result of this designation, among other consequences, all property and interests in property of Qasir that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with Qasir. In addition, it is a crime to knowingly provide, or attempt or conspire to provide, material support or resources to Hizballah, a U.S.-designated Foreign Terrorist Organization."}, {"Page_url": "https://rewardsforjustice.net/rewards/mohammad-ibrahim-bazzi/", "Title": "Mohammad Ibrahim Bazzi – Rewards For Justice", "Reward_amount": "Up to $10 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/MohammadIbrahimBazzi.png", "date_of_birth": "\n\t\t\t\t\t\t\tAugust 10, 1964\t\t\t\t\t\t", "associated_organisation": "Hizballah", "associated_location": "Belgium , Lebanon", "about": "Rewards for Justice is offering a reward of up to $10 million for information leading to the disruption of the financial mechanisms of Hizballah. Mohammad Ibrahim Bazzi, who operates or transacts business in or through Belgium, Lebanon, Iraq, and several countries in West Africa, is a key Hizballah financier. Bazzi has generated millions of dollars for Hizballah from his business activities. ,Bazzi either owns or controls Global Trading Group NV, Euro African Group LTD, Africa Middle East Investment Holding SAL, Premier Investment Group SAL Offshore, and Car Escort Services S.A.L. Off Shore, all of which are U.S.-sanctioned companies through which Bazzi has provided millions of dollars to Hizballah.,On May 17, 2018, the U.S. Department of the Treasury designated Mohammad Ibrahim Bazzi as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result of this designation, among other consequences, all property and interests in property of Bazzi that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with Bazzi. In addition, it is a crime to knowingly provide, or attempt or conspire to provide, material support or resources to Hizballah, a U.S.-designated Foreign Terrorist Organization."}, {"Page_url": "https://rewardsforjustice.net/rewards/ali-youssef-charara/", "Title": "Ali Youssef Charara – Rewards For Justice", "Reward_amount": "Up to $10 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/AliYoussefCharara.png", "date_of_birth": "\n\t\t\t\t\t\t\tSeptember 25, 1968\t\t\t\t\t\t", "associated_organisation": "Hizballah", "associated_location": "Lebanon", "about": "Rewards for Justice is offering a reward of up to $10 million for information that leads to the disruption of the financial mechanisms of Hizballah. Ali Youssef Charara, also known as Ali Youssef Sharara and ‘Ali Yusuf Sharara, is a key Hizballah financier and Chairman and General Manager of Lebanon-based telecommunications company, Spectrum Investment Group Holding SAL, an entity sanctioned by the U.S. Department of the Treasury. Charara has received millions of dollars from Hizballah to invest in commercial projects that financially support the terrorist group.,In addition to Charara’s facilitation of commercial investments on behalf of Hizballah, Charara has also worked on oil ventures in Iraq. Additionally, Charara has extensive business interests in the telecommunications industry in West Africa.,On January 7, 2016, the Department of the Treasury designated Charara as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result of this designation, among other consequences, all property and interests in property of Charara that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with Charara. In addition, it is a crime to knowingly provide, or attempt or conspire to provide, material support or resources to Hizballah, a U.S.-designated Foreign Terrorist Organization."}, {"Page_url": "https://rewardsforjustice.net/rewards/islamic-revolutionary-guard-corps/", "Title": "Islamic Revolutionary Guard Corps (IRGC) Financial Network – Rewards For Justice", "Reward_amount": "Up to $15 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/IRCG_Financialsocialmediaimage-300x150.jpeg", "date_of_birth": null, "associated_organisation": "Islamic Revolutionary Guard Corps (IRGC)", "associated_location": "", "about": "Rewards for Justice is offering a reward of up to $15 million for information leading to the disruption of the financial mechanisms of Iran’s Islamic Revolutionary Guard Corps (,) and all its various branches, including the IRGC-Qods Force (,). The IRGC has financed numerous terrorist attacks and activities globally. The IRGC-QF leads Iran’s terrorist operations outside Iran via its proxies, such as Hamas, Hizballah, and Iran-backed militia groups in Iraq.,The U.S. Department of State is offering rewards for information on the sources of revenue for the IRGC, IRGC-QF, its branches or its key financial facilitation mechanisms, to include:,Founded in 1979 after the Iranian Revolution, the IRGC is a branch of the Iranian military. Through its Qods Force, the IRGC plays the greatest role among Iran’s actors in directing and carrying out the regime’s global terrorist campaign.,The IRGC has been involved in terrorist plots and supports terrorism worldwide. The IRGC is responsible for numerous attacks targeting Americans and U.S. facilities including those that have killed U.S. citizens. The IRGC has supported attacks against U.S. and allied troops and diplomatic missions in Afghanistan and Iraq.,Additionally, the IRGC has taken hostages and wrongfully detained numerous U.S. persons, many of whom remain in captivity in Iran today.,The IRGC–QF has planned numerous significant terrorist activities around the world, in countries such as Bahrain, Bosnia, Bulgaria, Germany, Kenya, Turkey, and the United States.,On April 15, 2019, the Department of State designated the IRGC as a Foreign Terrorist Organization under Section 219 of the Immigration and Nationality Act, as amended. In 2017, the U.S. Department of the Treasury designated the IRGC as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended, for its activities in support of the IRGC-QF. As a result, all of the IRGC’s property and interests in property subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with the IRGC. It is a crime to knowingly provide, or to attempt or conspire to provide, material support or resources to the IRGC."}, {"Page_url": "https://rewardsforjustice.net/rewards/disappearance-of-robert-a-levinson/", "Title": "Disappearance of Robert A. Levinson (Kish Island, Iran | March 9, 2007) – Rewards For Justice", "Reward_amount": "Up to $20 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/Levinson_thumbnail2.jpeg", "date_of_birth": "\n\t\t\t\t\t\t\tMarch 10, 1948\t\t\t\t\t\t", "associated_organisation": null, "associated_location": "Iran", "about": "Rewards for Justice is offering a reward of up to $20 million for information leading to the location, recovery, and return of Robert A. “Bob” Levinson. A retired FBI special agent, Levinson went missing during a business trip to Kish Island, Iran, on March 9, 2007. Levinson had retired from the FBI in 1998 and was working as a private investigator at the time of his disappearance.,In December 2020, the U.S. Department of the Treasury sanctioned two senior Iranian officials, Mohammad Baseri and Ahmad Khazai, for their involvement in Levinson’s abduction. The United States continues to seek information on others who were involved."}, {"Page_url": "https://rewardsforjustice.net/rewards/planned-or-past-attacks-against-u-s-diplomatic-missions-worldwide/", "Title": "Planned or Past Attacks Against U.S. Diplomatic Missions Worldwide – Rewards For Justice", "Reward_amount": "Up to $3 million", "image_urls": "", "date_of_birth": null, "associated_organisation": null, "associated_location": "", "about": "Rewards for Justice is offering a reward of up to $3 million for information that leads to the prevention or favorable resolution of an act of terrorism against any U.S. persons or property associated with a U.S. diplomatic mission. Anyone who reports actionable information about planned or past attacks against U.S. diplomatic missions may be eligible for this reward. U.S. diplomatic missions include embassies, consular offices, embassy annexes, and other representative offices worldwide."}, {"Page_url": "https://rewardsforjustice.net/rewards/kidnapping-of-kevin-scott-sutay/", "Title": "Kidnapping of Kevin Scott Sutay (El Retorno, Colombia | June 2013) – Rewards For Justice", "Reward_amount": "Up to $3 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/sutay_kidnapping-1.jpeg", "date_of_birth": null, "associated_organisation": null, "associated_location": "Colombia", "about": "Rewards for Justice is offering a reward of up to $3 million for information on the kidnapping of Kevin Scott Sutay. In June 2013, the Revolutionary Armed Forces of Colombia (FARC) kidnapped Sutay, a former U.S. military service member, near the municipality of El Retorno, Colombia. Sutay had been trekking as a tourist through several Central and South American countries.,On July 19, 2013, the FARC released a statement claiming responsibility for the kidnapping and announced its intent to free Sutay as a good-faith gesture. However, Sutay was not released until October 27, 2013, when he was turned over to a delegation of the governments of Colombia, Cuba, and Norway, and members of the International Committee of the Red Cross. Sutay was later released to U.S. government officials in Bogota, Colombia, and flown back to the United States."}, {"Page_url": "https://rewardsforjustice.net/rewards/kidnapping-of-paul-edwin-overby-jr/", "Title": "Kidnapping of Paul Edwin Overby, Jr. (Khost Province, Afghanistan | May 2014) – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "", "date_of_birth": "\n\t\t\t\t\t\t\tNovember 27, 1942\t\t\t\t\t\t", "associated_organisation": null, "associated_location": "Afghanistan", "about": "Rewards for Justice is offering a reward of up to $5 million for information leading to the location, recovery, and return of Paul Edwin Overby, Jr. In mid-May 2014, Overby, an American writer, disappeared in Khost Province, Afghanistan, where he was conducting research for a book project. Prior to his disappearance, Overby suggested that he planned to cross the border into Pakistan to advance his research. He was last seen in Khost City, Afghanistan. Overby suffers from an inner-ear canal ailment that requires treatment and medicine."}, {"Page_url": "https://rewardsforjustice.net/rewards/violence-in-opposition-to-the-middle-east-peace-negotiations-1993-to-present/", "Title": "Violence in Opposition to the Middle East Peace Negotiations (1993 to Present) – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "", "date_of_birth": null, "associated_organisation": "Harakat al-Muqawama al-Islamiya (HAMAS)", "associated_location": "Israel", "about": "Rewards for Justice is offering a reward of up to $5 million for information on attacks staged in Gaza, the West Bank, and Israel to disrupt peace negotiations associated with the Oslo Accords. Since the signing of the Oslo Accords in September 1993, terrorist groups and individuals opposed to a negotiated peace agreement have staged attacks in the region to disrupt negotiations and apply pressure on associated parties engaged in dialogue."}, {"Page_url": "https://rewardsforjustice.net/rewards/world-trade-center-bombing-new-york-city-february-26-1993/", "Title": "World Trade Center Bombing (New York City | February 26, 1993) – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "", "date_of_birth": null, "associated_organisation": "Al-Qa’ida (AQ)", "associated_location": "United States of America", "about": "Rewards for Justice is offering a reward of up to $5 million for information on the 1993 World Trade Center bombing in New York City. On February 26, 1993, terrorists detonated a 1,500-pound truck bomb in the parking garage beneath the World Trade Center. The blast killed six people, wounded more than 1,000 others, and caused hundreds of millions of dollars in damages.,A group of individuals associated with al-Qa’ida (AQ), including Abdul Rahman Yasin and Ramzi Yousef, planned the attack. Khalid Sheikh Mohammed, a high-ranking AQ member and Yousef’s uncle, provided funding for the operation. The perpetrators had hoped that the bomb would topple one tower, with the collapsing debris knocking down the second tower. Six of the conspirators, including the mastermind Ramzi Yousef, were arrested, tried and convicted, and sentenced to life in prison. A seventh plotter, ,, remains at large."}, {"Page_url": "https://rewardsforjustice.net/rewards/pan-am-flight-103-bombing-lockerbie-scotland-december-21-1988/", "Title": "Pan Am Flight 103 Bombing (Lockerbie, Scotland | December 21, 1988) – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "", "date_of_birth": null, "associated_organisation": null, "associated_location": "United Kingdom", "about": "Rewards for Justice is offering a reward of up to $5 million for information on the Pan Am Flight 103 bombing. On December 21, 1988, Pan Am Flight 103, a Boeing 747 traveling from London Heathrow Airport to John F. Kennedy Airport in New York, was destroyed in-flight over Lockerbie, Scotland when an improvised explosive device, concealed in the luggage, detonated. The explosion killed all 259 passengers and crew aboard, including 190 Americans, as well as 11 residents on the ground. The attack, planned and executed by Libyan intelligence operatives, was the largest terrorist attack on Americans prior to September 11, 2001. It remains the deadliest terrorist attack in the history of the United Kingdom.,Immediately after the disaster, Scottish and American law enforcement undertook a joint investigation. In November 1991, authorities filed criminal charges in both the United States and Scotland against Libyan intelligence operatives Abdel Baset Ali al-Megrahi and Lamen Khalifa Fhimah.,On January 31, 2001, al-Megrahi was convicted of all charges, and Fhimah was acquitted. Al-Megrahi received a mandatory sentence of life imprisonment. In August 2009, he was freed from prison on compassionate grounds after being diagnosed with terminal cancer. Al-Megrahi died at his home in Libya in May 2012.,On December 21, 2020, the U.S. Department of Justice announced new charges against a former Libyan intelligence operative, Abu Agela Mas’ud Kheir al-Marimi, for his role in the bombing."}, {"Page_url": "https://rewardsforjustice.net/rewards/uso-club-bombing-naples-italy-april-14-1988/", "Title": "USO Club Bombing (Naples, Italy | April 14, 1988) – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "", "date_of_birth": null, "associated_organisation": "Japanese Red Army (JRA)", "associated_location": "Italy", "about": "Rewards for Justice is offering a reward of up to $5 million for information on the USO Club bombing in Naples, Italy. On April 14, 1988, a car bomb exploded in front of the site, killing five people, including a U.S. servicewoman, and injuring 15 others, including four U.S. servicemen.,, a member of the Japanese Red Army terrorist group, was indicted in the United States on April 9, 1993, for the USO Club attack. Okudaira is also a suspect in a June 1987 car bombing and mortar attack against the U.S. Embassy in Rome."}, {"Page_url": "https://rewardsforjustice.net/rewards/pan-am-flight-73-hijacking-karachi-pakistan-september-5-1986/", "Title": "Pan Am Flight 73 Hijacking (Karachi, Pakistan | September 5, 1986) – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "", "date_of_birth": null, "associated_organisation": "Abu Nidal Organization (ANO)", "associated_location": "Pakistan", "about": "Rewards for Justice is offering a reward of up to $5 million for information on the hijacking of Pan Am Flight 73. On September 5, 1986, suspected members of the Abu Nidal Organization terrorist group hijacked Pan Am Flight 73 while it was on the ground in Karachi, Pakistan, with 379 on board. After holding the passengers and crew hostage for nearly 16 hours, the hijackers began shooting indiscriminately. Twenty people, including two Americans, were killed and more than 100 were injured.,Five terrorists who participated in the hijacking were ultimately captured, tried, and sentenced to prison in Pakistan. However, four of those convicted were reportedly released from custody in January 2008 and remain at large. Each was indicted by a U.S. federal grand jury and is on on the FBI’s Most Wanted Terrorists List. Rewards for Justice is offering a reward of up to $5 million for information on each of these individuals:,– Wadoud Muhammad Hafiz al-Turki,– Jamal Saeed Abdul Rahim,– Muhammad Abdullah Khalil Hussain ar-Rahayyal,– Muhammad Ahmed al-Munawar"}, {"Page_url": "https://rewardsforjustice.net/rewards/twa-flight-840-bombing-greece-april-2-1986/", "Title": "TWA Flight 840 Bombing (Greece | April 2, 1986) – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "", "date_of_birth": null, "associated_organisation": null, "associated_location": "Greece", "about": "Rewards for Justice is offering a reward of up to $5 million for information on the bombing of TWA Flight 840. On April 2, 1986, a bomb exploded on TWA Flight 840 as it traveled from Rome, Italy, to Athens, Greece. The explosion killed four U.S. citizens – including a 9-month-old infant, as well as her mother and grandmother – who were ejected from the aircraft. Five other passengers were injured. In a statement issued from Beirut, the Arab Revolutionary Cells claimed responsibility for the attack."}, {"Page_url": "https://rewardsforjustice.net/rewards/twa-flight-847-hijacking-beirut-lebanon-june-14-1985/", "Title": "TWA Flight 847 Hijacking (Beirut, Lebanon | June 14, 1985) – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "", "date_of_birth": null, "associated_organisation": "Hizballah", "associated_location": "Algeria , Greece , Lebanon", "about": "Rewards for Justice is offering a reward of up to $5 million for information on the 1985 hijacking of TWA Flight 847. On June 14, 1985, terrorists hijacked TWA Flight 847 during a flight from Athens to Rome. Over 17 days, the plane was forced to crisscross the Mediterranean with 153 passengers and crew members, from Beirut to Algiers and back again, landing in Beirut three times. During the first stop in Beirut, the hijackers severely beat, and then shot and killed, U.S. Navy diver Robert Stethem.,On November 14, 1985, a U.S. federal grand jury indicted Ali Atwa, Mohammed Ali Hamadei, and Hasan Izz-al-Din for their roles in the hijacking. Rewards for Justice is offering a reward of up to $5 million each for information on ,, ,, and ,."}, {"Page_url": "https://rewardsforjustice.net/rewards/marine-corps-barracks-bombing-lebanon-october-23-1983/", "Title": "Marine Corps Barracks Bombing (Lebanon | October 23, 1983) – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/marine_corps_bombing-1.jpeg", "date_of_birth": null, "associated_organisation": "Hizballah", "associated_location": "Lebanon", "about": "Rewards for Justice is offering a reward of up to $5 million for information on the 1983 bombing of the U.S. Marine Corps Barracks in Beirut, Lebanon. On October 23, 1983, a truck bomb exploded at the housing compound of U.S. and French members of the Multinational Force in Lebanon at Beirut International Airport. The Multinational Force was in Lebanon as part of an international peacekeeping effort. The attack killed 241 U.S. military personnel and wounded 128. Later that day, 58 French soldiers were killed in a similar attack. Hizballah is believed to have orchestrated the attacks, acting with support and funding from Iran."}, {"Page_url": "https://rewardsforjustice.net/rewards/murder-of-joel-wesley-shrum-taizz-yemen-march-18-2012/", "Title": "Murder of Joel Wesley Shrum (Taizz, Yemen | March 18, 2012) – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "", "date_of_birth": null, "associated_organisation": "Al-Qa’ida in the Arabian Peninsula (AQAP)", "associated_location": "Yemen", "about": "Rewards for Justice is offering a reward of up to $5 million for information on the murder of U.S. citizen Joel Shrum. On March 18, 2012, Shrum, age 29, was shot and killed on his way to work in Taizz, Yemen by a gunman riding on the back of a motorcycle that had pulled up alongside his vehicle. A few days after the attack, the terrorist organization al-Qa’ida in the Arabian Peninsula (AQAP) claimed responsibility for the murder.,At the time of his death, Shrum worked at the International Training and Development Center as an administrator and English teacher. He was living in Yemen with his wife and two young children."}, {"Page_url": "https://rewardsforjustice.net/rewards/2017-niger-attack-tongo-tongo-niger-october-4-2017/", "Title": "2017 Niger Ambush (Tongo Tongo, Niger | October 4, 2017) – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/DustinWright_thumbnail-1.jpeg,https://rewardsforjustice.net/wp-content/uploads/2021/07/BryanBlack_thumbnail-1.jpeg,https://rewardsforjustice.net/wp-content/uploads/2021/07/JeremiahJohnson_thumbnail-1.jpeg,https://rewardsforjustice.net/wp-content/uploads/2021/07/LaDavidJohnson_thumbnail.jpeg", "date_of_birth": null, "associated_organisation": "ISIS in the Greater Sahara (ISIS-GS)", "associated_location": "Niger", "about": "Rewards for Justice is offering a reward of up to $5 million for information on the 2017 Niger Attack.,On October 4, 2017, near the village of Tongo Tongo, Niger, ISIS-Greater Sahara (ISIS-GS)–linked militants ambushed a U.S. Special Forces team tasked with training, advising, and assisting Nigerien forces in fighting terrorism. The attack resulted in the deaths of four U.S. and four Nigerien soldiers. Two additional Americans and eight Nigeriens were wounded in the encounter. On January 12, 2018, ISIS-GS leader Adnan Abu Walid al-Sahrawi claimed responsibility for the attack."}, {"Page_url": "https://rewardsforjustice.net/rewards/lebanon-kidnappings-and-murders-lebanon-1982-1992/", "Title": "Lebanon Kidnappings and Murders (Lebanon | 1982-1992) – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "", "date_of_birth": null, "associated_organisation": "Hizballah", "associated_location": "Lebanon", "about": "Rewards for Justice is offering a reward of up to $5 million for information on the kidnappings and murders of Americans in Lebanon from 1982 to 1992. During this period, Hizballah and Hizballah-linked terrorists kidnapped and held hostage nearly 100 foreign nationals, mostly Westerners. Among the kidnapping victims, Americans William Buckley, Peter Kilburn, and William Higgins were tortured and killed.,William Buckley was the CIA station chief in Lebanon, a role for which he volunteered after the 1983 U.S. Embassy Beirut bombing that killed 63, including 17 Americans. On March 16, 1984, Buckley was kidnapped in Beirut on his way to work. Buckley was interrogated and tortured before he died in captivity on June 3, 1985.,Peter Kilburn was a librarian at the American University of Beirut. On December 3, 1984, he was reported missing. Sixteen months later, his body was found along with those of two other captives. The victims had been shot and then dumped in the mountains east of Beirut.,U.S. Marine Corps Colonel William Higgins was part of a United Nations peacekeeping mission in southern Lebanon when he was kidnapped on February 17, 1988. His captors tortured and interrogated Higgins before killing him."}, {"Page_url": "https://rewardsforjustice.net/rewards/2008-mumbai-attacks-mumbai-india-november-26-29-2008/", "Title": "2008 Mumbai Attacks (Mumbai, India | November 26-29, 2008) – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/mumbai-attacks.jpeg", "date_of_birth": null, "associated_organisation": "Lashkar-e Tayyiba (LeT)", "associated_location": "India", "about": "Rewards for Justice is offering a reward of up to $5 million for information on the 2008 Mumbai attacks. Beginning November 26, 2008, and continuing through November 29, 2008, 10 individuals trained by Lashkar-e Tayyiba (LeT), a U.S.-designated Foreign Terrorist Organization, carried out a series of coordinated terrorist attacks against multiple targets in Mumbai, India, killing 166 people. Six Americans were killed during the three-day siege: Ben Zion Chroman, Gavriel Holtzberg, Sandeep Jeswani, Alan Scherr, Naomi Scherr, and Aryeh Leibish Teitelbaum. Key members of this heinous plot remain at large, and the investigation remains ongoing.,David Coleman Headley and Tahawwur Rana were indicted in U.S. federal court for their support of LeT’s terrorist operations. In March 2010, Headley, a U.S. citizen, pleaded guilty to 12 counts that were brought against him following his arrest in October 2009. In January 2013, Headley was sentenced to 35 years in prison for federal terrorism crimes relating to his role in planning the Mumbai attacks and a subsequent proposed attack on a newspaper in Denmark. Rana, a Canadian citizen and longtime friend of Headley, was sentenced to 14 years in prison for conspiracy to provide material support to the Denmark terror plot and providing material support to LeT.,The following suspects also have been indicted in U.S. federal court:"}, {"Page_url": "https://rewardsforjustice.net/rewards/hebrew-university-bombing-jerusalem-july-31-2002/", "Title": "Hebrew University Bombing (Jerusalem | July 31, 2002) – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/dove-1-300x279.gif", "date_of_birth": null, "associated_organisation": "Harakat al-Muqawama al-Islamiya (HAMAS)", "associated_location": "", "about": "Rewards for Justice is offering a reward of up to $5 million for information on the July 31, 2002 bombing of Hebrew University in Jerusalem. Nine people, including five Americans, were killed and 85 were injured when a bomb exploded in Hebrew University’s cafeteria. The attackers acted on orders from the leaders of the terrorist group Hamas."}, {"Page_url": "https://rewardsforjustice.net/rewards/bombing-of-pakistani-civilians-karachi-pakistan-june-14-2002/", "Title": "Bombing of Pakistani Civilians (Karachi, Pakistan | June 14, 2002) – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/karachi_bombings.jpeg", "date_of_birth": null, "associated_organisation": null, "associated_location": "Pakistan", "about": "Rewards for Justice is offering a reward of up to $5 million for information on the June 14, 2002 car bombing outside the U.S. Consulate General in Karachi, Pakistan. The explosion killed 12 Pakistani civilians and injured 40 others."}, {"Page_url": "https://rewardsforjustice.net/rewards/attack-against-u-s-temporary-mission-facility-and-u-s-annex-benghazi-libya-september-11-12-2012/", "Title": "Attack Against U.S. Temporary Mission Facility and U.S. Annex  (Benghazi, Libya | September 11-12, 2012) – Rewards For Justice", "Reward_amount": "Up to $10 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/benghazi_attack.jpeg", "date_of_birth": null, "associated_organisation": null, "associated_location": "Libya", "about": "Rewards for Justice is offering a reward of up to $10 million for information on the attack against the U.S. Temporary Mission Facility and U.S. Annex in Benghazi, Libya. On September 11-12, 2012, four Americans — U.S. Ambassador to Libya John Christopher Stevens, Foreign Service Information Management Officer Sean Smith, and Protective Security Specialists Glen Anthony Doherty and Tyrone Snowden Woods— were killed in a terrorist attack against the U.S. Temporary Mission Facility and U.S. Annex in Benghazi. Terrorists launched a series of attacks involving arson, automatic weapons fire, rocket-propelled grenades, and mortars on the two U.S. facilities, as well as on U.S. personnel traveling between the two locations. In addition, the attacks severely wounded two other U.S. personnel, injured three Libyan contract guards, and resulted in the destruction and abandonment of both facilities.,Ambassador John Christopher Stevens, 52, was born in northern California and began his career in the Foreign Service in 1991. Ambassador Stevens served many overseas assignments and was the Deputy Chief of Mission in Libya from 2007 to 2009. From March 2011 to November 2011, Ambassador Stevens served as Special Representative to the Libyan Transitional National Council, and arrived in Tripoli in May 2012 as the U.S. Ambassador to Libya. Prior to joining the Foreign Service, Ambassador Stevens was an international trade lawyer in Washington, D.C. He previously taught English as a Peace Corps volunteer in Morocco from 1983 to 1985. Secretary of State Hillary Rodham Clinton recognized Ambassador Stevens as a “brave and good man, consummate diplomat, and an American hero.”,Sean Smith, 34, was born in San Diego, California and enlisted in the Air Force in 1995, serving as a ground radio maintenance specialist and Staff Sergeant. Smith joined the Foreign Service in 2002 as an Information Management Officer, serving in various overseas assignments, including Baghdad, Pretoria, Montreal, and The Hague. Smith traveled to Benghazi in September 2012 to provide communications and management support to the U.S. Temporary Mission Facility.,Glen Anthony Doherty, 42, was born in Winchester, Massachusetts and enlisted as a Navy SEAL in 1995, serving in both Iraq and Afghanistan during his career. Prior to joining the Navy, Doherty also worked as a professional ski instructor, attended flight school, and was an experienced paramedic and flight trainer. In 2005, Doherty began working as a contract protective officer, providing security for American officials overseas. Doherty traveled to Benghazi in September 2012 to provide security for U.S. personnel.,Tyrone Snowden Woods, 41, was born in Portland, Oregon and served twenty years as a Navy SEAL, serving multiple tours in Somalia, Iraq, and Afghanistan. Woods was also a registered nurse and a certified paramedic. In 2010, Woods began working as a contract protective officer, providing security for American officials overseas. He served all over the world protecting officers. Woods traveled to Benghazi in September 2012 to provide security for U.S. personnel."}, {"Page_url": "https://rewardsforjustice.net/rewards/kidnapping-and-murder-of-daniel-pearl-karachi-pakistan-january-23-2002/", "Title": "Kidnapping and Murder of Daniel Pearl (Karachi, Pakistan | January 23, 2002) – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "", "date_of_birth": null, "associated_organisation": null, "associated_location": "Pakistan", "about": "Rewards for Justice is offering a reward of up to $5 million for information on the kidnapping and murder of Daniel Pearl. Pearl, the South Asia Bureau Chief for the Wall Street Journal, was kidnapped in Karachi, Pakistan, on January 23, 2002. In February 2002, a video was posted on the internet depicting his murder. Pearl’s remains were found in May 2002 and returned to the United States. ,In June 2002, Ahmed Omar Saeed Sheikh was indicted in the United States for hostage-taking and conspiracy to commit hostage-taking, resulting in the murder of Pearl, as well as the 1994 kidnapping of another U.S. citizen in India. On July 15, 2002, Sheikh and three other suspects were convicted in Pakistan, and Sheikh received the death penalty. ,In January 2021, the Pakistani Supreme Court acquitted those involved in Pearl’s kidnapping and murder. The United States recognizes past Pakistani actions to hold Sheikh accountable and notes that Sheikh remains detained under Pakistani law. The Pakistani government is expected to review its legal options to ensure that justice is served. The United States is also prepared to prosecute Sheikh for his horrific crimes against an American citizen."}, {"Page_url": "https://rewardsforjustice.net/rewards/attacks-on-world-trade-center-and-pentagon-september-11-2001/", "Title": "Attacks on World Trade Center and Pentagon (September 11, 2001) – Rewards For Justice", "Reward_amount": "Up to $25 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/sept_11-1.jpeg", "date_of_birth": null, "associated_organisation": "Al-Qa’ida (AQ)", "associated_location": "United States of America", "about": "Rewards for Justice is offering a reward of up to $25 million for information on the September 11, 2001 attacks on the World Trade Center and Pentagon. Nineteen terrorists associated with al-Qa’ida (AQ) hijacked four commercial airliners en route to California, originating from three different airports in the eastern United States. The terrorists crashed two aircraft into the main towers of the World Trade Center in New York City, New York, and a third into the western side of the Pentagon in Arlington, Virginia. The fourth aircraft crashed near Shanksville, Pennsylvania, while the passengers attempted to overtake the hijackers. Overall, the attacks killed nearly 3,000 citizens of countries spanning the globe. The now-deceased leader of AQ, Usama bin Ladin, claimed responsibility for planning and implementing these attacks in a video message following the events.,The first two planes, which departed from Boston Logan International Airport, were hijacked and crashed into the main towers of the World Trade Center in New York City. The impact of these planes and the ensuing fires from burning jet fuel damaged the tower structures to the point of collapse. The assault on the towers killed more than 2,600 people.,A third plane, which departed from Washington Dulles International Airport, was hijacked and crashed into the southwest side of the Pentagon just half an hour after the second plane struck the World Trade Center. The impact killed all passengers on the aircraft, 125 people inside the building, and severely damaged the structure.,The fourth plane departed from Newark International Airport and was probably destined for the U.S. Capitol or the White House. However, the passengers onboard fought the terrorists for control of the plane. Because of these brave citizens, the terrorists never achieved their goal, and the plane crashed near Shanksville, Pennsylvania, killing all 40 people on board.,These attacks were the most devastating assault on the United States by an outside force since Pearl Harbor in 1941."}, {"Page_url": "https://rewardsforjustice.net/rewards/attack-on-u-s-embassy-athens-greece-january-12-2007/", "Title": "Attack on U.S. Embassy (Athens, Greece | January 12, 2007) – Rewards For Justice", "Reward_amount": "Up to $1 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/10/tl-2007-img-300x198.jpg", "date_of_birth": null, "associated_organisation": "Revolutionary Organization 17 November (17N)", "associated_location": "Greece", "about": "Rewards for Justice is offering a reward of up to $1 million for information on the January 12, 2007 rocket-propelled grenade attack on the U.S. Embassy in Athens, Greece. The group claiming responsibility, Revolutionary Struggle, is believed to be an offshoot of the Greek terrorist group 17 November."}, {"Page_url": "https://rewardsforjustice.net/rewards/bombing-of-american-diplomatic-convoy-beit-hanoun-gaza-strip-october-15-2003/", "Title": "Bombing of American Diplomatic Convoy (Beit Hanoun, Gaza Strip | October 15, 2003) – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/gaza_strip_bombing.jpeg", "date_of_birth": null, "associated_organisation": null, "associated_location": "Gaza Strip", "about": "Rewards for Justice is offering a reward of up to $5 million for information on the 2003 bombing of a U.S. diplomatic convoy in Beit Hanoun in the Gaza Strip. On October 15, 2003, a vehicle carrying four U.S. security personnel was attacked by a vehicle-borne improvised explosive device, which killed three of the individuals and seriously injured the fourth. The victims were providing security to representatives from the Office of the U.S. Middle East Envoy who were en route to Gaza to interview Palestinian student applicants for a Fulbright scholarship."}, {"Page_url": "https://rewardsforjustice.net/rewards/bombings-of-residential-compounds-riyadh-saudi-arabia-may-12-2003/", "Title": "Bombings of Residential Compounds (Riyadh, Saudi Arabia | May 12, 2003) – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/10/tl-2003-2-img-300x198.jpg", "date_of_birth": null, "associated_organisation": "Al-Qa’ida (AQ)", "associated_location": "Saudi Arabia", "about": "Rewards for Justice is offering a reward of up to $5 million for information on the 2003 residential compound bombings in the Saudi capital. On May 12, 2003, at least 15 assailants attacked three residential compounds in suburban Riyadh. After breaching manned security barriers, the attackers detonated car bombs in the compounds, killing 35 people, including nine Americans, and injuring nearly 200 others. The targeted facilities employed and housed a large number of Westerners, specifically U.S. and British citizens. Al-Qa’ida organized and coordinated the attack."}, {"Page_url": "https://rewardsforjustice.net/rewards/murder-and-kidnapping-of-american-citizens-caqueta-colombia-february-2003/", "Title": "Murder and Kidnapping of American Citizens (Caqueta, Colombia | February 2003) – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2020/10/tl-2003-img-1-300x198.jpg", "date_of_birth": null, "associated_organisation": null, "associated_location": "Colombia", "about": "Rewards for Justice is offering a reward of up to $5 million for information on the 2003 kidnapping and murder of U.S. citizens in Colombia. On February 13, 2003, a U. S. government plane on a counter-drug mission crash landed in Caqueta, Colombia. Members of the left-wing rebel group in Colombia known as the Revolutionary Armed Forces of Colombia (FARC) killed U.S. citizen Thomas Janis and Colombian Sergeant Luis Alcides Cruz. The rebels also took hostage three other U.S. citizens who had been aboard the plane: Marc Gonsalves, Thomas Howes, and Keith Stansell."}, {"Page_url": "https://rewardsforjustice.net/rewards/attack-on-uss-cole-aden-yemen-october-12-2000/", "Title": "Attack on USS Cole (Aden, Yemen | October 12, 2000) – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/uss_cole.jpeg", "date_of_birth": null, "associated_organisation": "Al-Qa’ida (AQ)", "associated_location": "Yemen", "about": "Rewards for Justice is offering a reward of up to $5 million for information on the USS Cole attack. On October 12, 2000, two suicide bombers rammed a small explosives-laden boat into the USS Cole — a U.S. Navy guided missile destroyer — in the harbor at Aden, Yemen, during a routine refueling stop. The resulting explosion opened a large hole in the side of the ship, killed 17 sailors, and wounded more than 30 others. The attack was planned by members of al-Qa’ida, including now-deceased operatives Jamal Ahmed Mohammed Ali al-Badawi and Fahd Mohammed Ahmed al-Quso."}, {"Page_url": "https://rewardsforjustice.net/rewards/bombing-of-u-s-embassies-kenya-and-tanzania-august-7-1998/", "Title": "Bombing of U.S. Embassies (Kenya and Tanzania | August 7, 1998) – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/embassy_bombing_4-196x300.jpeg,https://rewardsforjustice.net/wp-content/uploads/2021/07/embassy_bombing_2-300x211.jpeg,https://rewardsforjustice.net/wp-content/uploads/2021/07/embassy_bombing_1-300x222.jpeg,https://rewardsforjustice.net/wp-content/uploads/2021/07/embassy_bombing_3-300x200.jpeg,https://rewardsforjustice.net/wp-content/uploads/2021/07/embassy_bombing_5-300x194.jpeg", "date_of_birth": null, "associated_organisation": "Al-Qa’ida (AQ)", "associated_location": "Kenya , Tanzania", "about": "Rewards for Justice is offering a reward of up to $5 million for information on the 1998 U.S. Embassy bombings in Kenya and Tanzania. On August 7, 1998, members of the terrorist group al-Qa’ida (AQ) simultaneously bombed the U.S. Embassies in Nairobi and Dar es Salaam. The attacks killed 224 people, injured more than 5,000 others, and resulted in severe damage to the embassy buildings and the destruction of nearby structures.,In Nairobi, terrorists detonated a truck loaded with explosives near the embassy’s parking garage, killing 213 individuals — including 44 embassy employees (12 Americans and 32 foreign nationals) — and injuring more than 5,000 others, including U.S. Ambassador Prudence Bushnell.,In Dar es Salaam, terrorists driving a truck loaded with explosives tried to ram the gate of the embassy, shot at the chancery, and then detonated their explosives. The resulting blast killed 11 people and injured 85.,The following individuals were tried and convicted in U.S. federal court in connection with the attacks:,A U.S. federal grand jury indicted Abdullah Ahmed Abdullah, Anas al-Libi, Mohammed Atef, and Usama bin Ladin for their roles in the attacks. All former key leaders of AQ, are now deceased.,Rewards for Justice is also offering a reward for information on AQ leader ,, who was indicted for his role in the Embassy bombings."}, {"Page_url": "https://rewardsforjustice.net/rewards/consulate-murders-karachi-pakistan-march-8-1995/", "Title": "Consulate Murders (Karachi, Pakistan | March 8, 1995) – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/karachi_consulate_murders.jpeg", "date_of_birth": null, "associated_organisation": null, "associated_location": "Pakistan", "about": "Rewards for Justice is offering a reward of up to $5 million for information on the 1995 murders of two U.S. Consulate General employees in Karachi, Pakistan. On March 8, 1995, a white van was carrying U.S. Consulate employees to work when a yellow taxi swerved in front of it at a busy intersection, forcing it to stop. Another car then prevented the van from moving. Masked terrorists armed with automatic rifles opened fire on the van, killing two of the consulate employees and wounding another."}, {"Page_url": "https://rewardsforjustice.net/rewards/bombing-of-khobar-towers-dhahran-saudi-arabia-june-25-1996/", "Title": "Bombing of Khobar Towers (Dhahran, Saudi Arabia | June 25, 1996) – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/khobar_towers.jpeg", "date_of_birth": null, "associated_organisation": "Saudi Hizballah", "associated_location": "Saudi Arabia", "about": "Rewards for Justice is offering a reward of up to $5 million for information on the 1996 bombing of Khobar Towers near Dhahran, Saudi Arabia. On June 25, 1996, members of Saudi Hizballah detonated a tanker truck containing plastic explosives in the parking lot of Khobar Towers, a residential complex used to house U.S. military personnel. The blast all but destroyed the nearest building, killed 19 U.S. service members and one Saudi citizen, and wounded hundreds of individuals from various nations.,On June 21, 2001, a U.S. federal grand jury indicted 14 individuals connected to the attack. Among those indicted were ,, ,, ,, and ,, for each of whom Rewards for Justice is offering a reward of up to $5 million for information."}, {"Page_url": "https://rewardsforjustice.net/rewards/letter-bomb-incidents-u-s-u-k-december-1996-to-january-1997/", "Title": "Letter Bomb Incidents (U.S./U.K. | December 1996 to January 1997) – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "", "date_of_birth": null, "associated_organisation": null, "associated_location": "Egypt , United Kingdom , United States of America", "about": "Rewards for Justice is offering a reward of up to $5 million for information on the Letter Bomb Incidents.  Between December 1996 and January 1997, 16 letter bombs disguised as holiday greeting cards were delivered through the mail to recipients in the United States and the United Kingdom.,Of these letter bombs, 13 were received at the offices of the al-Hayat newspaper in New York City, Washington, D.C., and London. One bomb exploded in London, seriously injuring two people. The other three letter bombs were discovered at the U.S. federal penitentiary in Leavenworth, Kansas.,Each of the letter bombs bore an Alexandria, Egypt postmark dated December 21, 1996, and none contained a return address. The bombs were in plain white envelopes with computer-generated addresses and various other markings."}, {"Page_url": "https://rewardsforjustice.net/rewards/murders-of-john-granville-and-abdelrahman-abbas-rahama-khartoum-sudan-january-1-2008/", "Title": "Murders of John Granville and Abdelrahman Abbas Rahama (Khartoum, Sudan | January 1, 2008) – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "", "date_of_birth": null, "associated_organisation": "Al-Qa’ida in the Lands of the Two Niles (AQTN)", "associated_location": "Sudan", "about": "Rewards for Justice is offering a reward of up to $5 million for information on the murders of U.S. Agency for International Development (USAID) employees John Granville and Abdelrahman Abbas Rahama. On January 1, 2008, Granville and Rahama were heading home after a New Year’s Eve party in Khartoum when they were shot and killed. Two groups separately claimed responsibility for the murders: the now-defunct al-Qa’ida in the Land of the Two Niles (AQTN) and Ansar al-Tawhid (Supporters of Monotheism).,Five men were tried and convicted in the Sudanese legal system for their involvement in the murders. Abdelraouf Abu Zaid Mohamed Hamza, Mohamed Makawi Ibrahim Mohamed, Abdelbasit Alhaj Alhassan Haj Hamad, and Mohanad Osman Yousif Mohamed were sentenced to death by hanging, but they escaped from Khartoum’s Khober Prison one year after their conviction. Mohanad reportedly died in Somalia in May 2011. Abdelraouf was recaptured by Sudanese authorities. , and , remain at large.,John Granville, 33, a former Peace Corps Volunteer and researcher in Cameroon, had been working for USAID in southern Sudan for over three years. His work centered on democracy and governance programs, in which he distributed more than 50,000 wind-up, solar radios to help the citizens in the region exercise their rights and prepare for elections.,Abdelrahman Abbas Rahama, 39, had been working with USAID since 2004 as one of the original members of the USAID Disaster Assistance Response Team for Darfur, Sudan. He later became a driver for the USAID/Sudan mission in Khartoum."}, {"Page_url": "https://rewardsforjustice.net/rewards/assault-on-tourists-bwindi-park-uganda-march-1-1999/", "Title": "Assault on Tourists (Bwindi Park, Uganda | March 1, 1999) – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/bwindi_park_rfj_briefcase_money-1.jpeg", "date_of_birth": null, "associated_organisation": null, "associated_location": "Uganda", "about": "Rewards for Justice is offering a reward of up to $5 million for information on the 1999 assault on tourists in Bwindi Park, Uganda.,On March 1, 1999, members of the Liberation Army of Rwanda (ALIR) attacked unarmed tourists and their guides at Bwindi Impenetrable National Park in Uganda. This tour group was assaulted, taken hostage, and forced to march toward the Democratic Republic of the Congo. One Ugandan, Paul Ross Wagaba, was burned alive. Eight of the victims, including Americans Susan Miller and Robert Haubner, were beaten to death.,A handwritten note was given to the survivors by the leader of the attackers, stating that the attack was to send a message to the United States and other countries to abstain from supporting the Rwandan government."}, {"Page_url": "https://rewardsforjustice.net/rewards/union-texas-petroleum-murders-karachi-pakistan-november-12-1997/", "Title": "Union Texas Petroleum Murders (Karachi, Pakistan | November 12, 1997) – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/utp_murders_egbu-1.jpeg,https://rewardsforjustice.net/wp-content/uploads/2021/07/utp_murders_enlow-1.jpeg,https://rewardsforjustice.net/wp-content/uploads/2021/07/utp_murders_mirza-1.jpeg,https://rewardsforjustice.net/wp-content/uploads/2021/07/utp_murders_richie-1.jpeg", "date_of_birth": null, "associated_organisation": null, "associated_location": "Pakistan", "about": "Rewards for Justice is offering a reward of up to $5 million for information on the Union Texas Petroleum (UTP) murders. On November 12, 1997, four UTP employees were on their way to work in Karachi, Pakistan. As their station wagon crossed a bridge leading to the UTP office building, two gunmen jumped out of a red Honda Civic and fired into the car. All four U.S. employees, as well as their Pakistani driver, were killed in the attack.,The attack may have been retaliation for the conviction in the U.S. federal court of Mir Aimal Kansi just two days earlier. Kansi was responsible for the 1993 murder of two CIA employees outside the agency’s headquarters in Langley, Virginia."}, {"Page_url": "https://rewardsforjustice.net/rewards/kidnapping-and-murder-of-u-s-marine-corps-colonel-william-higgins-lebanon-february-17-1988/", "Title": "Kidnapping and Murder of U.S. Marine Corps Colonel William Higgins (Lebanon | February 17, 1988) – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/d318bcdf.jpeg", "date_of_birth": null, "associated_organisation": "Hizballah", "associated_location": "Lebanon", "about": "Rewards for Justice is offering a reward of up to $5 million for information on the kidnapping and murder of U.S. Marine Corps Colonel William Higgins. Higgins was part of a United Nations peacekeeping mission in southern Lebanon when he was kidnapped on February 17, 1988. His captors tortured and interrogated Higgins before killing him. Higgins was among the 100 victims, mostly Westerners, whom Hizballah and Hizballah-linked terrorists kidnapped and held hostage during the decade-long Lebanon hostage crisis."}, {"Page_url": "https://rewardsforjustice.net/rewards/kidnapping-and-murder-of-william-buckley-beirut-lebanon-march-16-1984/", "Title": "Kidnapping and Murder of William Buckley (Beirut, Lebanon | March 16, 1984) – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/3c173212.jpeg", "date_of_birth": null, "associated_organisation": "Hizballah", "associated_location": "Lebanon", "about": "Rewards for Justice is offering a reward of up to $5 million for information on the kidnapping and murder of William Buckley. Buckley was the CIA station chief in Lebanon, a role for which he volunteered after the 1983 U.S. Embassy Beirut bombing that killed 63 people, including 17 Americans. On March 16, 1984, Buckley was kidnapped in Beirut on his way to work. He was interrogated and tortured before he died in captivity on June 3, 1985. Buckley was among the 100 victims, mostly Westerners, whom Hizballah and Hizballah-linked terrorists kidnapped and held hostage during the decade-long Lebanon hostage crisis."}, {"Page_url": "https://rewardsforjustice.net/rewards/sajid-mir/", "Title": "Sajid Mir – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/sajid-mir-242x300.png", "date_of_birth": "\n\t\t\t\t\t\t\tJanuary 1, 1978; January 31, 1976\t\t\t\t\t\t", "associated_organisation": "Lashkar-e Tayyiba (LeT)", "associated_location": "Pakistan", "about": "Rewards for Justice is offering a reward of up to $5 million for information on Sajid Mir, also known as Sajid Majid Chuhdri and Sajid Majid. Mir, a senior member of the Pakistan-based Foreign Terrorist Organization (FTO) Lashkar-e-Tayyiba (LeT), is wanted for his involvement in the November 2008 terrorist attacks in Mumbai, India. Mir was LeT’s operations manager for the attacks, playing a leading role in their planning, preparation, and execution.,Beginning November 26, 2008, and continuing through November 29, 2008, 10 individuals trained by LeT, carried out a series of coordinated terrorist attacks against multiple targets in Mumbai, India, killing 166 people. Six Americans were among those killed during the 3-day siege: Ben Zion Chroman, Gavriel Holtzberg, Sandeep Jeswani, Alan Scherr, Naomi Scherr, and Aryeh Leibish Teitelbaum.,Mir has been a senior member of LeT since approximately 2001. From 2006 to 2011, Mir was in charge of LeT’s external operations and planned and directed various terrorist attacks on behalf of the group. Additionally, Mir allegedly conspired to commit a terrorist attack against a newspaper and its employees in Denmark between 2008 and 2009.,For his role in the Mumbai attacks attack, Mir was indicted in the United States in April 2011. On August 30, 2012, the U.S. Department of the Treasury designated Mir as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result of this designation, among other consequences, all property and interests in property of Mir that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with Mir. In addition, it is a crime to knowingly provide, or attempt or conspire to provide, material support or resources to the FTO LeT. Mir is on the FBI’s Most Wanted Terrorists List. He is believed to reside in Pakistan."}, {"Page_url": "https://rewardsforjustice.net/rewards/abdul-reza-shahlai/", "Title": "Abdul Reza Shahla’i – Rewards For Justice", "Reward_amount": "Up to $15 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/Shahlai.jpeg", "date_of_birth": "\n\t\t\t\t\t\t\tCirca 1957\t\t\t\t\t\t", "associated_organisation": "Islamic Revolutionary Guard Corps-Qods Force (IRGC-QF)", "associated_location": "Iran , Yemen", "about": "Rewards for Justice is offering a reward of up to $15 million for information on the financial activities, networks, and associates of Abdul Reza Shahla’i, also known as ‘Yusuf Abu al-Karkh’ and Hajji Yusef. Shahla’i is a high-ranking commander in Iran’s Islamic Revolutionary Guard Corps–Qods Force (IRGC-QF), based in Sanaa, Yemen. Shahla’i has a long history of targeting Americans and U.S. allies globally.,Shahla’i planned multiple assassinations of coalition forces in Iraq, provided weapons and explosives to Shia extremist groups, and planned the January 20, 2007 attack in Karbala, Iraq, that killed five U.S. soldiers and wounded three others.,As a financier and senior IRGC official, in 2011, Shahla’i funded and directed the plot to assassinate the Saudi Ambassador to the United States in Washington, D.C. Shahla’i also planned follow-on attacks inside the United States and elsewhere. Had this scheme succeeded, as many as 200 innocent civilians in the United States could have been killed.,On October 11, 2011, the U.S. Department of the Treasury designated Shahla’i as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. Previously, in 2008, the Department of the Treasury designated Shahla’i pursuant to Executive Order 13438 for threatening the peace and stability of Iraq and the Government of Iraq. As a result of these actions, among other consequences, all property, and interests in property, of Shahla’i that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with Shahla’i. In addition, it is a crime to knowingly provide, or attempt or conspire to provide, material support to the IRGC, a U.S.-designated Foreign Terrorist Organization. He was also designated by Bahrain, the European Union, Saudi Arabia, and the United Kingdom in 2018."}, {"Page_url": "https://rewardsforjustice.net/rewards/adham-husayn-tabaja/", "Title": "Adham Husayn Tabaja – Rewards For Justice", "Reward_amount": "Up to $10 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/tabaja-300x213.png,https://rewardsforjustice.net/wp-content/uploads/2021/07/AdhamHusaynTabaja.png", "date_of_birth": "\n\t\t\t\t\t\t\tOctober 24, 1967\t\t\t\t\t\t", "associated_organisation": "Hizballah", "associated_location": "", "about": "Rewards for Justice is offering a reward of up to $10 million for information that leads to the disruption of the financial mechanisms of Hizballah. Adham Husayn Tabaja, also known as Adham Tabaja, is a Hizballah member who maintains direct ties to senior Hizballah organizational elements, including the terrorist group’s operational component, Islamic Jihad.,Tabaja also holds properties in Lebanon on behalf of Hizballah. He is the majority owner of the Lebanon-based real estate development and construction firm Al-Inmaa Group for Tourism Works, which the U.S. Department of the Treasury sanctioned in June 2015. Tabaja’s company Al-Inmaa Engineering and Contracting has been one of the largest and most successful real estate businesses in Lebanon since the late 1990s and has been used by Hizballah as an investment mechanism. In 2006, Tabaja used his ties to Hizballah leadership to create a construction monopoly for Al-Inmaa Engineering and Contracting in the Hizballah-controlled Dahieh section of Beirut and southern Lebanon.,More recently, Tabaja has used the Iraqi branches of Al-Inmaa Engineering and Contracting to obtain oil and construction development projects in Iraq that provide both financial support and organizational infrastructure to Hizballah. Tabaja and his companies have also sought to secure lucrative business contracts in the Green Zone areas of Baghdad, Iraq. Tabaja has worked with Hizballah officials, including Hizballah political official Muhammad Kawtharani, for these projects.,On June 10, 2015, the U.S. Department of the Treasury designated Tabaja as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result of this designation, among other consequences, all property and interests in property of Tabaja that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with Tabaja. In addition, it is a crime to knowingly provide, or attempt or conspire to provide, material support or resources to Hizballah, a U.S.-designated Foreign Terrorist Organization. Saudi Arabia has also designated Tabaja and his companies as terrorist entities."}, {"Page_url": "https://rewardsforjustice.net/rewards/ali-qasir/", "Title": "Ali Qasir – Rewards For Justice", "Reward_amount": "Up to $10 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/qasir.jpeg", "date_of_birth": "\n\t\t\t\t\t\t\tJuly 29, 1992\t\t\t\t\t\t", "associated_organisation": "Hizballah", "associated_location": "Iran", "about": "Rewards for Justice is offering a reward of up to $10 million for information that leads to the disruption of the financial mechanisms of Hizballah. Ali Qasir is a Hizballah representative in Iran and is a key facilitator of financial and commercial activities that benefit Iran’s Islamic Revolutionary Guard Corps-Qods Force (IRGC-QF) and Hizballah. He is also the nephew of Hizballah official Muhammad Qasir, with whom he works closely to facilitate financial activities between the IRGC-QF and Hizballah.,Ali Qasir is also the managing director of the Hizballah-linked front company Talaqi Group, which finances oil shipments for the IRGC-QF. Ali Qasir assigns maritime vessels to deliver shipments for the terrorist network based on the IRGC-QF’s guidance. Ali Qasir’s responsibilities include negotiating sales prices for goods and settling shipping vessel-related payments. Ali Qasir has overseen sales price negotiations and collaborated to cover expenses and facilitate an Iranian oil shipment by the ADRIAN DARYA 1 for the benefit of the IRGC-QF. Ali Qasir represents the Lebanon-based Hokoul S.A.L. Offshore company in negotiations over its supply of Iranian crude oil to Syria. Additionally, Ali Qasir has schemed and worked with others to use the Talaqi Group to facilitate the sale of tens of millions of dollars worth of steel.,On September 4, 2019, the U.S. Department of the Treasury designated Ali Qasir as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result of this designation, among other consequences, all property, and interests in property, of Ali Qasir that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with Ali Qasir. In addition, it is a crime to knowingly provide, or attempt or conspire to provide, material support or resources to Hizballah, a U.S.-designated Foreign Terrorist Organization."}, {"Page_url": "https://rewardsforjustice.net/rewards/kidnapping-and-murder-of-peter-kilburn/", "Title": "Kidnapping and Murder of Peter Kilburn (Beirut, Lebanon | December 3, 1984) – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/kilburn.jpeg", "date_of_birth": null, "associated_organisation": "Hizballah", "associated_location": "Lebanon", "about": "Rewards for Justice is offering a reward of up to $5 million for information on the kidnapping and murder of Peter Kilburn. Kilburn was a librarian at the American University of Beirut. On December 3, 1984, he was reported missing. Sixteen months later, his body was found along with those of two other captives. The victims had been shot and then dumped in the mountains east of Beirut. Kilburn was among the 100 victims, mostly Westerners, whom Hizballah and Hizballah-linked terrorists kidnapped and held hostage during the decade-long Lebanon hostage crisis."}, {"Page_url": "https://rewardsforjustice.net/rewards/muhammad-kawtharani/", "Title": "Muhammad Kawtharani – Rewards For Justice", "Reward_amount": "Up to $10 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/kawtharani-178x300.jpeg", "date_of_birth": "\n\t\t\t\t\t\t\t1945; 1959; 1961\t\t\t\t\t\t", "associated_organisation": "Hizballah", "associated_location": "Iraq", "about": "Rewards for Justice is offering a reward of up to $10 million for information on the activities, networks, and associates of Muhammad Kawtharani, also known as Jafar Kawtharani. Kawtharani is a senior leader of Hizballah’s forces in Iraq. Kawtharani assumed some of the political coordination of Iraq-based, Iran-aligned paramilitary groups formerly organized by now-deceased Islamic Revolutionary Guard Corps general Qasem Soleimani.,Kawtharani facilitates operations of groups outside the control of the Government of Iraq that have violently suppressed protests, attacked foreign diplomatic missions, and engaged in widespread organized criminal activity. As a member of Hizballah’s Political Council, Kawtharani has promoted Hizballah efforts to provide training, funding, and political and logistical support to Iraqi Shia insurgent groups. Kawtharani has also assisted extremists transiting to Syria to support the Assad regime.,On August 22, 2013, the U.S. Department of the Treasury designated Kawtharani as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result of this designation, among other consequences, all property and interests in property of Kawtharani that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with Kawtharani. In addition, it is a crime to knowingly provide, or attempt or conspire to provide, material support or resources to Hizballah, a U.S.-designated Foreign Terrorist Organization."}, {"Page_url": "https://rewardsforjustice.net/rewards/isis-kidnapping-networks-clerics-syria-2013/", "Title": "ISIS Kidnapping Networks – Clerics (Syria | February-July 2013) – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/ChristianClericsWebpageHeader-1-300x226.jpeg", "date_of_birth": null, "associated_organisation": "Islamic State in Iraq and Syria (ISIS)", "associated_location": "Syria", "about": "Rewards for Justice is offering a reward of up to $5 million for information on ISIS kidnapping networks or for information leading to the location, recovery, and return of Maher Mahfouz, Michael Kayyal, Gregorios Ibrahim, Bolous Yazigi, and Paolo Dall’Oglio.,On February 9, 2013, Greek Orthodox priest Maher Mahfouz and Armenian Catholic priest Michael Kayyal were on a public bus traveling to a monastery in Kafrun, Syria. Approximately 30 kilometers outside of Aleppo, Syria, suspected ISIS extremists stopped the vehicle, checked passengers’ documents, then removed Mahfouz and Kayyal from the bus. They have not been seen or heard from since.,On April 22, 2013, Syrian Orthodox Archbishop Gregorios Ibrahim traveled from Aleppo to Turkey to pick up Greek Orthodox Archbishop Bolous Yazigi. When they reached a checkpoint near al-Mansoura, Syria, several armed men ambushed the archbishops and seized their vehicle. The clerics’ driver was later found dead. The archbishops are believed to have been kidnapped by persons aligned with al-Nusra Front, an al-Qa’ida affiliate; however, the archbishops were later transferred to ISIS.,On July 29, 2013, ISIS abducted Italian Jesuit priest Paolo Dall’Oglio in Raqqah, Syria. Father Dall’Oglio had planned to meet with ISIS to ask for the release of Mahfouz, Kayyal, Ibrahim, and Yazigi. He has not been seen or heard from since."}, {"Page_url": "https://rewardsforjustice.net/rewards/disruption-of-hizballah-financial-mechanisms/", "Title": "Hizballah’s Financial Network – Rewards For Justice", "Reward_amount": "Up to $10 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/LebaneseHizballahFlag.jpeg", "date_of_birth": null, "associated_organisation": "Hizballah", "associated_location": "", "about": "Rewards for Justice is offering a reward of up to $10 million for information leading to the disruption of the financial mechanisms of Hizballah. Hizballah relies on financing and facilitation networks to sustain operations and launch attacks globally. Hizballah earns almost one billion dollars annually through direct financial support from Iran, international businesses and investments, donor networks, corruption, and money laundering activities.,Hizballah uses funds to support its malign activities throughout the world, including: deployment of its militia members to Syria in support of the Assad dictatorship; alleged operations to conduct surveillance and gather intelligence in the United States; and enhanced military capabilities to the point that Hizballah claims to possess precision-guided missiles. These terrorist operations are funded through Hizballah’s international network of financial supporters and activities — financial enablers and infrastructure that form the group’s lifeblood. Hizballah receives a significant amount of weapons, training, and funding from Iran, a U.S. Department of State-designated State Sponsor of Terrorism.,On October 8, 1997, the Department of State designated Hizballah as a Foreign Terrorist Organization under section 219 of the Immigration and Nationality Act, as amended. Later, on October 31, 2001, the Department of State designated Hizballah as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result, all of Hizballah’s property, and interests in property, subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with Hizballah. It is a crime to knowingly provide, or to attempt or conspire to provide, material support or resources to Hizballah.,The Department of State is offering rewards for information leading to the identification and disruption of:"}, {"Page_url": "https://rewardsforjustice.net/rewards/jamaat-ul-ahrar-jua/", "Title": "Jamaat-ul-Ahrar (JuA) – Rewards For Justice", "Reward_amount": null, "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/JUA-300x169.png", "date_of_birth": null, "associated_organisation": null, "associated_location": "", "about": "Jamaat-ul-Ahrar (JuA) is a militant group affiliated with U.S.-designated Foreign Terrorist Organization Tehrik-e Taliban Pakistan (TTP). Founded by former TTP leader Abdul Wali in August 2014, JuA has staged multiple attacks in Pakistan targeting civilians, religious minorities, military personnel, and law enforcement. In August 2015, JuA claimed responsibility for a suicide bombing in Punjab, Pakistan that killed Punjab Home Minister Shuja Khanzada and 18 of his supporters. JuA was responsible for the killing of two Pakistani employees of the U.S. Consulate in Peshawar in early March 2016. In late March 2016, JuA carried out the suicide assault at the Gulshan-e-Iqbal amusement park in Lahore, Pakistan, that killed more than 70 people—nearly half of them women and children—and injured hundreds more.,On August 3, 2016, the U.S. Department of State designated JuA as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result, all of JuA’s property, and interests in property, subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with JuA."}, {"Page_url": "https://rewardsforjustice.net/rewards/15-may-organization/", "Title": "15 May Organization – Rewards For Justice", "Reward_amount": null, "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/h-300x217.jpg", "date_of_birth": null, "associated_organisation": null, "associated_location": "", "about": "The now-defunct 15 May Organization terrorist group was formed in 1979. The group sought to promote the Palestinian cause by killing Israeli and U.S. citizens and by causing damage to Israeli and American interests around the world. The 15 May Organization claimed responsibility for several attacks, including the August 1982 bombing of Pan Am Flight 830 that killed a 16-year-old passenger and wounded 16 others."}, {"Page_url": "https://rewardsforjustice.net/rewards/abu-nidal-organization-ano/", "Title": "Abu Nidal Organization (ANO) – Rewards For Justice", "Reward_amount": null, "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/H-2-300x217.jpg", "date_of_birth": null, "associated_organisation": null, "associated_location": "", "about": "The Abu Nidal Organization (ANO) was formed in 1974 after splitting from the Palestine Liberation Organization. ANO advocated for the elimination of Israel and sought to derail diplomatic efforts in support of the Middle East peace process. The group bore responsibility for many terrorist attacks, including the bombing of TWA Flight 840 (hyperlink) and the hijacking of Pan Am Flight 73 (hyperlink).,On October 8, 1997, the U.S. Department of State designated ANO as a Foreign Terrorist Organization (FTO) under section 219 of the Immigration and Nationality Act, as amended. On June 1, 2017, the Department of State revoked ANO’s designation as an FTO."}, {"Page_url": "https://rewardsforjustice.net/rewards/abu-sayyaf-group-asg/", "Title": "Abu Sayyaf Group (ASG) – Rewards For Justice", "Reward_amount": null, "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/abu_sayyaf_group.png", "date_of_birth": null, "associated_organisation": null, "associated_location": "", "about": "The Abu Sayyaf Group (ASG) split from the Moro National Liberation Front in the early 1990s and is one of the most violent terrorist groups in the Philippines. Influenced by al-Qa’ida early on, ASG claims to promote an independent Islamic state in western Mindanao and the Sulu Archipelago. More recently, elements of the group have established ties to ISIS’s regional affiliate ISIS-Philippines. The group has committed acts of terror across the Philippines, including bombings, assassinations, and kidnappings for ransom.,On October 8, 1997, the U.S. Department of State designated ASG as a Foreign Terrorist Organization under section 219 of the Immigration and Nationality Act, as amended. Later, on September 23, 2001, ASG was listed in the Annex to Executive Order 13224. As a result of this designation, among other consequences, all property, and interests in property, of ASG that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with ASG. In addition, it is a crime to knowingly provide, or attempt or conspire to provide, material support or resources to ASG."}, {"Page_url": "https://rewardsforjustice.net/rewards/al-mourabitoun/", "Title": "Al-Mourabitoun – Rewards For Justice", "Reward_amount": null, "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/H-2-300x217.jpg", "date_of_birth": null, "associated_organisation": null, "associated_location": "", "about": "Al-Murabitoun, originally part of al-Qa’ida in the Islamic Maghreb (AQIM), became a separate organization in late 2012 after its leader, Mokhtar Belmokhtar, split from AQIM. After the separation, Belmokhtar threatened to fight against Western interests and announced the creation of the al-Mulathamun Battalion. In 2013, the al-Mulathamun Battalion and the Mali-based Movement for Unity and Jihad in West Africa (MUJWA) announced that the two organizations would merge under the name “al-Murabitoun.” In 2015, al-Murabitoun announced a re-merger with AQIM. Al-Mourabitoun merged in 2017 with three other regional terrorist groups to form Jama’at Nasr al-Islam wal Muslimin (JNIM).,In January 2013, what is now known as al-Murabitoun claimed responsibility for the attack against the Tiguentourine gas facility near In Amenas, in southeastern Algeria. More than 800 people were taken hostage during the four-day siege. Thirty-nine civilians, including three U.S. citizens, were killed in the attack. In November 2015, al-Murabitoun operatives attacked the Radisson Blu Hotel in Bamako and took more than 170 people hostage–including U.S. citizens. Nearly 27 people were killed in the attack, among them a U.S. international development worker. Al-Murabitoun was reportedly involved in the AQIM January 2016 attack on a popular tourist hotel in Burkina Faso that killed nearly 30 people, including a U.S. citizen.,On December 19, 2013, the U.S. Department of State designated al-Murabitoun, originally under the name al-Mulathamun Battalion, as a Foreign Terrorist Organization under section 219 of the Immigration and Nationality Act, as amended. Previously, on December 18, 2013, the Department of State designated al-Mulathamun Battalion as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. Al-Murabitoun remains the group’s primary name. As a result, all of the group’s property, and interests in property, subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with al-Murabitoun/al-Mulathamun Battalion. It is a crime to knowingly provide, or to attempt or conspire to provide, material support or resources to al-Murabitoun/al-Mulathamun Battalion."}, {"Page_url": "https://rewardsforjustice.net/rewards/al-nusrah-front-anf/", "Title": "Al-Nusrah Front (ANF) – Rewards For Justice", "Reward_amount": null, "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/hayat.png", "date_of_birth": null, "associated_organisation": null, "associated_location": "", "about": "Al-Nusrah Front (ANF) was formed in late 2011 when then-al-Qa’ida in Iraq (AQI) leader Abu Bakr al-Baghdadi sent ANF leader Muhammad al-Jawlani to Syria to organize terrorist cells. In April 2013, al-Jawlani pledged allegiance to AQ leader Ayman al-Zawahiri. ANF split from AQI and became an independent entity. In January 2017, ANF merged with several other hardline opposition groups to form Hayat Tahrir al-Sham (HTS). ANF remains al-Qa’ida’s affiliate in Syria.,ANF’s stated goal is to oust Syria’s Assad regime and replace it with a Sunni Islamic state. ANF is concentrated in and controls a portion of territory in northwest Syria, where it is active as an opposition force, and exerts varying degrees of influence over local governance and external plotting. ANF has carried out multiple terrorist attacks throughout Syria, often targeting civilians.,On May 15, 2014, the U.S. Department of State designated ANF as a Foreign Terrorist Organization under section 219 of the Immigration and Nationality Act, as amended. Previously, on May 14, 2014, the Department of State designated ANF as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result, all of ANF’s property, and interests in property, subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with ANF. It is a crime to knowingly provide, or to attempt or conspire to provide, material support or resources to ANF."}, {"Page_url": "https://rewardsforjustice.net/rewards/al-qaida-aq/", "Title": "Al-Qa’ida (AQ) – Rewards For Justice", "Reward_amount": null, "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/AQ-300x150.png", "date_of_birth": null, "associated_organisation": null, "associated_location": "", "about": "Al-Qa‘ida (AQ) was organized by Usama bin Ladin in 1988 with Arabs who fought in Afghanistan against the occupying military forces of the now-defunct Soviet Union. AQ strives to eliminate Western influence from the Muslim world, topple “apostate” governments of Muslim countries, and establish a pan-Islamic caliphate governed by its own interpretation of sharia law that would ultimately be at the center of a new international order. These goals remain essentially unchanged since the group’s 1996 public declaration of war against the United States. AQ has lost dozens of mid- and senior-level operatives to counterterrorism efforts, but continues to recruit, plan, inspire, and conduct attacks. AQ has affiliated organizations in the Middle East, Africa, and Asia and its contemporary strength is primarily in these affiliates.,AQ is responsible for many large-scale, mass-casualty attacks. AQ conducted three bombings against U.S. troops in Aden, Yemen in 1992 and claimed responsibility for shooting down U.S. helicopters and killing U.S. soldiers in Somalia in 1993. AQ also carried out the August 1998 bombings of the U.S. Embassies in Nairobi and Dar es Salaam that killed 224 people and injured more than 5,000. In October 2000, AQ conducted a suicide attack on the USS Cole in the port of Aden with an explosives-laden boat that killed 17 U.S. Navy sailors and wounded more than 30. On September 11, 2001, 19 AQ members hijacked and crashed four U.S. commercial jets – two into the World Trade Center in New York City, one into the Pentagon, and the last into a field in Shanksville, Pennsylvania. The 9/11 attacks killed nearly 3,000 people.,On October 8, 1999, the U.S. Department of State designated AQ as a Foreign Terrorist Organization under section 219 of the Immigration and Nationality Act, as amended. On September 23, 2001, AQ was listed in the Annex to Executive Order 13224. As a result of this designation, among other consequences, all property, and interests in property, of AQ that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with AQ. In addition, it is a crime to knowingly provide, or attempt or conspire to provide, material support or resources to AQ."}, {"Page_url": "https://rewardsforjustice.net/rewards/al-qaida-in-iraq-aqi/", "Title": "Al-Qa’ida in Iraq (AQI) – Rewards For Justice", "Reward_amount": null, "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/H-2-300x217.jpg", "date_of_birth": null, "associated_organisation": null, "associated_location": "", "about": "Al-Qa‘ida in Iraq (AQI) was established in 2004 by deceased terrorist Abu Mus‘ab al-Zarqawi, who pledged his group’s allegiance to al-Qa’ida (AQ) leader Usama bin Ladin. In the 1990s, al-Zarqawi organized the terrorist group al-Tawhid wal-Jihad–the predecessor organization to AQI–to oppose the presence of U.S. and Western military forces in the Islamic world and the West’s support for, and the existence of, Israel. Al-Zarqawi traveled to Iraq during Operation Iraqi Freedom — the invasion of Iraq by a U.S.-led coalition of more than 40 nations — and led his group against U.S. and Coalition forces there until his death in June 2006. AQI targeted Coalition and Iraqi forces and civilians to pressure foreigners to leave Iraq, reduce Iraqi popular support for the United States and Iraqi government, and attract recruits. In October 2006, AQI publicly renamed itself the Islamic State in Iraq. The group became the Islamic State of Iraq and Syria (ISIS) in 2013 after it disassociated from AQ.,On December 17, 2004, the U.S. Department of State designated AQI (now known as ISIS) as a Foreign Terrorist Organization under section 219 of the Immigration and Nationality Act, as amended. Previously, on October 15, 2004, the Department of State designated AQI as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result, all of ISIS’s property, and interests in property, subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with ISIS. It is a crime to knowingly provide, or to attempt or conspire to provide, material support or resources to ISIS."}, {"Page_url": "https://rewardsforjustice.net/rewards/al-qaida-in-the-arabian-peninsula-aqap/", "Title": "Al-Qa’ida in the Arabian Peninsula (AQAP) – Rewards For Justice", "Reward_amount": null, "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/aqap.png", "date_of_birth": null, "associated_organisation": null, "associated_location": "", "about": "Al-Qa’ida in the Arabian Peninsula (AQAP) is an extremist group based in Yemen that emerged in January 2009 following the unification of Yemeni and Saudi terrorist elements. AQAP’s stated goals include establishing a caliphate and implementing Sharia law in the Arabian Peninsula and the wider Middle East. AQAP has targeted local, U.S., and Western interests in the Arabian Peninsula, as well as abroad. The group has claimed responsibility for numerous terrorist acts, including the January 2015 assault on the offices of satirical newspaper Charlie Hebdo in Paris that killed 12 people.,AQAP is an AQ affiliate and the AQAP emir works closely with AQ leadership to plan attacks. AQAP bomber al-Asiri designed the 2012 Christmas day airline plot underwear bomb and also sent printer bombs to the U.S. via couriers.,On January 19, 2010, the U.S. Department of State designated AQAP as a Foreign Terrorist Organization under section 219 of the Immigration and Nationality Act, as amended, and as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result, all of AQAP’s property and interests in property subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with AQAP. It is a crime to knowingly provide, or to attempt or conspire to provide, material support or resources to AQAP."}, {"Page_url": "https://rewardsforjustice.net/rewards/al-qaida-in-the-islamic-maghreb-aqim/", "Title": "Al-Qa’ida in the Islamic Maghreb (AQIM) – Rewards For Justice", "Reward_amount": null, "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/aqim.png", "date_of_birth": null, "associated_organisation": null, "associated_location": "", "about": "Originally known as the Salafist Group for Preaching and Combat, al-Qa’ida (GSPC) in the Islamic Maghreb (AQIM) materialized after the group declared allegiance to al-Qa’ida in 2006. Although AQIM remains largely a regionally-focused terrorist group in the Sahel, it has adopted a more anti-Western rhetoric and ideology.,AQIM has routinely committed acts of terror, including suicide bombings, assaults on civilian targets, and kidnapping-for-ransom operations. AQIM’s 2007 bombing of the the UN headquarters building and an Algerian government building in Algiers killed 60 people. In January 2016, AQIM carried out an attack on a hotel in Burkina Faso that killed 28 people and injured 56. In March 2016, AQIM claimed responsibility for a strike on a beach resort in Côte d’Ivoire that killed more than 16 people and wounded another 33. In January 2017, AQIM conducted a suicide attack that left more than 50 people dead in Gao, Mali.,On March 27, 2002, the U.S. Department of State designated AQIM as a Foreign Terrorist Organization under Section 219 of the Immigration and Nationality Act, as amended. Previously, on September 23, 2001, AQIM was listed in the Annex to Executive Order 13224, and consequently, is subject to sanctions under it as a Specially Designated Global Terrorist. As a result, all of AQIM’s property, and interests in property, subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with AQIM. It is a crime to knowingly provide, or to attempt or conspire to provide, material support or resources to AQIM."}, {"Page_url": "https://rewardsforjustice.net/rewards/al-qaida-in-the-lands-of-the-two-niles-aqtn/", "Title": "Al-Qa’ida in the Lands of the Two Niles (AQTN) – Rewards For Justice", "Reward_amount": null, "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/AQTN-300x225.png", "date_of_birth": null, "associated_organisation": null, "associated_location": "", "about": "Al-Qa’ida in the Land of the Two Niles (AQTN) was a Sudan-based terrorist organization that conspired to attack U.S., Western, and Sudanese targets. AQTN claimed responsibility for the January 2008 murders of U.S. Agency for International Development (USAID) diplomat John Granville and Sudanese USAID employee Abdelrahman Abbas Rahama."}, {"Page_url": "https://rewardsforjustice.net/rewards/al-shabaab/", "Title": "Al-Shabaab – Rewards For Justice", "Reward_amount": null, "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/al-shabaab-1.png", "date_of_birth": null, "associated_organisation": null, "associated_location": "", "about": "Al-Shabaab is an al-Qa’ida (AQ) affiliate and has ties to other AQ affiliates, including AQ in the Arabian Peninsula and AQ in the Islamic Maghreb. Al-Shabaab was the militant wing of the former Somali Islamic Courts Council that took over parts of southern Somalia during the second half of 2006. Since the end of 2006, al-Shabaab and associated militias have engaged in violent insurgency using guerrilla warfare and terrorist tactics against the transitional governments of Somalia.,Al-Shabaab has conducted attacks in Somalia, Kenya, Uganda, and Djibouti. Al-Shabaab was responsible for the July 11, 2010 suicide bombings in Kampala. The attack, which took place during the World Cup, killed 76 people, including a U.S. citizen. In September 2013, al-Shabaab staged a significant attack against the Westgate Mall in Nairobi. The multi-day siege resulted in the deaths of at least 65 civilians, as well as six soldiers and police officers and hundreds of others were injured. In April 2015, al-Shabaab carried out a raid with small arms and grenades on Kenya’s Garissa University College that killed 148 people.,On March 18, 2008, the U.S. Department of State designated al-Shabaab as a Foreign Terrorist Organization under section 219 of the Immigration and Nationality Act, as amended. Later, on March 19, 2008, the Department of State designated al-Shabaab as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result, all of al-Shabaab’s property, and interests in property, subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with al-Shabaab. It is a crime to knowingly provide, or to attempt or conspire to provide, material support or resources to al-Shabaab."}, {"Page_url": "https://rewardsforjustice.net/rewards/ansar-al-dine-aad/", "Title": "Ansar al-Dine (AAD) – Rewards For Justice", "Reward_amount": null, "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/AAD-1-300x182.png", "date_of_birth": null, "associated_organisation": null, "associated_location": "", "about": "Ansar al-Dine (AAD) was created in late 2011. Following the March 2012 coup that toppled the Malian government, AAD was among the organizations that took over northern Mali, destroyed UNESCO World Heritage sites, and enforced a severe interpretation of sharia law in the areas under its control. In 2017, AAD joined Jama’at Nasr al-Islam wal Muslimin (JNIM), a new coalition of al-Qa’ida-aligned groups led by AAD’s leader, Iyad ag-Ghali.,On March 22, 2013, the U.S. Department of State designated AAD as a Foreign Terrorist Organization under section 219 of the Immigration and Nationality Act, as amended. Previously, on March 21, 2013, the Department of State designated AAD as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result, all of AAD’s property, and interests in property, subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with AAD. It is a crime to knowingly provide, or to attempt or conspire to provide, material support or resources to AAD."}, {"Page_url": "https://rewardsforjustice.net/rewards/ansar-al-tawhid-supporters-of-monotheism/", "Title": "Ansar al-Tawhid (Supporters of Monotheism) – Rewards For Justice", "Reward_amount": null, "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/h-300x217.jpg", "date_of_birth": null, "associated_organisation": null, "associated_location": "", "about": "Ansar al-Tawhid (Supporters of Monotheism) claimed responsibility for the January 2008 murders of U.S. Agency for International Development (USAID) diplomat John Granville and Sudanese USAID employee Abdelrahman Abbas Rahama."}, {"Page_url": "https://rewardsforjustice.net/rewards/egyptian-islamic-jihad-eij/", "Title": "Egyptian Islamic Jihad (EIJ) – Rewards For Justice", "Reward_amount": null, "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/h-300x217.jpg", "date_of_birth": null, "associated_organisation": null, "associated_location": "", "about": "Egyptian Islamic Jihad (EIJ), also known as al-Jihad, was an Egyptian extremist group founded in the 1970s. EIJ’s primary goal was to overthrow the Egyptian Government and replace it with an Islamic state. The group specialized in armed attacks against high-level Egyptian government officials. Led by Ayman al-Zawahiri, EIJ merged with al-Qa’ida in June 2001."}, {"Page_url": "https://rewardsforjustice.net/rewards/haqqani-network-hqn/", "Title": "Haqqani Network (HQN) – Rewards For Justice", "Reward_amount": null, "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/h-300x217.jpg", "date_of_birth": null, "associated_organisation": null, "associated_location": "", "about": "The Haqqani Network (HQN) is a militant organization operating in Afghanistan and Pakistan that was formed in the late 1980s. HQN has planned and carried out numerous significant attacks and kidnappings against U.S. and Coalition Forces in Afghanistan, the Afghan government, and civilian targets. In June 2012, an HQN suicide bomb attack against a U.S. military base in Khost, Afghanistan, killed two U.S. soldiers and wounded more than 100 others. Afghan officials blamed HQN for a May 2017 truck bomb explosion in Kabul that killed more than 150 people. HQN was believed to be responsible for a January 2018 ambulance bombing in Kabul that killed more than 100 people. Afghan officials also blamed HQN for a January 2018 attack on the Intercontinental Hotel in Kabul that killed 22 people.,On September 19, 2012, the U.S. Department of State designated HQN as a Foreign Terrorist Organization under section 219 of the Immigration and Nationality Act, as amended. Previously, on September 7, 2012, the Department of State designated HQN as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result, all of HQN’s property, and interests in property, subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with HQN. It is a crime to knowingly provide, or to attempt or conspire to provide, material support or resources to HQN."}, {"Page_url": "https://rewardsforjustice.net/rewards/harakat-al-muqawama-al-islamiya-hamas/", "Title": "Harakat al-Muqawama al-Islamiya (HAMAS) – Rewards For Justice", "Reward_amount": null, "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/hamas.png", "date_of_birth": null, "associated_organisation": null, "associated_location": "", "about": "Harakat al-Muqawama al-Islamiya (Hamas) was established in 1987 at the onset of the first Palestinian uprising, or First Intifada, as an outgrowth of the Palestinian branch of the Muslim Brotherhood. Hamas has a military wing known as the Izz al-Din al-Qassam Brigades that has conducted many anti-Israel attacks in both Israel and the Palestinian territories since the 1990s. These attacks have included large-scale bombings against Israeli civilian targets, small-arms attacks, improvised roadside explosives, and rocket attacks. Hamas claimed responsibility for the August 2001 bombing of a Jerusalem Sbarro pizzeria that killed 15 people, including two Americans, and injured more than 120. In April 2016, a Hamas member carried out a suicide attack on a bus in Jerusalem that killed 20 people.,On October 8, 1997, the U.S. Department of State designated Hamas as a Foreign Terrorist Organization under section 219 of the Immigration and Nationality Act, as amended. Later, on October 31, 2001, the Department of State designated Hamas as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result, all of Hamas’ property, and interests in property, subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with Hamas. It is a crime to knowingly provide, or to attempt or conspire to provide, material support or resources to Hamas. "}, {"Page_url": "https://rewardsforjustice.net/rewards/hayat-tahrir-al-sham-hts/", "Title": "Hayat Tahrir al-Sham (HTS) – Rewards For Justice", "Reward_amount": null, "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/08/HTS-300x146.png", "date_of_birth": null, "associated_organisation": null, "associated_location": "", "about": "Hayat Tahrir al-Sham (HTS) was formed in 2017 from a merger between al-Nusrah Front (ANF) and several other groups. HTS controls a portion of territory in northwest Syria, with the goal to oust Syria’s Assad regime and replace it with a Sunni Islamic state to further its own agenda as one of al-Qa’ida’s affiliates in Syria. HTS has taken several U.S. citizens hostage since its founding. HTS is an extremist element separate from the Syrian opposition, and exerts varying degrees of influence over local governance and external plotting."}, {"Page_url": "https://rewardsforjustice.net/rewards/hizballah/", "Title": "Hizballah – Rewards For Justice", "Reward_amount": null, "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/08/Hizballah-300x200.png", "date_of_birth": null, "associated_organisation": null, "associated_location": "", "about": "Hizballah is a Lebanon-based terrorist group that receives weapons, training, and funding from Iran, which the Secretary of State designated as a State Sponsor of Terrorism in 1984. Hizballah maintains a large terrorist network and is responsible for multiple large-scale attacks. These include: the 1983 suicide truck bombings of U.S. Embassy Beirut and the U.S. Marine Corps Barracks in Beirut; the 1984 attack on the U.S. Embassy Beirut annex; and the 1985 hijacking of TWA Flight 847. Hizballah was also implicated, along with Iran, in the 1992 attacks on the Israeli embassy in Argentina as well as the 1994 bombing of the Argentine Jewish Mutual Aid Society in Buenos Aires. In 2012, Hizballah operatives conducted a successful suicide bombing attack in Bulgaria. Law enforcement has thwarted attempted Hizballah terrorist attacks and plotting in countries such as Azerbaijan, Cyprus, Egypt, Kuwait, Nigeria, Peru, and Thailand.,On October 8, 1997, the U.S. Department of State designated Hizballah as a Foreign Terrorist Organization under Section 219 of the Immigration and Nationality Act, as amended. Later, on October 31, 2001, the U.S. Department of the Treasury designated Hizballah as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result, all of Hizballah’s property, and interests in property, subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with Hizballah. It is a crime to knowingly provide, or to attempt or conspire to provide, material support or resources to Hizballah."}, {"Page_url": "https://rewardsforjustice.net/rewards/isis-in-the-greater-sahara-isis-gs/", "Title": "ISIS in the Greater Sahara (ISIS-GS) – Rewards For Justice", "Reward_amount": null, "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/H-2-300x217.jpg", "date_of_birth": null, "associated_organisation": null, "associated_location": "", "about": "ISIS in the Greater Sahara (ISIS-GS) was formed in 2015 after it split from al-Mourabitoun, an al-Qa’ida splinter group, and swore allegiance to ISIS. Primarily based in Mali and operating along the Mali-Niger border, the group is also active in Burkina Faso. ISIS-GS has claimed responsibility for several attacks, including the October 4, 2017 attack on a joint U.S.-Nigerien patrol in the region of Tongo Tongo, Niger, which resulted in the deaths of four U.S. soldiers and four Nigerien soldiers. In November 2019, ISIS-GS launched an assault on a Malian military base that killed 54 soldiers.,On May 23, 2018, the U.S. Department of State designated ISIS-GS as a Foreign Terrorist Organization under section 219 of the Immigration and Nationality Act, as amended. Previously, on May 16, 2018, the Department of State designated ISIS-GS as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result, all of ISIS-GS’s property, and interests in property, subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with ISIS-GS. It is a crime to knowingly provide, or to attempt or conspire to provide, material support or resources to ISIS-GS."}, {"Page_url": "https://rewardsforjustice.net/rewards/japanese-red-army-jra/", "Title": "Japanese Red Army (JRA) – Rewards For Justice", "Reward_amount": null, "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/08/Screen-Shot-2021-11-19-at-12.22.53-PM-300x199.png", "date_of_birth": null, "associated_organisation": null, "associated_location": "", "about": "The Japanese Red Army (JRA) was formed around 1970 after breaking away from the Japanese Communist League-Red Army Faction. JRA’s stated goals were to overthrow the Japanese Government and monarchy. JRA conducted multiple attacks around the world, including the 1972 attack on Lod Airport in Israel that killed 26 people and injured 80, the 1975 attempted takeover of the U.S. Embassy in Kuala Lumpur, and the 1988 USO Club bombing in Naples, Italy, which killed five. The group’s leader was arrested in 2000, and the group announced its plans to disband in 2001.,On October 8, 1997, the U.S. Department of State designated JRA as a Foreign Terrorist Organization (FTO) under section 219 of the Immigration and Nationality Act, as amended. On October 8, 2001, the Department of State revoked JRA’s designation as an FTO."}, {"Page_url": "https://rewardsforjustice.net/rewards/jemaah-islamiyah-ji/", "Title": "Jemaah Islamiyah (JI) – Rewards For Justice", "Reward_amount": null, "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/08/JI-300x179.jpeg", "date_of_birth": null, "associated_organisation": null, "associated_location": "", "about": "Jemaah Islamiyah (JI) is a Southeast Asia-based terrorist group that seeks to establish a caliphate in the region. JI is responsible for significant terrorist attacks in the region, including the October 2002 bombing of a Bali nightclub that killed more than 200 people, the August 2003 bombing of the Marriott Hotel in Jakarta that left 12 individuals dead, and the October 2005 suicide bombing in Bali that killed 26 people.,On October 23, 2002, the U.S. Department of State designated JI as a Foreign Terrorist Organization under section 219 of the Immigration and Nationality Act, as amended, and as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result, all of JI’s property and interests in property subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with JI. It is a crime to knowingly provide, or to attempt or conspire to provide, material support or resources to JI."}, {"Page_url": "https://rewardsforjustice.net/rewards/hurras-al-din/", "Title": "Hurras al-Din – Rewards For Justice", "Reward_amount": null, "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/08/HAD-300x221.jpeg", "date_of_birth": null, "associated_organisation": null, "associated_location": "", "about": "Hurras al-Din (HAD) is an al-Qa’ida-affiliated jihadist group that emerged in Syria in early 2018 after several factions broke away from Hayat Tahrir al-Sham (HTS).,On September 10, 2019, the U.S. Department of State designated HAD as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result, all of HAD’s property, and interests in property, subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with HAD."}, {"Page_url": "https://rewardsforjustice.net/rewards/issa-barrey/", "Title": "Issa Barrey – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/08/Issa-Barre-229x300.jpg", "date_of_birth": null, "associated_organisation": "ISIS in the Greater Sahara (ISIS-GS)", "associated_location": "Burkina Faso , Mali , Niger", "about": "Rewards for Justice is offering a reward of up to $5 million for information on Issa Barrey for his participation in the 2017 Tongo Tongo, Niger attack. Issa Barrey is believed to be a key ISIS-Greater Sahara (ISIS-GS) lieutenant.,On October 4, 2017, near the village of Tongo Tongo, Niger, ISIS-GS-linked militants attacked members of a U.S. Special Forces team tasked with training, advising, and assisting Nigerien forces in fighting terrorism. The attack resulted in the deaths of four U.S. and four Nigerien soldiers. Two additional Americans and eight Nigeriens were wounded in the encounter. On January 12, 2018, ISIS-GS leader Adnan Abu Walid al-Sahrawi claimed responsibility for the attack."}, {"Page_url": "https://rewardsforjustice.net/rewards/issa-jimaraou/", "Title": "Issa Jimaraou – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/08/Issa-Jimarou-229x300.jpg", "date_of_birth": null, "associated_organisation": "ISIS in the Greater Sahara (ISIS-GS)", "associated_location": "Burkina Faso , Mali , Niger", "about": "Rewards for Justice is offering a reward of up to $5 million for information on Issa Jimaraou for his participation in the 2017 Tongo Tongo, Niger attack. Issa Jimaraou is a member of ISIS-Greater Sahara (ISIS-GS) and believed to be subordinate to ISIS-GS lieutenants Ousmane Illiassou Djibo, also known as Petit Chapori, and Issa Barrey.,On October 4, 2017, near the village of Tongo Tongo, Niger, ISIS-GS-linked militants attacked members of a U.S. Special Forces team tasked with training, advising, and assisting Nigerien forces in fighting terrorism. The attack resulted in the deaths of four U.S. and four Nigerien soldiers. Two additional Americans and eight Nigeriens were wounded in the encounter. On January 12, 2018, ISIS-GS leader Adnan Abu Walid al-Sahrawi claimed responsibility for the attack."}, {"Page_url": "https://rewardsforjustice.net/rewards/kidnapping-of-cydney-mizell/", "Title": "Kidnapping of Cydney Mizell (Kandahar City, Afghanistan | 2008) – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/08/Mizell_Additional-1-225x300.jpeg,https://rewardsforjustice.net/wp-content/uploads/2021/08/Mizell_Classroom-1-300x195.jpeg,https://rewardsforjustice.net/wp-content/uploads/2021/08/Mizell_Main-1-281x300.jpeg", "date_of_birth": null, "associated_organisation": null, "associated_location": "Afghanistan", "about": "Rewards for Justice is offering a reward of up to $5 million for information leading to the location, recovery, and return of Cydney Mizell.,In January 2008, Cydney Mizell, a U.S. worker for a non-governmental organization, was abducted by unidentified gunmen in Kandahar City, Afghanistan, along with her driver. Mizell was likely killed by her captors in 2008 and may have been buried in the Kandahar area.,Mizell spoke fluent Pashto after living and working in Kandahar for three years supporting Afghan women and children in need."}, {"Page_url": "https://rewardsforjustice.net/rewards/ousmane-illiassou-djibo/", "Title": "Ousmane Illiassou Djibo – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/08/Illiasou-Djibo--229x300.jpg", "date_of_birth": "\n\t\t\t\t\t\t\t1984\t\t\t\t\t\t", "associated_organisation": "ISIS in the Greater Sahara (ISIS-GS)", "associated_location": "Burkina Faso , Mali , Niger", "about": "Rewards for Justice is offering a reward of up to $5 million for information on Ousmane Illiassou Djibo, also known as Petit Chapori and Khaled Foulani, for his participation in the 2017 Tongo Tongo, Niger attack.,Djibo is an Islamic State of Iraq and Syria in the Greater Sahara (ISIS-GS) leader operating in the Menaka Region of Mali. Djibo is a close collaborator and key lieutenant of ISIS-GS leader, Adnan Abu Walid al-Sahrawi (Abu Walid). Djibo directed subordinate ISIS-GS members to develop a network to kidnap or attack Westerners in Niger and surrounding countries. Djibo has also taken part in numerous assaults on local forces. He led ISIS-GS fighters in the July 1, 2019 attack on the Nigerien Armed Forces base in Inates, Tillaberi Region, Niger. He also provided the order for ISIS-GS fighters to take six Nigerien soldiers hostage during an ambush on Nigerien soldiers near Tongo Tongo on May 14, 2019.,On October 4, 2017, near Tongo Tongo, Niger, ISIS-GS-linked militants attacked members of a U.S. Special Forces team tasked with training, advising, and assisting Nigerien forces in fighting terrorism. The attack resulted in the deaths of four U.S. and four Nigerien soldiers. Two additional Americans and eight Nigeriens were wounded in the encounter. On January 12, 2018, ISIS-GS leader Abu Walid claimed responsibility for the attack.,On June 28, 2021, the U.S. Department of State designated Djibo as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result of this designation, among other consequences, all property, and interests in property, of Djibo that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with Djibo. In addition, it is a crime to knowingly provide, or attempt or conspire to provide, material support or resources to ISIS-GS, a U.S.-designated Foreign Terrorist Organization."}, {"Page_url": "https://rewardsforjustice.net/rewards/saudi-hizballah/", "Title": "Saudi Hizballah – Rewards For Justice", "Reward_amount": null, "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/07/H-2-300x217.jpg", "date_of_birth": null, "associated_organisation": null, "associated_location": "", "about": "Founded in the 1980s as a terrorist organization promoting violence against Americans and U.S. property in Saudi Arabia, Saudi Hizballah was responsible for the 1996 bombing of  the Khobar Towers near Dhahran, Saudi Arabia. The attack killed 19 U.S. service members and one Saudi citizen, and wounded hundreds of individuals from various nations."}, {"Page_url": "https://rewardsforjustice.net/rewards/kidnapping-of-abdulbari-al-kotf-sanaa-yemen-august-2018/", "Title": "Kidnapping of Abdulbari al-Kotf (Sana’a, Yemen | August 2018) – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/08/image-2-179x300.png", "date_of_birth": "\n\t\t\t\t\t\t\t1963\t\t\t\t\t\t", "associated_organisation": null, "associated_location": "Yemen", "about": "Rewards for Justice is offering a reward of up to $5 million for information leading to the location, recovery, and safe return of U.S. citizen Abdulbari al-Kotf.,Al-Kotf was taken from his home in Sana’a, Yemen, in late August 2018. At the time of his disappearance, he had been working for Sam Ban Noah of America Organization."}, {"Page_url": "https://rewardsforjustice.net/rewards/abu-ubaydah-yusuf-al-anabi/", "Title": "Abu Ubaydah Yusuf al-Anabi – Rewards For Justice", "Reward_amount": "Up to $7 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/08/abuubaydah1-1-300x230.png,https://rewardsforjustice.net/wp-content/uploads/2021/08/abuubaydah2-1-261x300.jpeg", "date_of_birth": "\n\t\t\t\t\t\t\tJanuary 1, 1969; February 7, 1969\t\t\t\t\t\t", "associated_organisation": "Al-Qa’ida in the Islamic Maghreb (AQIM)", "associated_location": "Algeria , Mali", "about": "Rewards for Justice is offering a reward of up to $7 million for information on Abu Ubaydah Yusuf al-Anabi, also known as Abou Obeida Youssef al-Annabi and Yazid Mubarak. Al-Anabi is the leader of the terrorist organization al-Qa’ida in the Islamic Maghreb (AQIM). AQIM announced al-Anabi as the group’s new leader in November 2020. Al-Anabi pledged allegiance to al-Qa’ida (AQ) leader Ayman al-Zawahiri on AQIM’s behalf and is expected to play a role in AQ’s global management.,Al-Anabi, an Algerian citizen, was previously the leader of AQIM’s Council of Notables and served on AQIM’s Shura Council. Al-Anabi was formerly AQIM’s media chief.,On September 9, 2015, the U.S. Department of State designated al-Anabi as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result of this designation, among other consequences, all property, and interests in property, of al-Anabi that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with al-Anabi. In addition, it is a crime to knowingly provide, or attempt or conspire to provide, material support or resources to AQIM, a U.S.-designated Foreign Terrorist Organization. Al-Anabi was placed on the United Nations Security Council Resolution 1267 (UNSCR 1267) sanctions list on February 29, 2016, making him subject to an international asset freeze, travel ban, and arms embargo."}, {"Page_url": "https://rewardsforjustice.net/rewards/islamic-revolutionary-guard-corps-irgc/", "Title": "Islamic Revolutionary Guard Corps (IRGC) – Rewards For Justice", "Reward_amount": null, "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/08/IRGC-1-300x220.png", "date_of_birth": null, "associated_organisation": null, "associated_location": "", "about": "The Islamic Revolutionary Guard Corps (IRGC), part of Iran’s official military, plays a central role in Iran’s use of terrorism as a key tool of Iranian statecraft. The IRGC plans, organizes, and executes terrorism around the world. In addition, the IRGC has created, supported, and directed other terrorist groups. The IRGC is responsible for numerous attacks targeting Americans and U.S. facilities, including those that have killed U.S. citizens. Since its founding in 1979, the IRGC has gained a substantial role in executing Iran’s foreign policy. The group now wields control over vast segments of Iran’s economy and is influential in Iranian domestic politics.,On April 15, 2019, the U.S. Department of State designated the IRGC, including the IRGC-Qods Force, as a Foreign Terrorist Organization under Section 219 of the Immigration and Nationality Act, as amended. In 2017, the U.S. Department of the Treasury designated the IRGC as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended, for its activities in support of the IRGC-QF. As a result, all of the IRGC’s property, and interests in property, subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with the IRGC. It is a crime to knowingly provide, or to attempt or conspire to provide, material support or resources to the IRGC."}, {"Page_url": "https://rewardsforjustice.net/rewards/salim-jamil-ayyash/", "Title": "Salim Jamil Ayyash – Rewards For Justice", "Reward_amount": "Up to $10 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/08/Salim-Jamil-Ayyash-1-300x284.png,https://rewardsforjustice.net/wp-content/uploads/2021/08/Salim-Jamil-Ayyash2-1-267x300.png,https://rewardsforjustice.net/wp-content/uploads/2021/08/scene1ayyash-1-300x208.png,https://rewardsforjustice.net/wp-content/uploads/2021/08/Scene2ayyash-1-300x111.jpeg", "date_of_birth": "\n\t\t\t\t\t\t\tNovember 10, 1963\t\t\t\t\t\t", "associated_organisation": "Hizballah", "associated_location": "Lebanon", "about": "Rewards for Justice is offering a reward of up to $10 million for information on Salim Jamil Ayyash, also known as Salim Jalil Ayyash and as Jabber. Ayyash is a senior operative in Hizballah’s Unit 121, the terrorist group’s assassination squad, which receives its orders directly from Hizballah secretary general Hasan Nasrallah. Ayyash is known to have been involved in efforts to harm U.S. military personnel.,On December 11, 2020, an international tribunal sentenced Ayyash in absentia to five concurrent life sentences on terrorism-related charges pertaining to the February 2005 suicide truck bombing in Beirut that killed Lebanon’s former Prime Minister Rafik Hariri. The attack also killed 21 others and wounded 226 persons. The tribunal found that Ayyash led the assassination team that carried out the attack on Hariri, and that Ayyash was actively involved in the assassination on the day of the attack."}, {"Page_url": "https://rewardsforjustice.net/rewards/ibrahim-taher/", "Title": "Ibrahim Taher – Rewards For Justice", "Reward_amount": "Up to $10 million", "image_urls": "", "date_of_birth": "\n\t\t\t\t\t\t\tNovember 10, 1963; October 11, 1963\t\t\t\t\t\t", "associated_organisation": null, "associated_location": "Guinea", "about": "Rewards for Justice is offering a reward of up to $10 million for information that leads to the disruption of the financial mechanisms of Hizballah. Ibrahim Taher is a Hizballah financier operating in Guinea. Taher has been identified as one of the most prominent financial supporters of Hizballah in Guinea. He is believed to employ a number of individuals affiliated with Hizballah within the country. ,Taher and an associate sent U.S. dollars collected at one of their commercial facilities to Conakry Airport and bribed Guinean customs officials to allow their currency to pass in luggage. Taher has used his status as Honorary Consul of Lebanon to Cote d’Ivoire to avoid scrutiny while traveling in and out of Guinea.  ,As recently as 2020, a group of Guinea-based Lebanese businessmen including Taher and Hizballah financier Ali Saade flew from Guinea to Lebanon on a special flight with a large amount of money. The group claimed the money was to aid the COVID-19 situation in Lebanon, thereby avoiding scrutiny. COVID-19 relief has been previously used as a cover for transferring funds from Guinea to Lebanon for Hizballah.,On March 4, 2022, the U.S. Department of the Treasury designated Taher as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended, for having materially assisted, sponsored, or provided financial, material, or technological support for, or goods or services to or in support of, Hizballah. As a result of this designation, among other consequences, all property, and interests in property, of Taher that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with Taher. In addition, it is a crime to knowingly provide, or attempt or conspire to provide, material support or resources to Hizballah, a U.S.-designated Foreign Terrorist Organization."}, {"Page_url": "https://rewardsforjustice.net/rewards/ali-saade/", "Title": "Ali Saade – Rewards For Justice", "Reward_amount": "Up to $10 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2022/02/LHSaade-204x300.png", "date_of_birth": "\n\t\t\t\t\t\t\tMay 18, 1942\t\t\t\t\t\t", "associated_organisation": null, "associated_location": "Guinea", "about": "Rewards for Justice is offering a reward of up to $10 million for information that leads to the disruption of the financial mechanisms of Hizballah. Ali Saade is a Hizballah financier operating in Guinea. Saade initiates money transfers from Guinea to Hizballah, transferring funds through Hizballah representatives in Guinea and Lebanon. ,As recently as 2020, a group of Guinea-based Lebanese businessmen including Saade and Hizballah financier Ibrahim Taher flew from Guinea to Lebanon on a special flight with a large amount of money. The group claimed the money was to aid the COVID-19 situation in Lebanon, thereby avoiding scrutiny. COVID-19 relief has been previously used as a cover for transferring funds from Guinea to Lebanon for Hizballah.,Saade is suspected of using fishing boats for illicit activity, such as narcotics trafficking.  ,On March 4, 2022, the U.S. Department of the Treasury designated Saade as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended, for having materially assisted, sponsored, or provided financial, material, or technological support for, or goods or services to or in support of, Hizballah. As a result of this designation, among other consequences, all property, and interests in property, of Saade that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with Saade. In addition, it is a crime to knowingly provide, or attempt or conspire to provide, material support or resources to Hizballah, a U.S.-designated Foreign Terrorist Organization."}, {"Page_url": "https://rewardsforjustice.net/rewards/hasib-muhammad-hadwan/", "Title": "Hasib Muhammad Hadwan – Rewards For Justice", "Reward_amount": "Up to $10 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2022/04/Hadwan-229x300.jpeg", "date_of_birth": "\n\t\t\t\t\t\t\t1959\t\t\t\t\t\t", "associated_organisation": "Hizballah", "associated_location": "Lebanon", "about": "Rewards for Justice is offering a reward of up to $10 million for information that leads to the disruption of the financial mechanisms of Hizballah. Hasib Muhammad Hadwan, also known as Hajj Zayn, is a senior official in Hizballah’s General Secretariat. He is subordinate to Hasan Nasrallah, secretary-general of Hizballah, and is responsible for raising funds from donors and businesspeople outside of Lebanon. As part of their functions and responsibilities in Hizballah, Hadwan and his office manager, Ali al-Sha’ir, use the international financial system to transfer money to Lebanon, while concealing the real purpose behind the fundraising, which is financing the terror organization’s activity.,On September 17, 2021, the U.S. Department of the Treasury designated Hadwan as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result of this designation, among other consequences, all property and interests in property of Hadwan that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with Hadwan. In addition, it is a crime to knowingly provide, or attempt or conspire to provide, material support or resources to Hizballah, a U.S.-designated Foreign Terrorist Organization."}, {"Page_url": "https://rewardsforjustice.net/rewards/isis-financial-network/", "Title": "ISIS’s Financial Network – Rewards For Justice", "Reward_amount": "Up to $10 Million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2022/06/4.webp,https://rewardsforjustice.net/wp-content/uploads/2022/06/7.webp,https://rewardsforjustice.net/wp-content/uploads/2022/06/1.webp,https://rewardsforjustice.net/wp-content/uploads/2022/06/2.webp,https://rewardsforjustice.net/wp-content/uploads/2022/06/3.webp,https://rewardsforjustice.net/wp-content/uploads/2022/06/6.webp,https://rewardsforjustice.net/wp-content/uploads/2022/06/5.webp", "date_of_birth": null, "associated_organisation": "Islamic State in Iraq and Syria (ISIS)", "associated_location": "Indonesia , Iraq , Syria , Turkey", "about": "Rewards for Justice is offering a reward of up to $10 million for information leading to the disruption of the financial mechanisms of the terrorist group Islamic State of Iraq and Syria (ISIS). ISIS relies on financing and facilitation networks to sustain operations and launch attacks in Syria and the surrounding region.,ISIS networks have conducted financial transfers to support ISIS efforts in Syria-based displaced persons camps by collecting funds in Indonesia and Turkey, some of which were used to pay for smuggling children out of the camps and delivering them to ISIS foreign fighters as potential recruits.,ISIS sympathizers in over 40 countries have sent money to ISIS-linked individuals in these camps in support of ISIS’s future resurgence. In al-Hawl — with some 70,000 people, the largest of these displaced persons camps in northeast Syria — ISIS supporters have received up to $20,000 per month via hawala, an informal transfer mechanism; the majority of those financial transfers have originated outside Syria or passed through neighboring countries such as Turkey.,Illicit oil operations and trafficking in looted archaeological objects from Syria and Iraq also have been key sources of revenue that generate hard currency and enable ISIS to carry out its brutal tactics and oppress innocent civilians. ISIS’s damage to and looting of cultural and historical sites in Syria and Iraq have destroyed irreplaceable evidence of ancient life and society.,Ancient and historical coins, jewelry, carved gemstones, sculptures, plaques, and cuneiform tablets are among the types of cultural objects that ISIS has trafficked. With support from the U.S. Department of State, the International Council of Museums developed the Emergency Red Lists of Cultural Objects at Risk to present the categories of cultural objects looted and trafficked from Syria and Iraq. They can be viewed , and ,."}, {"Page_url": "https://rewardsforjustice.net/rewards/al-shabaabs-financial-network/", "Title": "Al-Shabaab’s Financial Network – Rewards For Justice", "Reward_amount": "Up to $10 Million", "image_urls": "", "date_of_birth": null, "associated_organisation": null, "associated_location": "Kenya , Somalia", "about": "Rewards for Justice is offering a reward of up to $10 million for information leading to the disruption of the financial mechanisms of the terrorist organization al-Shabaab. Al-Shabaab’s financial operations and facilitation networks help sustain its operations and fund its terrorist attacks that have resulted in thousands of deaths of innocent civilians and security forces in Somalia and neighboring countries.,Al-Shabaab engages in traditional terrorist funding methods, including bribery, extortion, hawala money transfers, kidnappings for ransom, money laundering, and personal couriers, but it has also developed its own sources of funding and become increasingly independent from external sponsorship. Its newest sources of funding include extortion of elders, businesspeople, and farmers; exploitation of the used automobile trade to its benefit; mobile money transfers, and theft of pastoralists’ livestock. Through territorial expansion, al-Shabaab also engages in illicit activities, such as illegal mining and trade/smuggling of commodities such as charcoal, heroin (which it resells to criminal groups), ivory, livestock, and sugar. Al-Shabaab also imposes taxes on individuals, businesses, pirates, etc., and collects tolls, fees, and taxes on agricultural produce and land.,The Department of State is offering rewards for information leading to the identification and disruption of:,– significant sources of revenue for al-Shabaab (e.g., extortion and taxation, smuggling of contraband, and weapons and drug trade),– exploitation of local natural resources by al-Shabaab (e.g., logging, mining, and smuggling),– financial contributions by donors and financial facilitators to al-Shabaab,– significant transactions by financial institutions and use of money service providers to transfer funds and access the international financial system on al-Shabaab’s behalf,– businesses or investments owned or controlled by al-Shabaab or its financiers,– international activity by front companies tied to al-Shabaab, engaged in financial transactions on its behalf (e.g., used vehicle trade),– criminal schemes involving al-Shabaab members and supporters, who are financially benefiting the organization (e.g., kidnapping-for-ransom operations and theft of pastoralists’ livestock),– illicit financial schemes of al-Shabaab (e.g., money laundering), and transfers of funding and material by al-Shabaab to its terrorist and militia proxies and partners,On March 18, 2008, the U.S. Department of State designated al-Shabaab as a Foreign Terrorist Organization under section 219 of the Immigration and Nationality Act, as amended. Later, on March 19, 2008, the Department of State designated al-Shabaab as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result, all of al-Shabaab’s property, and interests in property, subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with al-Shabaab. It is a crime to knowingly provide, or to attempt or conspire to provide, material support or resources to al-Shabaab."}, {"Page_url": "https://rewardsforjustice.net/rewards/sanaullah-ghafari/", "Title": "Sanaullah Ghafari – Rewards For Justice", "Reward_amount": "Up to $10 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2022/02/image-1-300x169.png", "date_of_birth": "\n\t\t\t\t\t\t\tOctober 28, 1994\t\t\t\t\t\t", "associated_organisation": null, "associated_location": "Afghanistan", "about": "Rewards for Justice is offering a reward of up to $10 million for information on ISIS-K leader Shahab al-Muhajir. In June 2020, ISIS core leadership appointed al-Muhajir, also known as Sanaullah Ghafari, to be the leader of ISIS-K, a U.S.-designated Foreign Terrorist Organization. An ISIS communiqué announcing his appointment described al-Muhajir as an experienced military leader and one of ISIS-K’s “urban lions” in Kabul who has been involved in guerrilla operations and the planning of suicide and complex attacks. Born in 1994 in Afghanistan, he is responsible for approving all ISIS-K operations throughout Afghanistan and arranging funding to,conduct operations."}, {"Page_url": "https://rewardsforjustice.net/rewards/kidnapping-of-ihsan-ashour/", "Title": "Kidnapping of Ihsan Ashour (Baghdad | December 13, 2019) – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2021/12/Ashour-300x169.jpg", "date_of_birth": null, "associated_organisation": null, "associated_location": "Iran , Iraq", "about": "Rewards for Justice is offering a reward of up to $5 million for information leading to those responsible for the December 13, 2019 abduction of U.S. citizen Ihsan Ashour in Baghdad.,Ashour, who holds dual U.S.-Iraqi citizenship, was in Iraq on personal matters. He was abducted by approximately 10 armed men in masks and black clothing in al-Sha’ab District, near Sadr City, during the mass demonstration in the capital’s Tahrir Square. His kidnappers choked, beat, and administered electrical shocks to his body before driving him across the border to Iran. Inside Iran, another group of captors interrogated Ashour about alleged espionage activities. After determining he was not a spy, his captors returned Ashour to Iraq, where he continued to be tortured and interrogated. He was released in May 2020, and he returned home to the United States."}, {"Page_url": "https://rewardsforjustice.net/rewards/mohamoud-abdi-aden/", "Title": "Mohamoud Abdi Aden – Rewards For Justice", "Reward_amount": "Up to $10 Million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2023/01/Screenshot-2023-01-10-at-9.43.34-AM.png", "date_of_birth": "\n\t\t\t\t\t\t\t March 13, 1985 \t\t\t\t\t\t", "associated_organisation": null, "associated_location": "Kenya , Somalia", "about": "Rewards for Justice is offering a reward of up to $10 million for information on Mohamoud Abdi Aden, a leader of the al-Shabaab terrorist group who helped plan the January 15, 2019 attack on the DusitD2 Hotel complex in Nairobi, Kenya. During the assault, al-Shabaab gunmen armed with explosives, automatic weapons, and grenades attacked the DusitD2 commercial center, a 6-building complex of shops, offices, and a hotel. At least 21 people, including one U.S. citizen, were killed in the assault.,In October 2022, the Department of State designated Aden as a Specially Designated Global Terrorist (SDGT) under Executive Order (E.O.) 13224, as amended., "}, {"Page_url": "https://rewardsforjustice.net/rewards/terrorist-attack-against-americans-in-bangladesh/", "Title": "Terrorist Attack Against Americans in Bangladesh – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "", "date_of_birth": null, "associated_organisation": null, "associated_location": "Bangladesh", "about": "Rewards for Justice is offering a reward of up to $5 million for information on the killing of Avijit Roy and the concurrent attack on Rafida Bonya Ahmed in Dhaka, Bangladesh.,On February 26, 2015, Bangladesh-born U.S. citizens and married couple Roy and Ahmed were visiting Dhaka to attend a book fair when they were attacked by unidentified assailants with machetes. Roy was hacked to death. Ahmed survived with critical injuries, including a severed thumb and multiple head wounds.,As an author, blogger, and activist, Roy challenged fundamentalism in Bangladesh by advocating for freedom of expression. He coordinated international protests to raise awareness of the plight of imprisoned atheist bloggers in Bangladesh and was a well-known critic of social repression. He was targeted and killed for his outspoken beliefs and activism.,Ansarullah Bangla Team (ABT), a Bangladeshi terrorist group, claimed responsibility for the attack. ABT seeks to radicalize youths to kill those deemed by them to be anti-Islamic. Shortly thereafter, Asim Umar, the now-deceased leader of al-Qa’ida in the Indian Subcontinent (AQIS), posted a widely circulated video claiming that AQIS followers, including those who have yet to be arrested, were responsible for the attack on Roy and Ahmed.,On July 1, 2016, the U.S. Department of State designated AQIS as a Foreign Terrorist Organization under section 219 of the Immigration and Nationality Act, as amended. Previously, on June 30, 2016, the Department of State designated AQIS as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result, all of AQIS’s property and interests in property subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with AQIS. It is a crime to knowingly provide, or to attempt or conspire to provide, material support or resources to AQIS.,Those responsible for the attack are believed to be in Bangladesh."}, {"Page_url": "https://rewardsforjustice.net/rewards/ali-mohamed-rage/", "Title": "Ali Mohamed Rage – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2023/02/Screenshot-2023-02-21-at-9.56.27-AM-291x300.png", "date_of_birth": "\n\t\t\t\t\t\t\t1966\t\t\t\t\t\t", "associated_organisation": null, "associated_location": "Somalia", "about": "Rewards for Justice is offering a reward of up to $5 million for information on Ali Mohamed Rage. Rage is a key leader and chief spokesman of al-Shabaab, a U.S.-designated Foreign Terrorist Organization. Rage has been involved in planning terrorist attacks in Kenya and Somalia for the group. He became al-Shabaab’s top spokesman in May 2009. On August 6, 2021, the Department of State designated him as a Specially Designated Global Terrorist (SDGT) under Executive Order (E.O.) 13224, as amended. "}, {"Page_url": "https://rewardsforjustice.net/rewards/ali-al-shair/", "Title": "Ali al-Sha’ir – Rewards For Justice", "Reward_amount": "Up to $10 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2022/04/al-Shair-250x300.jpeg", "date_of_birth": "\n\t\t\t\t\t\t\tJanuary 26, 1967\t\t\t\t\t\t", "associated_organisation": "Hizballah", "associated_location": "Lebanon", "about": "Rewards for Justice is offering a reward of up to $10 million for information that leads to the disruption of the financial mechanisms of Hizballah. Ali al-Sha’ir serves as office manager to Hizballah financier Hasib Muhammad Hadwan and has been accepting financial contributions on behalf of Hizballah since 2000. As part of their functions and responsibilities in Hizballah, al-Sha’ir and Hadwan use the international financial system to transfer money to Lebanon, while concealing the real purpose behind the fundraising, which is financing the terror organization’s activity.,On September 17, 2021, the U.S. Department of the Treasury designated al-Sha’ir as a Specially Designated Global Terrorist pursuant to Executive Order 13224, as amended. As a result of this designation, among other consequences, all property and interests in property of al-Sha’ir that are subject to U.S. jurisdiction are blocked, and U.S. persons are generally prohibited from engaging in any transactions with al-Sha’ir. In addition, it is a crime to knowingly provide, or attempt or conspire to provide, material support or resources to Hizballah, a U.S.-designated Foreign Terrorist Organization."}, {"Page_url": "https://rewardsforjustice.net/rewards/abu-ali-al-tunisi/", "Title": "Abu Ali al-Tunisi – Rewards For Justice", "Reward_amount": "Up to $5 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2022/11/Al-Tunisi1.png,https://rewardsforjustice.net/wp-content/uploads/2022/11/Al-Tunisi2.png,https://rewardsforjustice.net/wp-content/uploads/2022/11/Al-Tunisi3-300x260.png,https://rewardsforjustice.net/wp-content/uploads/2022/11/Al-Tunisi4-204x300.png", "date_of_birth": null, "associated_organisation": null, "associated_location": "Iraq", "about": "Rewards for Justice is offering a reward of up to $5 million for information leading to the identification or location of Abu Ali al-Tunisi. Al-Tunisi is a key leader of the Islamic State of Iraq and ash-Sham (ISIS), a terrorist organization that continues to pose a threat to the United States and its interests abroad.,Abu Ali al-Tunisi is the leader of manufacturing for ISIS in Iraq. He has conducted training for ISIS members, including instruction on how to make explosives, suicide vests, and improvised explosive devices (IEDs). Al-Tunisi also provided advanced training on weapons development and the manufacturing of chemical weapons.,Abu Ali al-Tunisi has injuries to his right hand and right eye.,On December 17, 2004, the U.S. Department of State designated ISIS (formerly known as AQI) as a Foreign Terrorist Organization under section 219 of the Immigration and Nationality Act, as amended."}, {"Page_url": "https://rewardsforjustice.net/rewards/attack-on-manda-bay-airfield-kenya/", "Title": "Attack on Manda Bay Airfield, Kenya – Rewards For Justice", "Reward_amount": "Up to $10 Million", "image_urls": "", "date_of_birth": null, "associated_organisation": null, "associated_location": "Kenya", "about": "Rewards for Justice is offering a reward of up to $10 million for information on Maalim Ayman and any other individual responsible for the January 5, 2020, terrorist attack on Manda Bay Airfield, Kenya. The Manda Bay facility is a Kenya Defense Forces military base utilized by U.S. armed forces to provide training and counterterrorism support to East African partners, respond to crises, and protect U.S. interests in the region.,In the pre-dawn hours, al-Shabaab militants launched mortar rounds at the Kenyan and U.S. positions inside the base and simultaneously fired rocket-propelled grenades (RPGs) and small arms at the adjacent Manda Bay Airfield. Two DoD contractor pilots, both U.S. citizens, were killed when their military aircraft was hit by RPGs on the tarmac of the airfield. A third DoD contractor, also a U.S. citizen, survived the explosion with serious injuries. A U.S. Army specialist acting as an air traffic controller was killed in the ensuing firefight, and two other U.S. citizen service members were injured.,In a video subsequently released by al-Shabaab’s official Shahada News Agency, a spokesperson for the group claimed responsibility for the attack.,Maalim Ayman, the leader of Jaysh Ayman, an al-Shabaab unit conducting terrorist attacks and operations in Kenya and Somalia, was responsible for preparing the January 2020 attack. In November 2020, the Department of State designated Ayman as a Specially Designated Global Terrorist (SDGT) under Executive Order (E.O.) 13224, as amended.,Al-Shabaab — al-Qa’ida’s principal affiliate in East Africa — is responsible for numerous terrorist attacks in Kenya, Somalia, and neighboring countries that have killed thousands of people, including U.S. citizens. The Department of State designated al-Shabaab as a Foreign Terrorist Organization (FTO) and Specially Designated Global Terrorist (SDGT) in March 2008. In April 2010, al-Shabaab was also designated by the UNSC’s Somalia Sanctions Committee pursuant to paragraph 8 of resolution 1844 (2008)."}, {"Page_url": "https://rewardsforjustice.net/rewards/attack-at-kabuls-international-airport/", "Title": "Attack at Kabul’s International Airport – Rewards For Justice", "Reward_amount": "Up to $10 million", "image_urls": "https://rewardsforjustice.net/wp-content/uploads/2022/02/website-3-300x169.jpg", "date_of_birth": null, "associated_organisation": null, "associated_location": "Afghanistan", "about": "Rewards for Justice is offering a reward of up to $10 million for information on those responsible for the August 26, 2021 terrorist attack at the international airport in Kabul, Afghanistan. A suicide bomber attacked the airport as the United States and other governments undertook large-scale evacuation efforts of their citizens and vulnerable Afghans. At least 185 people were killed in the attack, including 13 U.S. service members supporting evacuation operations. More than 150 people, including 18 U.S. service members, were injured. ISIS-K, a U.S.-designated Foreign Terrorist Organization, claimed responsibility for the attack."}, {"Page_url": "https://rewardsforjustice.net/rewards/maalim-ayman/", "Title": "Maalim Ayman – Rewards For Justice", "Reward_amount": "Up to $10 million", "image_urls": "", "date_of_birth": null, "associated_organisation": null, "associated_location": "Somalia", "about": "Rewards for Justice is offering a reward of up to $10 million for information on Maalim Ayman, leader of Jaysh Ayman, an al-Shabaab unit that has conducted terrorist attacks in Kenya and Somalia. On January 5, 2020, al-Shabaab terrorists attacked Kenyan and U.S. personnel at Manda Bay Airfield, Kenya, killing two U.S. contractor pilots and a U.S. Army specialist acting as an air traffic controller. A third U.S. contractor and two other U.S. service members were injured in the attack.,Maalim Ayman was responsible for preparing the January 2020 attack. In November 2020, the Department of State designated Ayman as a Specially Designated Global Terrorist (SDGT) under Executive Order (E.O.) 13224, as amended.,The Manda Bay facility is a Kenya Defense Forces military base utilized by U.S. armed forces to provide training and counterterrorism support to East African partners, respond to crises, and protect U.S. interests in the region."}, {"Page_url": "https://rewardsforjustice.net/rewards/attack-on-dusitd2-hotel-complex-nairobi-kenya/", "Title": "Attack on DusitD2 Hotel Complex, Nairobi, Kenya – Rewards For Justice", "Reward_amount": "Up to $10 Million", "image_urls": "", "date_of_birth": null, "associated_organisation": null, "associated_location": "Kenya", "about": "Rewards for Justice is offering a reward of up to $10 million for information on Mohamoud Abdi Aden and any other individual responsible for the 2019 attack by al-Shabaab terrorists on the DusitD2 Hotel complex in Nairobi, Kenya. On the afternoon of January 15, 2019, al-Shabaab gunmen armed with explosives, automatic weapons, and grenades attacked the DusitD2 commercial center, a 6-building complex of shops, offices, and a hotel. At least 21 people, including one U.S. citizen, were killed in the assault. Al-Shabaab — an affiliate of the al-Qa’ida terrorist organization — released live updates throughout the attack via its official Shahada News Agency and issued a press release in which it stated that the attack was in response to guidance from then al-Qa’ida leader Ayman Zawahiri.,Aden, an al-Shabaab leader, helped plan the January 2019 attack. On October 17, 2022, the Department of State designated him as a Specially Designated Global Terrorist (SDGT) under Executive Order (E.O.) 13224, as amended.,Al-Shabaab is responsible for numerous terrorist attacks in Kenya, Somalia, and neighboring countries that have killed thousands of people, including U.S. citizens. The Department of State designated al-Shabaab as a Foreign Terrorist Organization (FTO) and Specially Designated Global Terrorist (SDGT) in March 2008. In April 2010, al-Shabaab was also designated by the UN Security Council’s Somalia Sanctions Committee pursuant to paragraph 8 of resolution 1844 (2008)."}]